// jshint ignore: start
+function($){

$.rawCitiesData = [
    {
        "code": "1",
        "name": "北京市",
        "sub": [
            {
                "code": "45052",
                "name": "北京市",
                "sub": [
                    {
                        "code": "37",
                        "name": "东城区"
                    },
                    {
                        "code": "38",
                        "name": "西城区"
                    },
                    {
                        "code": "39",
                        "name": "崇文区"
                    },
                    {
                        "code": "40",
                        "name": "宣武区"
                    },
                    {
                        "code": "41",
                        "name": "朝阳区"
                    },
                    {
                        "code": "42",
                        "name": "丰台区"
                    },
                    {
                        "code": "43",
                        "name": "石景山区"
                    },
                    {
                        "code": "44",
                        "name": "海淀区"
                    },
                    {
                        "code": "45",
                        "name": "门头沟区"
                    },
                    {
                        "code": "46",
                        "name": "房山区"
                    },
                    {
                        "code": "47",
                        "name": "通州区"
                    },
                    {
                        "code": "48",
                        "name": "顺义区"
                    },
                    {
                        "code": "49",
                        "name": "昌平区"
                    },
                    {
                        "code": "50",
                        "name": "大兴区"
                    },
                    {
                        "code": "51",
                        "name": "怀柔区"
                    },
                    {
                        "code": "52",
                        "name": "平谷区"
                    },
                    {
                        "code": "53",
                        "name": "密云县"
                    },
                    {
                        "code": "54",
                        "name": "延庆县"
                    }
                ]
            }
        ]
    },
    {
        "code": "2",
        "name": "天津市",
        "sub": [
            {
                "code": "45053",
                "name": "天津市",
                "sub": [
                    {
                        "code": "55",
                        "name": "和平区"
                    },
                    {
                        "code": "56",
                        "name": "河东区"
                    },
                    {
                        "code": "57",
                        "name": "河西区"
                    },
                    {
                        "code": "58",
                        "name": "南开区"
                    },
                    {
                        "code": "59",
                        "name": "河北区"
                    },
                    {
                        "code": "60",
                        "name": "红桥区"
                    },
                    {
                        "code": "61",
                        "name": "塘沽区"
                    },
                    {
                        "code": "62",
                        "name": "汉沽区"
                    },
                    {
                        "code": "63",
                        "name": "大港区"
                    },
                    {
                        "code": "64",
                        "name": "东丽区"
                    },
                    {
                        "code": "65",
                        "name": "西青区"
                    },
                    {
                        "code": "66",
                        "name": "津南区"
                    },
                    {
                        "code": "67",
                        "name": "北辰区"
                    },
                    {
                        "code": "68",
                        "name": "武清区"
                    },
                    {
                        "code": "69",
                        "name": "宝坻区"
                    },
                    {
                        "code": "70",
                        "name": "宁河县"
                    },
                    {
                        "code": "71",
                        "name": "静海县"
                    },
                    {
                        "code": "72",
                        "name": "蓟县"
                    }
                ]
            }
        ]
    },
    {
        "code": "3",
        "name": "河北省",
        "sub": [
            {
                "code": "73",
                "name": "石家庄市",
                "sub": [
                    {
                        "code": "1126",
                        "name": "井陉县"
                    },
                    {
                        "code": "1127",
                        "name": "井陉矿区"
                    },
                    {
                        "code": "1128",
                        "name": "元氏县"
                    },
                    {
                        "code": "1129",
                        "name": "平山县"
                    },
                    {
                        "code": "1130",
                        "name": "新乐市"
                    },
                    {
                        "code": "1131",
                        "name": "新华区"
                    },
                    {
                        "code": "1132",
                        "name": "无极县"
                    },
                    {
                        "code": "1133",
                        "name": "晋州市"
                    },
                    {
                        "code": "1134",
                        "name": "栾城县"
                    },
                    {
                        "code": "1135",
                        "name": "桥东区"
                    },
                    {
                        "code": "1136",
                        "name": "桥西区"
                    },
                    {
                        "code": "1137",
                        "name": "正定县"
                    },
                    {
                        "code": "1138",
                        "name": "深泽县"
                    },
                    {
                        "code": "1139",
                        "name": "灵寿县"
                    },
                    {
                        "code": "1140",
                        "name": "藁城市"
                    },
                    {
                        "code": "1141",
                        "name": "行唐县"
                    },
                    {
                        "code": "1142",
                        "name": "裕华区"
                    },
                    {
                        "code": "1143",
                        "name": "赞皇县"
                    },
                    {
                        "code": "1144",
                        "name": "赵县"
                    },
                    {
                        "code": "1145",
                        "name": "辛集市"
                    },
                    {
                        "code": "1146",
                        "name": "长安区"
                    },
                    {
                        "code": "1147",
                        "name": "高邑县"
                    },
                    {
                        "code": "1148",
                        "name": "鹿泉市"
                    }
                ]
            },
            {
                "code": "74",
                "name": "唐山市",
                "sub": [
                    {
                        "code": "1149",
                        "name": "丰南区"
                    },
                    {
                        "code": "1150",
                        "name": "丰润区"
                    },
                    {
                        "code": "1151",
                        "name": "乐亭县"
                    },
                    {
                        "code": "1152",
                        "name": "古冶区"
                    },
                    {
                        "code": "1153",
                        "name": "唐海县"
                    },
                    {
                        "code": "1154",
                        "name": "开平区"
                    },
                    {
                        "code": "1155",
                        "name": "滦南县"
                    },
                    {
                        "code": "1156",
                        "name": "滦县"
                    },
                    {
                        "code": "1157",
                        "name": "玉田县"
                    },
                    {
                        "code": "1158",
                        "name": "路北区"
                    },
                    {
                        "code": "1159",
                        "name": "路南区"
                    },
                    {
                        "code": "1160",
                        "name": "迁安市"
                    },
                    {
                        "code": "1161",
                        "name": "迁西县"
                    },
                    {
                        "code": "1162",
                        "name": "遵化市"
                    }
                ]
            },
            {
                "code": "75",
                "name": "秦皇岛市",
                "sub": [
                    {
                        "code": "1163",
                        "name": "北戴河区"
                    },
                    {
                        "code": "1164",
                        "name": "卢龙县"
                    },
                    {
                        "code": "1165",
                        "name": "山海关区"
                    },
                    {
                        "code": "1166",
                        "name": "抚宁县"
                    },
                    {
                        "code": "1167",
                        "name": "昌黎县"
                    },
                    {
                        "code": "1168",
                        "name": "海港区"
                    },
                    {
                        "code": "1169",
                        "name": "青龙满族自治县"
                    }
                ]
            },
            {
                "code": "76",
                "name": "邯郸市",
                "sub": [
                    {
                        "code": "1170",
                        "name": "丛台区"
                    },
                    {
                        "code": "1171",
                        "name": "临漳县"
                    },
                    {
                        "code": "1172",
                        "name": "复兴区"
                    },
                    {
                        "code": "1173",
                        "name": "大名县"
                    },
                    {
                        "code": "1174",
                        "name": "峰峰矿区"
                    },
                    {
                        "code": "1175",
                        "name": "广平县"
                    },
                    {
                        "code": "1176",
                        "name": "成安县"
                    },
                    {
                        "code": "1177",
                        "name": "曲周县"
                    },
                    {
                        "code": "1178",
                        "name": "武安市"
                    },
                    {
                        "code": "1179",
                        "name": "永年县"
                    },
                    {
                        "code": "1180",
                        "name": "涉县"
                    },
                    {
                        "code": "1181",
                        "name": "磁县"
                    },
                    {
                        "code": "1182",
                        "name": "肥乡县"
                    },
                    {
                        "code": "1183",
                        "name": "邯山区"
                    },
                    {
                        "code": "1184",
                        "name": "邯郸县"
                    },
                    {
                        "code": "1185",
                        "name": "邱县"
                    },
                    {
                        "code": "1186",
                        "name": "馆陶县"
                    },
                    {
                        "code": "1187",
                        "name": "魏县"
                    },
                    {
                        "code": "1188",
                        "name": "鸡泽县"
                    }
                ]
            },
            {
                "code": "77",
                "name": "邢台市",
                "sub": [
                    {
                        "code": "1189",
                        "name": "临城县"
                    },
                    {
                        "code": "1190",
                        "name": "临西县"
                    },
                    {
                        "code": "1191",
                        "name": "任县"
                    },
                    {
                        "code": "1192",
                        "name": "内丘县"
                    },
                    {
                        "code": "1193",
                        "name": "南和县"
                    },
                    {
                        "code": "1194",
                        "name": "南宫市"
                    },
                    {
                        "code": "1195",
                        "name": "威县"
                    },
                    {
                        "code": "1196",
                        "name": "宁晋县"
                    },
                    {
                        "code": "1197",
                        "name": "巨鹿县"
                    },
                    {
                        "code": "1198",
                        "name": "平乡县"
                    },
                    {
                        "code": "1199",
                        "name": "广宗县"
                    },
                    {
                        "code": "1200",
                        "name": "新河县"
                    },
                    {
                        "code": "1201",
                        "name": "柏乡县"
                    },
                    {
                        "code": "1202",
                        "name": "桥东区"
                    },
                    {
                        "code": "1203",
                        "name": "桥西区"
                    },
                    {
                        "code": "1204",
                        "name": "沙河市"
                    },
                    {
                        "code": "1205",
                        "name": "清河县"
                    },
                    {
                        "code": "1206",
                        "name": "邢台县"
                    },
                    {
                        "code": "1207",
                        "name": "隆尧县"
                    }
                ]
            },
            {
                "code": "78",
                "name": "保定市",
                "sub": [
                    {
                        "code": "1208",
                        "name": "北市区"
                    },
                    {
                        "code": "1209",
                        "name": "南市区"
                    },
                    {
                        "code": "1210",
                        "name": "博野县"
                    },
                    {
                        "code": "1211",
                        "name": "唐县"
                    },
                    {
                        "code": "1212",
                        "name": "安国市"
                    },
                    {
                        "code": "1213",
                        "name": "安新县"
                    },
                    {
                        "code": "1214",
                        "name": "定兴县"
                    },
                    {
                        "code": "1215",
                        "name": "定州市"
                    },
                    {
                        "code": "1216",
                        "name": "容城县"
                    },
                    {
                        "code": "1217",
                        "name": "徐水县"
                    },
                    {
                        "code": "1218",
                        "name": "新市区"
                    },
                    {
                        "code": "1219",
                        "name": "易县"
                    },
                    {
                        "code": "1220",
                        "name": "曲阳县"
                    },
                    {
                        "code": "1221",
                        "name": "望都县"
                    },
                    {
                        "code": "1222",
                        "name": "涞水县"
                    },
                    {
                        "code": "1223",
                        "name": "涞源县"
                    },
                    {
                        "code": "1224",
                        "name": "涿州市"
                    },
                    {
                        "code": "1225",
                        "name": "清苑县"
                    },
                    {
                        "code": "1226",
                        "name": "满城县"
                    },
                    {
                        "code": "1227",
                        "name": "蠡县"
                    },
                    {
                        "code": "1228",
                        "name": "阜平县"
                    },
                    {
                        "code": "1229",
                        "name": "雄县"
                    },
                    {
                        "code": "1230",
                        "name": "顺平县"
                    },
                    {
                        "code": "1231",
                        "name": "高碑店市"
                    },
                    {
                        "code": "1232",
                        "name": "高阳县"
                    }
                ]
            },
            {
                "code": "79",
                "name": "张家口市",
                "sub": [
                    {
                        "code": "1233",
                        "name": "万全县"
                    },
                    {
                        "code": "1234",
                        "name": "下花园区"
                    },
                    {
                        "code": "1235",
                        "name": "宣化区"
                    },
                    {
                        "code": "1236",
                        "name": "宣化县"
                    },
                    {
                        "code": "1237",
                        "name": "尚义县"
                    },
                    {
                        "code": "1238",
                        "name": "崇礼县"
                    },
                    {
                        "code": "1239",
                        "name": "康保县"
                    },
                    {
                        "code": "1240",
                        "name": "张北县"
                    },
                    {
                        "code": "1241",
                        "name": "怀安县"
                    },
                    {
                        "code": "1242",
                        "name": "怀来县"
                    },
                    {
                        "code": "1243",
                        "name": "桥东区"
                    },
                    {
                        "code": "1244",
                        "name": "桥西区"
                    },
                    {
                        "code": "1245",
                        "name": "沽源县"
                    },
                    {
                        "code": "1246",
                        "name": "涿鹿县"
                    },
                    {
                        "code": "1247",
                        "name": "蔚县"
                    },
                    {
                        "code": "1248",
                        "name": "赤城县"
                    },
                    {
                        "code": "1249",
                        "name": "阳原县"
                    }
                ]
            },
            {
                "code": "80",
                "name": "承德市",
                "sub": [
                    {
                        "code": "1250",
                        "name": "丰宁满族自治县"
                    },
                    {
                        "code": "1251",
                        "name": "兴隆县"
                    },
                    {
                        "code": "1252",
                        "name": "双桥区"
                    },
                    {
                        "code": "1253",
                        "name": "双滦区"
                    },
                    {
                        "code": "1254",
                        "name": "围场满族蒙古族自治县"
                    },
                    {
                        "code": "1255",
                        "name": "宽城满族自治县"
                    },
                    {
                        "code": "1256",
                        "name": "平泉县"
                    },
                    {
                        "code": "1257",
                        "name": "承德县"
                    },
                    {
                        "code": "1258",
                        "name": "滦平县"
                    },
                    {
                        "code": "1259",
                        "name": "隆化县"
                    },
                    {
                        "code": "1260",
                        "name": "鹰手营子矿区"
                    }
                ]
            },
            {
                "code": "81",
                "name": "衡水市",
                "sub": [
                    {
                        "code": "1261",
                        "name": "冀州市"
                    },
                    {
                        "code": "1262",
                        "name": "安平县"
                    },
                    {
                        "code": "1263",
                        "name": "故城县"
                    },
                    {
                        "code": "1264",
                        "name": "景县"
                    },
                    {
                        "code": "1265",
                        "name": "枣强县"
                    },
                    {
                        "code": "1266",
                        "name": "桃城区"
                    },
                    {
                        "code": "1267",
                        "name": "武强县"
                    },
                    {
                        "code": "1268",
                        "name": "武邑县"
                    },
                    {
                        "code": "1269",
                        "name": "深州市"
                    },
                    {
                        "code": "1270",
                        "name": "阜城县"
                    },
                    {
                        "code": "1271",
                        "name": "饶阳县"
                    }
                ]
            },
            {
                "code": "82",
                "name": "廊坊市",
                "sub": [
                    {
                        "code": "1272",
                        "name": "三河市"
                    },
                    {
                        "code": "1273",
                        "name": "固安县"
                    },
                    {
                        "code": "1274",
                        "name": "大厂回族自治县"
                    },
                    {
                        "code": "1275",
                        "name": "大城县"
                    },
                    {
                        "code": "1276",
                        "name": "安次区"
                    },
                    {
                        "code": "1277",
                        "name": "广阳区"
                    },
                    {
                        "code": "1278",
                        "name": "文安县"
                    },
                    {
                        "code": "1279",
                        "name": "永清县"
                    },
                    {
                        "code": "1280",
                        "name": "霸州市"
                    },
                    {
                        "code": "1281",
                        "name": "香河县"
                    }
                ]
            },
            {
                "code": "83",
                "name": "沧州市",
                "sub": [
                    {
                        "code": "1282",
                        "name": "东光县"
                    },
                    {
                        "code": "1283",
                        "name": "任丘市"
                    },
                    {
                        "code": "1284",
                        "name": "南皮县"
                    },
                    {
                        "code": "1285",
                        "name": "吴桥县"
                    },
                    {
                        "code": "1286",
                        "name": "孟村回族自治县"
                    },
                    {
                        "code": "1287",
                        "name": "新华区"
                    },
                    {
                        "code": "1288",
                        "name": "沧县"
                    },
                    {
                        "code": "1289",
                        "name": "河间市"
                    },
                    {
                        "code": "1290",
                        "name": "泊头市"
                    },
                    {
                        "code": "1291",
                        "name": "海兴县"
                    },
                    {
                        "code": "1292",
                        "name": "献县"
                    },
                    {
                        "code": "1293",
                        "name": "盐山县"
                    },
                    {
                        "code": "1294",
                        "name": "肃宁县"
                    },
                    {
                        "code": "1295",
                        "name": "运河区"
                    },
                    {
                        "code": "1296",
                        "name": "青县"
                    },
                    {
                        "code": "1297",
                        "name": "黄骅市"
                    }
                ]
            }
        ]
    },
    {
        "code": "4",
        "name": "山西省",
        "sub": [
            {
                "code": "84",
                "name": "太原市",
                "sub": [
                    {
                        "code": "1298",
                        "name": "万柏林区"
                    },
                    {
                        "code": "1299",
                        "name": "古交市"
                    },
                    {
                        "code": "1300",
                        "name": "娄烦县"
                    },
                    {
                        "code": "1301",
                        "name": "小店区"
                    },
                    {
                        "code": "1302",
                        "name": "尖草坪区"
                    },
                    {
                        "code": "1303",
                        "name": "晋源区"
                    },
                    {
                        "code": "1304",
                        "name": "杏花岭区"
                    },
                    {
                        "code": "1305",
                        "name": "清徐县"
                    },
                    {
                        "code": "1306",
                        "name": "迎泽区"
                    },
                    {
                        "code": "1307",
                        "name": "阳曲县"
                    }
                ]
            },
            {
                "code": "85",
                "name": "大同市",
                "sub": [
                    {
                        "code": "1308",
                        "name": "南郊区"
                    },
                    {
                        "code": "1309",
                        "name": "城区"
                    },
                    {
                        "code": "1310",
                        "name": "大同县"
                    },
                    {
                        "code": "1311",
                        "name": "天镇县"
                    },
                    {
                        "code": "1312",
                        "name": "左云县"
                    },
                    {
                        "code": "1313",
                        "name": "广灵县"
                    },
                    {
                        "code": "1314",
                        "name": "新荣区"
                    },
                    {
                        "code": "1315",
                        "name": "浑源县"
                    },
                    {
                        "code": "1316",
                        "name": "灵丘县"
                    },
                    {
                        "code": "1317",
                        "name": "矿区"
                    },
                    {
                        "code": "1318",
                        "name": "阳高县"
                    }
                ]
            },
            {
                "code": "86",
                "name": "阳泉市",
                "sub": [
                    {
                        "code": "1319",
                        "name": "城区"
                    },
                    {
                        "code": "1320",
                        "name": "平定县"
                    },
                    {
                        "code": "1321",
                        "name": "盂县"
                    },
                    {
                        "code": "1322",
                        "name": "矿区"
                    },
                    {
                        "code": "1323",
                        "name": "郊区"
                    }
                ]
            },
            {
                "code": "87",
                "name": "长治市",
                "sub": [
                    {
                        "code": "1324",
                        "name": "城区"
                    },
                    {
                        "code": "1325",
                        "name": "壶关县"
                    },
                    {
                        "code": "1326",
                        "name": "屯留县"
                    },
                    {
                        "code": "1327",
                        "name": "平顺县"
                    },
                    {
                        "code": "1328",
                        "name": "武乡县"
                    },
                    {
                        "code": "1329",
                        "name": "沁县"
                    },
                    {
                        "code": "1330",
                        "name": "沁源县"
                    },
                    {
                        "code": "1331",
                        "name": "潞城市"
                    },
                    {
                        "code": "1332",
                        "name": "襄垣县"
                    },
                    {
                        "code": "1333",
                        "name": "郊区"
                    },
                    {
                        "code": "1334",
                        "name": "长子县"
                    },
                    {
                        "code": "1335",
                        "name": "长治县"
                    },
                    {
                        "code": "1336",
                        "name": "黎城县"
                    }
                ]
            },
            {
                "code": "88",
                "name": "晋城市",
                "sub": [
                    {
                        "code": "1337",
                        "name": "城区"
                    },
                    {
                        "code": "1338",
                        "name": "沁水县"
                    },
                    {
                        "code": "1339",
                        "name": "泽州县"
                    },
                    {
                        "code": "1340",
                        "name": "阳城县"
                    },
                    {
                        "code": "1341",
                        "name": "陵川县"
                    },
                    {
                        "code": "1342",
                        "name": "高平市"
                    }
                ]
            },
            {
                "code": "89",
                "name": "朔州市",
                "sub": [
                    {
                        "code": "1343",
                        "name": "右玉县"
                    },
                    {
                        "code": "1344",
                        "name": "山阴县"
                    },
                    {
                        "code": "1345",
                        "name": "平鲁区"
                    },
                    {
                        "code": "1346",
                        "name": "应县"
                    },
                    {
                        "code": "1347",
                        "name": "怀仁县"
                    },
                    {
                        "code": "1348",
                        "name": "朔城区"
                    }
                ]
            },
            {
                "code": "90",
                "name": "晋中市",
                "sub": [
                    {
                        "code": "1349",
                        "name": "介休市"
                    },
                    {
                        "code": "1350",
                        "name": "和顺县"
                    },
                    {
                        "code": "1351",
                        "name": "太谷县"
                    },
                    {
                        "code": "1352",
                        "name": "寿阳县"
                    },
                    {
                        "code": "1353",
                        "name": "左权县"
                    },
                    {
                        "code": "1354",
                        "name": "平遥县"
                    },
                    {
                        "code": "1355",
                        "name": "昔阳县"
                    },
                    {
                        "code": "1356",
                        "name": "榆次区"
                    },
                    {
                        "code": "1357",
                        "name": "榆社县"
                    },
                    {
                        "code": "1358",
                        "name": "灵石县"
                    },
                    {
                        "code": "1359",
                        "name": "祁县"
                    }
                ]
            },
            {
                "code": "91",
                "name": "运城市",
                "sub": [
                    {
                        "code": "1360",
                        "name": "万荣县"
                    },
                    {
                        "code": "1361",
                        "name": "临猗县"
                    },
                    {
                        "code": "1362",
                        "name": "垣曲县"
                    },
                    {
                        "code": "1363",
                        "name": "夏县"
                    },
                    {
                        "code": "1364",
                        "name": "平陆县"
                    },
                    {
                        "code": "1365",
                        "name": "新绛县"
                    },
                    {
                        "code": "1366",
                        "name": "永济市"
                    },
                    {
                        "code": "1367",
                        "name": "河津市"
                    },
                    {
                        "code": "1368",
                        "name": "盐湖区"
                    },
                    {
                        "code": "1369",
                        "name": "稷山县"
                    },
                    {
                        "code": "1370",
                        "name": "绛县"
                    },
                    {
                        "code": "1371",
                        "name": "芮城县"
                    },
                    {
                        "code": "1372",
                        "name": "闻喜县"
                    }
                ]
            },
            {
                "code": "92",
                "name": "忻州市",
                "sub": [
                    {
                        "code": "1373",
                        "name": "五台县"
                    },
                    {
                        "code": "1374",
                        "name": "五寨县"
                    },
                    {
                        "code": "1375",
                        "name": "代县"
                    },
                    {
                        "code": "1376",
                        "name": "保德县"
                    },
                    {
                        "code": "1377",
                        "name": "偏关县"
                    },
                    {
                        "code": "1378",
                        "name": "原平市"
                    },
                    {
                        "code": "1379",
                        "name": "宁武县"
                    },
                    {
                        "code": "1380",
                        "name": "定襄县"
                    },
                    {
                        "code": "1381",
                        "name": "岢岚县"
                    },
                    {
                        "code": "1382",
                        "name": "忻府区"
                    },
                    {
                        "code": "1383",
                        "name": "河曲县"
                    },
                    {
                        "code": "1384",
                        "name": "神池县"
                    },
                    {
                        "code": "1385",
                        "name": "繁峙县"
                    },
                    {
                        "code": "1386",
                        "name": "静乐县"
                    }
                ]
            },
            {
                "code": "93",
                "name": "临汾市",
                "sub": [
                    {
                        "code": "1387",
                        "name": "乡宁县"
                    },
                    {
                        "code": "1388",
                        "name": "侯马市"
                    },
                    {
                        "code": "1389",
                        "name": "古县"
                    },
                    {
                        "code": "1390",
                        "name": "吉县"
                    },
                    {
                        "code": "1391",
                        "name": "大宁县"
                    },
                    {
                        "code": "1392",
                        "name": "安泽县"
                    },
                    {
                        "code": "1393",
                        "name": "尧都区"
                    },
                    {
                        "code": "1394",
                        "name": "曲沃县"
                    },
                    {
                        "code": "1395",
                        "name": "永和县"
                    },
                    {
                        "code": "1396",
                        "name": "汾西县"
                    },
                    {
                        "code": "1397",
                        "name": "洪洞县"
                    },
                    {
                        "code": "1398",
                        "name": "浮山县"
                    },
                    {
                        "code": "1399",
                        "name": "翼城县"
                    },
                    {
                        "code": "1400",
                        "name": "蒲县"
                    },
                    {
                        "code": "1401",
                        "name": "襄汾县"
                    },
                    {
                        "code": "1402",
                        "name": "隰县"
                    },
                    {
                        "code": "1403",
                        "name": "霍州市"
                    }
                ]
            },
            {
                "code": "94",
                "name": "吕梁市",
                "sub": [
                    {
                        "code": "1404",
                        "name": "中阳县"
                    },
                    {
                        "code": "1405",
                        "name": "临县"
                    },
                    {
                        "code": "1406",
                        "name": "交口县"
                    },
                    {
                        "code": "1407",
                        "name": "交城县"
                    },
                    {
                        "code": "1408",
                        "name": "兴县"
                    },
                    {
                        "code": "1409",
                        "name": "孝义市"
                    },
                    {
                        "code": "1410",
                        "name": "岚县"
                    },
                    {
                        "code": "1411",
                        "name": "文水县"
                    },
                    {
                        "code": "1412",
                        "name": "方山县"
                    },
                    {
                        "code": "1413",
                        "name": "柳林县"
                    },
                    {
                        "code": "1414",
                        "name": "汾阳市"
                    },
                    {
                        "code": "1415",
                        "name": "石楼县"
                    },
                    {
                        "code": "1416",
                        "name": "离石区"
                    }
                ]
            }
        ]
    },
    {
        "code": "5",
        "name": "内蒙古自治区",
        "sub": [
            {
                "code": "95",
                "name": "呼和浩特市",
                "sub": [
                    {
                        "code": "1417",
                        "name": "和林格尔县"
                    },
                    {
                        "code": "1418",
                        "name": "回民区"
                    },
                    {
                        "code": "1419",
                        "name": "土默特左旗"
                    },
                    {
                        "code": "1420",
                        "name": "托克托县"
                    },
                    {
                        "code": "1421",
                        "name": "新城区"
                    },
                    {
                        "code": "1422",
                        "name": "武川县"
                    },
                    {
                        "code": "1423",
                        "name": "清水河县"
                    },
                    {
                        "code": "1424",
                        "name": "玉泉区"
                    },
                    {
                        "code": "1425",
                        "name": "赛罕区"
                    }
                ]
            },
            {
                "code": "96",
                "name": "包头市",
                "sub": [
                    {
                        "code": "1426",
                        "name": "东河区"
                    },
                    {
                        "code": "1427",
                        "name": "九原区"
                    },
                    {
                        "code": "1428",
                        "name": "固阳县"
                    },
                    {
                        "code": "1429",
                        "name": "土默特右旗"
                    },
                    {
                        "code": "1430",
                        "name": "昆都仑区"
                    },
                    {
                        "code": "1431",
                        "name": "白云矿区"
                    },
                    {
                        "code": "1432",
                        "name": "石拐区"
                    },
                    {
                        "code": "1433",
                        "name": "达尔罕茂明安联合旗"
                    },
                    {
                        "code": "1434",
                        "name": "青山区"
                    }
                ]
            },
            {
                "code": "97",
                "name": "乌海市",
                "sub": [
                    {
                        "code": "1435",
                        "name": "乌达区"
                    },
                    {
                        "code": "1436",
                        "name": "海勃湾区"
                    },
                    {
                        "code": "1437",
                        "name": "海南区"
                    }
                ]
            },
            {
                "code": "98",
                "name": "赤峰市",
                "sub": [
                    {
                        "code": "1438",
                        "name": "元宝山区"
                    },
                    {
                        "code": "1439",
                        "name": "克什克腾旗"
                    },
                    {
                        "code": "1440",
                        "name": "喀喇沁旗"
                    },
                    {
                        "code": "1441",
                        "name": "宁城县"
                    },
                    {
                        "code": "1442",
                        "name": "巴林右旗"
                    },
                    {
                        "code": "1443",
                        "name": "巴林左旗"
                    },
                    {
                        "code": "1444",
                        "name": "敖汉旗"
                    },
                    {
                        "code": "1445",
                        "name": "松山区"
                    },
                    {
                        "code": "1446",
                        "name": "林西县"
                    },
                    {
                        "code": "1447",
                        "name": "红山区"
                    },
                    {
                        "code": "1448",
                        "name": "翁牛特旗"
                    },
                    {
                        "code": "1449",
                        "name": "阿鲁科尔沁旗"
                    }
                ]
            },
            {
                "code": "99",
                "name": "通辽市",
                "sub": [
                    {
                        "code": "1450",
                        "name": "奈曼旗"
                    },
                    {
                        "code": "1451",
                        "name": "库伦旗"
                    },
                    {
                        "code": "1452",
                        "name": "开鲁县"
                    },
                    {
                        "code": "1453",
                        "name": "扎鲁特旗"
                    },
                    {
                        "code": "1454",
                        "name": "科尔沁区"
                    },
                    {
                        "code": "1455",
                        "name": "科尔沁左翼中旗"
                    },
                    {
                        "code": "1456",
                        "name": "科尔沁左翼后旗"
                    },
                    {
                        "code": "1457",
                        "name": "霍林郭勒市"
                    }
                ]
            },
            {
                "code": "100",
                "name": "鄂尔多斯市",
                "sub": [
                    {
                        "code": "1458",
                        "name": "东胜区"
                    },
                    {
                        "code": "1459",
                        "name": "乌审旗"
                    },
                    {
                        "code": "1460",
                        "name": "伊金霍洛旗"
                    },
                    {
                        "code": "1461",
                        "name": "准格尔旗"
                    },
                    {
                        "code": "1462",
                        "name": "杭锦旗"
                    },
                    {
                        "code": "1463",
                        "name": "达拉特旗"
                    },
                    {
                        "code": "1464",
                        "name": "鄂东胜区"
                    },
                    {
                        "code": "1465",
                        "name": "鄂托克前旗"
                    },
                    {
                        "code": "1466",
                        "name": "鄂托克旗"
                    }
                ]
            },
            {
                "code": "101",
                "name": "呼伦贝尔市",
                "sub": [
                    {
                        "code": "1467",
                        "name": "扎兰屯市"
                    },
                    {
                        "code": "1468",
                        "name": "新巴尔虎右旗"
                    },
                    {
                        "code": "1469",
                        "name": "新巴尔虎左旗"
                    },
                    {
                        "code": "1470",
                        "name": "根河市"
                    },
                    {
                        "code": "1471",
                        "name": "海拉尔区"
                    },
                    {
                        "code": "1472",
                        "name": "满洲里市"
                    },
                    {
                        "code": "1473",
                        "name": "牙克石市"
                    },
                    {
                        "code": "1474",
                        "name": "莫力达瓦达斡尔族自治旗"
                    },
                    {
                        "code": "1475",
                        "name": "鄂伦春自治旗"
                    },
                    {
                        "code": "1476",
                        "name": "鄂温克族自治旗"
                    },
                    {
                        "code": "1477",
                        "name": "阿荣旗"
                    },
                    {
                        "code": "1478",
                        "name": "陈巴尔虎旗"
                    },
                    {
                        "code": "1479",
                        "name": "额尔古纳市"
                    }
                ]
            },
            {
                "code": "102",
                "name": "巴彦淖尔市",
                "sub": [
                    {
                        "code": "1480",
                        "name": "临河区"
                    },
                    {
                        "code": "1481",
                        "name": "乌拉特中旗"
                    },
                    {
                        "code": "1482",
                        "name": "乌拉特前旗"
                    },
                    {
                        "code": "1483",
                        "name": "乌拉特后旗"
                    },
                    {
                        "code": "1484",
                        "name": "五原县"
                    },
                    {
                        "code": "1485",
                        "name": "杭锦后旗"
                    },
                    {
                        "code": "1486",
                        "name": "磴口县"
                    }
                ]
            },
            {
                "code": "103",
                "name": "乌兰察布市",
                "sub": [
                    {
                        "code": "1487",
                        "name": "丰镇市"
                    },
                    {
                        "code": "1488",
                        "name": "兴和县"
                    },
                    {
                        "code": "1489",
                        "name": "凉城县"
                    },
                    {
                        "code": "1490",
                        "name": "化德县"
                    },
                    {
                        "code": "1491",
                        "name": "卓资县"
                    },
                    {
                        "code": "1492",
                        "name": "商都县"
                    },
                    {
                        "code": "1493",
                        "name": "四子王旗"
                    },
                    {
                        "code": "1494",
                        "name": "察哈尔右翼中旗"
                    },
                    {
                        "code": "1495",
                        "name": "察哈尔右翼前旗"
                    },
                    {
                        "code": "1496",
                        "name": "察哈尔右翼后旗"
                    },
                    {
                        "code": "1497",
                        "name": "集宁区"
                    }
                ]
            },
            {
                "code": "104",
                "name": "兴安盟",
                "sub": [
                    {
                        "code": "1498",
                        "name": "乌兰浩特市"
                    },
                    {
                        "code": "1499",
                        "name": "扎赉特旗"
                    },
                    {
                        "code": "1500",
                        "name": "科尔沁右翼中旗"
                    },
                    {
                        "code": "1501",
                        "name": "科尔沁右翼前旗"
                    },
                    {
                        "code": "1502",
                        "name": "突泉县"
                    },
                    {
                        "code": "1503",
                        "name": "阿尔山市"
                    }
                ]
            },
            {
                "code": "105",
                "name": "锡林郭勒盟",
                "sub": [
                    {
                        "code": "1504",
                        "name": "东乌珠穆沁旗"
                    },
                    {
                        "code": "1505",
                        "name": "二连浩特市"
                    },
                    {
                        "code": "1506",
                        "name": "多伦县"
                    },
                    {
                        "code": "1507",
                        "name": "太仆寺旗"
                    },
                    {
                        "code": "1508",
                        "name": "正蓝旗"
                    },
                    {
                        "code": "1509",
                        "name": "正镶白旗"
                    },
                    {
                        "code": "1510",
                        "name": "苏尼特右旗"
                    },
                    {
                        "code": "1511",
                        "name": "苏尼特左旗"
                    },
                    {
                        "code": "1512",
                        "name": "西乌珠穆沁旗"
                    },
                    {
                        "code": "1513",
                        "name": "锡林浩特市"
                    },
                    {
                        "code": "1514",
                        "name": "镶黄旗"
                    },
                    {
                        "code": "1515",
                        "name": "阿巴嘎旗"
                    }
                ]
            },
            {
                "code": "106",
                "name": "阿拉善盟",
                "sub": [
                    {
                        "code": "1516",
                        "name": "阿拉善右旗"
                    },
                    {
                        "code": "1517",
                        "name": "阿拉善左旗"
                    },
                    {
                        "code": "1518",
                        "name": "额济纳旗"
                    }
                ]
            }
        ]
    },
    {
        "code": "6",
        "name": "辽宁省",
        "sub": [
            {
                "code": "107",
                "name": "沈阳市",
                "sub": [
                    {
                        "code": "1519",
                        "name": "东陵区"
                    },
                    {
                        "code": "1520",
                        "name": "于洪区"
                    },
                    {
                        "code": "1521",
                        "name": "和平区"
                    },
                    {
                        "code": "1522",
                        "name": "大东区"
                    },
                    {
                        "code": "1523",
                        "name": "康平县"
                    },
                    {
                        "code": "1524",
                        "name": "新民市"
                    },
                    {
                        "code": "1525",
                        "name": "沈北新区"
                    },
                    {
                        "code": "1526",
                        "name": "沈河区"
                    },
                    {
                        "code": "1527",
                        "name": "法库县"
                    },
                    {
                        "code": "1528",
                        "name": "皇姑区"
                    },
                    {
                        "code": "1529",
                        "name": "苏家屯区"
                    },
                    {
                        "code": "1530",
                        "name": "辽中县"
                    },
                    {
                        "code": "1531",
                        "name": "铁西区"
                    }
                ]
            },
            {
                "code": "108",
                "name": "大连市",
                "sub": [
                    {
                        "code": "1532",
                        "name": "中山区"
                    },
                    {
                        "code": "1533",
                        "name": "庄河市"
                    },
                    {
                        "code": "1534",
                        "name": "旅顺口区"
                    },
                    {
                        "code": "1535",
                        "name": "普兰店市"
                    },
                    {
                        "code": "1536",
                        "name": "沙河口区"
                    },
                    {
                        "code": "1537",
                        "name": "瓦房店市"
                    },
                    {
                        "code": "1538",
                        "name": "甘井子区"
                    },
                    {
                        "code": "1539",
                        "name": "西岗区"
                    },
                    {
                        "code": "1540",
                        "name": "金州区"
                    },
                    {
                        "code": "1541",
                        "name": "长海县"
                    }
                ]
            },
            {
                "code": "109",
                "name": "鞍山市",
                "sub": [
                    {
                        "code": "1542",
                        "name": "千山区"
                    },
                    {
                        "code": "1543",
                        "name": "台安县"
                    },
                    {
                        "code": "1544",
                        "name": "岫岩满族自治县"
                    },
                    {
                        "code": "1545",
                        "name": "海城市"
                    },
                    {
                        "code": "1546",
                        "name": "立山区"
                    },
                    {
                        "code": "1547",
                        "name": "铁东区"
                    },
                    {
                        "code": "1548",
                        "name": "铁西区"
                    }
                ]
            },
            {
                "code": "110",
                "name": "抚顺市",
                "sub": [
                    {
                        "code": "1549",
                        "name": "东洲区"
                    },
                    {
                        "code": "1550",
                        "name": "抚顺县"
                    },
                    {
                        "code": "1551",
                        "name": "新宾满族自治县"
                    },
                    {
                        "code": "1552",
                        "name": "新抚区"
                    },
                    {
                        "code": "1553",
                        "name": "望花区"
                    },
                    {
                        "code": "1554",
                        "name": "清原满族自治县"
                    },
                    {
                        "code": "1555",
                        "name": "顺城区"
                    }
                ]
            },
            {
                "code": "111",
                "name": "本溪市",
                "sub": [
                    {
                        "code": "1556",
                        "name": "南芬区"
                    },
                    {
                        "code": "1557",
                        "name": "平山区"
                    },
                    {
                        "code": "1558",
                        "name": "明山区"
                    },
                    {
                        "code": "1559",
                        "name": "本溪满族自治县"
                    },
                    {
                        "code": "1560",
                        "name": "桓仁满族自治县"
                    },
                    {
                        "code": "1561",
                        "name": "溪湖区"
                    }
                ]
            },
            {
                "code": "112",
                "name": "丹东市",
                "sub": [
                    {
                        "code": "1562",
                        "name": "东港市"
                    },
                    {
                        "code": "1563",
                        "name": "元宝区"
                    },
                    {
                        "code": "1564",
                        "name": "凤城市"
                    },
                    {
                        "code": "1565",
                        "name": "宽甸满族自治县"
                    },
                    {
                        "code": "1566",
                        "name": "振兴区"
                    },
                    {
                        "code": "1567",
                        "name": "振安区"
                    }
                ]
            },
            {
                "code": "113",
                "name": "锦州市",
                "sub": [
                    {
                        "code": "1568",
                        "name": "义县"
                    },
                    {
                        "code": "1569",
                        "name": "凌河区"
                    },
                    {
                        "code": "1570",
                        "name": "凌海市"
                    },
                    {
                        "code": "1571",
                        "name": "北镇市"
                    },
                    {
                        "code": "1572",
                        "name": "古塔区"
                    },
                    {
                        "code": "1573",
                        "name": "太和区"
                    },
                    {
                        "code": "1574",
                        "name": "黑山县"
                    }
                ]
            },
            {
                "code": "114",
                "name": "营口市",
                "sub": [
                    {
                        "code": "1575",
                        "name": "大石桥市"
                    },
                    {
                        "code": "1576",
                        "name": "盖州市"
                    },
                    {
                        "code": "1577",
                        "name": "站前区"
                    },
                    {
                        "code": "1578",
                        "name": "老边区"
                    },
                    {
                        "code": "1579",
                        "name": "西市区"
                    },
                    {
                        "code": "1580",
                        "name": "鲅鱼圈区"
                    }
                ]
            },
            {
                "code": "115",
                "name": "阜新市",
                "sub": [
                    {
                        "code": "1581",
                        "name": "太平区"
                    },
                    {
                        "code": "1582",
                        "name": "彰武县"
                    },
                    {
                        "code": "1583",
                        "name": "新邱区"
                    },
                    {
                        "code": "1584",
                        "name": "海州区"
                    },
                    {
                        "code": "1585",
                        "name": "清河门区"
                    },
                    {
                        "code": "1586",
                        "name": "细河区"
                    },
                    {
                        "code": "1587",
                        "name": "蒙古族自治县"
                    }
                ]
            },
            {
                "code": "116",
                "name": "辽阳市",
                "sub": [
                    {
                        "code": "1588",
                        "name": "太子河区"
                    },
                    {
                        "code": "1589",
                        "name": "宏伟区"
                    },
                    {
                        "code": "1590",
                        "name": "弓长岭区"
                    },
                    {
                        "code": "1591",
                        "name": "文圣区"
                    },
                    {
                        "code": "1592",
                        "name": "灯塔市"
                    },
                    {
                        "code": "1593",
                        "name": "白塔区"
                    },
                    {
                        "code": "1594",
                        "name": "辽阳县"
                    }
                ]
            },
            {
                "code": "117",
                "name": "盘锦市",
                "sub": [
                    {
                        "code": "1595",
                        "name": "兴隆台区"
                    },
                    {
                        "code": "1596",
                        "name": "双台子区"
                    },
                    {
                        "code": "1597",
                        "name": "大洼县"
                    },
                    {
                        "code": "1598",
                        "name": "盘山县"
                    }
                ]
            },
            {
                "code": "118",
                "name": "铁岭市",
                "sub": [
                    {
                        "code": "1599",
                        "name": "开原市"
                    },
                    {
                        "code": "1600",
                        "name": "昌图县"
                    },
                    {
                        "code": "1601",
                        "name": "清河区"
                    },
                    {
                        "code": "1602",
                        "name": "西丰县"
                    },
                    {
                        "code": "1603",
                        "name": "调兵山市"
                    },
                    {
                        "code": "1604",
                        "name": "铁岭县"
                    },
                    {
                        "code": "1605",
                        "name": "银州区"
                    }
                ]
            },
            {
                "code": "119",
                "name": "朝阳市",
                "sub": [
                    {
                        "code": "1606",
                        "name": "凌源市"
                    },
                    {
                        "code": "1607",
                        "name": "北票市"
                    },
                    {
                        "code": "1608",
                        "name": "双塔区"
                    },
                    {
                        "code": "1609",
                        "name": "喀喇沁左翼蒙古族自治县"
                    },
                    {
                        "code": "1610",
                        "name": "建平县"
                    },
                    {
                        "code": "1611",
                        "name": "朝阳县"
                    },
                    {
                        "code": "1612",
                        "name": "龙城区"
                    }
                ]
            },
            {
                "code": "120",
                "name": "葫芦岛市",
                "sub": [
                    {
                        "code": "1613",
                        "name": "兴城市"
                    },
                    {
                        "code": "1614",
                        "name": "南票区"
                    },
                    {
                        "code": "1615",
                        "name": "建昌县"
                    },
                    {
                        "code": "1616",
                        "name": "绥中县"
                    },
                    {
                        "code": "1617",
                        "name": "连山区"
                    },
                    {
                        "code": "1618",
                        "name": "龙港区"
                    }
                ]
            }
        ]
    },
    {
        "code": "7",
        "name": "吉林省",
        "sub": [
            {
                "code": "121",
                "name": "长春市",
                "sub": [
                    {
                        "code": "1619",
                        "name": "九台市"
                    },
                    {
                        "code": "1620",
                        "name": "二道区"
                    },
                    {
                        "code": "1621",
                        "name": "农安县"
                    },
                    {
                        "code": "1622",
                        "name": "南关区"
                    },
                    {
                        "code": "1623",
                        "name": "双阳区"
                    },
                    {
                        "code": "1624",
                        "name": "宽城区"
                    },
                    {
                        "code": "1625",
                        "name": "德惠市"
                    },
                    {
                        "code": "1626",
                        "name": "朝阳区"
                    },
                    {
                        "code": "1627",
                        "name": "榆树市"
                    },
                    {
                        "code": "1628",
                        "name": "绿园区"
                    }
                ]
            },
            {
                "code": "122",
                "name": "吉林市",
                "sub": [
                    {
                        "code": "1629",
                        "name": "丰满区"
                    },
                    {
                        "code": "1630",
                        "name": "昌邑区"
                    },
                    {
                        "code": "1631",
                        "name": "桦甸市"
                    },
                    {
                        "code": "1632",
                        "name": "永吉县"
                    },
                    {
                        "code": "1633",
                        "name": "磐石市"
                    },
                    {
                        "code": "1634",
                        "name": "舒兰市"
                    },
                    {
                        "code": "1635",
                        "name": "船营区"
                    },
                    {
                        "code": "1636",
                        "name": "蛟河市"
                    },
                    {
                        "code": "1637",
                        "name": "龙潭区"
                    }
                ]
            },
            {
                "code": "123",
                "name": "四平市",
                "sub": [
                    {
                        "code": "1638",
                        "name": "伊通满族自治县"
                    },
                    {
                        "code": "1639",
                        "name": "公主岭市"
                    },
                    {
                        "code": "1640",
                        "name": "双辽市"
                    },
                    {
                        "code": "1641",
                        "name": "梨树县"
                    },
                    {
                        "code": "1642",
                        "name": "铁东区"
                    },
                    {
                        "code": "1643",
                        "name": "铁西区"
                    }
                ]
            },
            {
                "code": "124",
                "name": "辽源市",
                "sub": [
                    {
                        "code": "1644",
                        "name": "东丰县"
                    },
                    {
                        "code": "1645",
                        "name": "东辽县"
                    },
                    {
                        "code": "1646",
                        "name": "西安区"
                    },
                    {
                        "code": "1647",
                        "name": "龙山区"
                    }
                ]
            },
            {
                "code": "125",
                "name": "通化市",
                "sub": [
                    {
                        "code": "1648",
                        "name": "东昌区"
                    },
                    {
                        "code": "1649",
                        "name": "二道江区"
                    },
                    {
                        "code": "1650",
                        "name": "柳河县"
                    },
                    {
                        "code": "1651",
                        "name": "梅河口市"
                    },
                    {
                        "code": "1652",
                        "name": "辉南县"
                    },
                    {
                        "code": "1653",
                        "name": "通化县"
                    },
                    {
                        "code": "1654",
                        "name": "集安市"
                    }
                ]
            },
            {
                "code": "126",
                "name": "白山市",
                "sub": [
                    {
                        "code": "1655",
                        "name": "临江市"
                    },
                    {
                        "code": "1656",
                        "name": "八道江区"
                    },
                    {
                        "code": "1657",
                        "name": "抚松县"
                    },
                    {
                        "code": "1658",
                        "name": "江源区"
                    },
                    {
                        "code": "1659",
                        "name": "长白朝鲜族自治县"
                    },
                    {
                        "code": "1660",
                        "name": "靖宇县"
                    }
                ]
            },
            {
                "code": "127",
                "name": "松原市",
                "sub": [
                    {
                        "code": "1661",
                        "name": "干安县"
                    },
                    {
                        "code": "1662",
                        "name": "前郭尔罗斯蒙古族自治县"
                    },
                    {
                        "code": "1663",
                        "name": "宁江区"
                    },
                    {
                        "code": "1664",
                        "name": "扶余县"
                    },
                    {
                        "code": "1665",
                        "name": "长岭县"
                    }
                ]
            },
            {
                "code": "128",
                "name": "白城市",
                "sub": [
                    {
                        "code": "1666",
                        "name": "大安市"
                    },
                    {
                        "code": "1667",
                        "name": "洮北区"
                    },
                    {
                        "code": "1668",
                        "name": "洮南市"
                    },
                    {
                        "code": "1669",
                        "name": "通榆县"
                    },
                    {
                        "code": "1670",
                        "name": "镇赉县"
                    }
                ]
            },
            {
                "code": "129",
                "name": "延边朝鲜族自治州",
                "sub": [
                    {
                        "code": "1671",
                        "name": "和龙市"
                    },
                    {
                        "code": "1672",
                        "name": "图们市"
                    },
                    {
                        "code": "1673",
                        "name": "安图县"
                    },
                    {
                        "code": "1674",
                        "name": "延吉市"
                    },
                    {
                        "code": "1675",
                        "name": "敦化市"
                    },
                    {
                        "code": "1676",
                        "name": "汪清县"
                    },
                    {
                        "code": "1677",
                        "name": "珲春市"
                    },
                    {
                        "code": "1678",
                        "name": "龙井市"
                    }
                ]
            }
        ]
    },
    {
        "code": "8",
        "name": "黑龙江省",
        "sub": [
            {
                "code": "130",
                "name": "哈尔滨市",
                "sub": [
                    {
                        "code": "1679",
                        "name": "五常市"
                    },
                    {
                        "code": "1680",
                        "name": "依兰县"
                    },
                    {
                        "code": "1681",
                        "name": "南岗区"
                    },
                    {
                        "code": "1682",
                        "name": "双城市"
                    },
                    {
                        "code": "1683",
                        "name": "呼兰区"
                    },
                    {
                        "code": "1684",
                        "name": "哈尔滨市道里区"
                    },
                    {
                        "code": "1685",
                        "name": "宾县"
                    },
                    {
                        "code": "1686",
                        "name": "尚志市"
                    },
                    {
                        "code": "1687",
                        "name": "巴彦县"
                    },
                    {
                        "code": "1688",
                        "name": "平房区"
                    },
                    {
                        "code": "1689",
                        "name": "延寿县"
                    },
                    {
                        "code": "1690",
                        "name": "方正县"
                    },
                    {
                        "code": "1691",
                        "name": "木兰县"
                    },
                    {
                        "code": "1692",
                        "name": "松北区"
                    },
                    {
                        "code": "1693",
                        "name": "通河县"
                    },
                    {
                        "code": "1694",
                        "name": "道外区"
                    },
                    {
                        "code": "1695",
                        "name": "阿城区"
                    },
                    {
                        "code": "1696",
                        "name": "香坊区"
                    }
                ]
            },
            {
                "code": "131",
                "name": "齐齐哈尔市",
                "sub": [
                    {
                        "code": "1697",
                        "name": "依安县"
                    },
                    {
                        "code": "1698",
                        "name": "克东县"
                    },
                    {
                        "code": "1699",
                        "name": "克山县"
                    },
                    {
                        "code": "1700",
                        "name": "富拉尔基区"
                    },
                    {
                        "code": "1701",
                        "name": "富裕县"
                    },
                    {
                        "code": "1702",
                        "name": "建华区"
                    },
                    {
                        "code": "1703",
                        "name": "拜泉县"
                    },
                    {
                        "code": "1704",
                        "name": "昂昂溪区"
                    },
                    {
                        "code": "1705",
                        "name": "梅里斯达斡尔族区"
                    },
                    {
                        "code": "1706",
                        "name": "泰来县"
                    },
                    {
                        "code": "1707",
                        "name": "甘南县"
                    },
                    {
                        "code": "1708",
                        "name": "碾子山区"
                    },
                    {
                        "code": "1709",
                        "name": "讷河市"
                    },
                    {
                        "code": "1710",
                        "name": "铁锋区"
                    },
                    {
                        "code": "1711",
                        "name": "龙江县"
                    },
                    {
                        "code": "1712",
                        "name": "龙沙区"
                    }
                ]
            },
            {
                "code": "132",
                "name": "鸡西市",
                "sub": [
                    {
                        "code": "1713",
                        "name": "城子河区"
                    },
                    {
                        "code": "1714",
                        "name": "密山市"
                    },
                    {
                        "code": "1715",
                        "name": "恒山区"
                    },
                    {
                        "code": "1716",
                        "name": "梨树区"
                    },
                    {
                        "code": "1717",
                        "name": "滴道区"
                    },
                    {
                        "code": "1718",
                        "name": "虎林市"
                    },
                    {
                        "code": "1719",
                        "name": "鸡东县"
                    },
                    {
                        "code": "1720",
                        "name": "鸡冠区"
                    },
                    {
                        "code": "1721",
                        "name": "麻山区"
                    }
                ]
            },
            {
                "code": "133",
                "name": "鹤岗市",
                "sub": [
                    {
                        "code": "1722",
                        "name": "东山区"
                    },
                    {
                        "code": "1723",
                        "name": "兴安区"
                    },
                    {
                        "code": "1724",
                        "name": "兴山区"
                    },
                    {
                        "code": "1725",
                        "name": "南山区"
                    },
                    {
                        "code": "1726",
                        "name": "向阳区"
                    },
                    {
                        "code": "1727",
                        "name": "工农区"
                    },
                    {
                        "code": "1728",
                        "name": "绥滨县"
                    },
                    {
                        "code": "1729",
                        "name": "萝北县"
                    }
                ]
            },
            {
                "code": "134",
                "name": "双鸭山市",
                "sub": [
                    {
                        "code": "1730",
                        "name": "友谊县"
                    },
                    {
                        "code": "1731",
                        "name": "四方台区"
                    },
                    {
                        "code": "1732",
                        "name": "宝山区"
                    },
                    {
                        "code": "1733",
                        "name": "宝清县"
                    },
                    {
                        "code": "1734",
                        "name": "尖山区"
                    },
                    {
                        "code": "1735",
                        "name": "岭东区"
                    },
                    {
                        "code": "1736",
                        "name": "集贤县"
                    },
                    {
                        "code": "1737",
                        "name": "饶河县"
                    }
                ]
            },
            {
                "code": "135",
                "name": "大庆市",
                "sub": [
                    {
                        "code": "1738",
                        "name": "大同区"
                    },
                    {
                        "code": "1739",
                        "name": "杜尔伯特蒙古族自治县"
                    },
                    {
                        "code": "1740",
                        "name": "林甸县"
                    },
                    {
                        "code": "1741",
                        "name": "红岗区"
                    },
                    {
                        "code": "1742",
                        "name": "肇州县"
                    },
                    {
                        "code": "1743",
                        "name": "肇源县"
                    },
                    {
                        "code": "1744",
                        "name": "胡路区"
                    },
                    {
                        "code": "1745",
                        "name": "萨尔图区"
                    },
                    {
                        "code": "1746",
                        "name": "龙凤区"
                    }
                ]
            },
            {
                "code": "136",
                "name": "伊春市",
                "sub": [
                    {
                        "code": "1747",
                        "name": "上甘岭区"
                    },
                    {
                        "code": "1748",
                        "name": "乌伊岭区"
                    },
                    {
                        "code": "1749",
                        "name": "乌马河区"
                    },
                    {
                        "code": "1750",
                        "name": "五营区"
                    },
                    {
                        "code": "1751",
                        "name": "伊春区"
                    },
                    {
                        "code": "1752",
                        "name": "南岔区"
                    },
                    {
                        "code": "1753",
                        "name": "友好区"
                    },
                    {
                        "code": "1754",
                        "name": "嘉荫县"
                    },
                    {
                        "code": "1755",
                        "name": "带岭区"
                    },
                    {
                        "code": "1756",
                        "name": "新青区"
                    },
                    {
                        "code": "1757",
                        "name": "汤旺河区"
                    },
                    {
                        "code": "1758",
                        "name": "红星区"
                    },
                    {
                        "code": "1759",
                        "name": "美溪区"
                    },
                    {
                        "code": "1760",
                        "name": "翠峦区"
                    },
                    {
                        "code": "1761",
                        "name": "西林区"
                    },
                    {
                        "code": "1762",
                        "name": "金山屯区"
                    },
                    {
                        "code": "1763",
                        "name": "铁力市"
                    }
                ]
            },
            {
                "code": "137",
                "name": "佳木斯市",
                "sub": [
                    {
                        "code": "1764",
                        "name": "东风区"
                    },
                    {
                        "code": "1765",
                        "name": "前进区"
                    },
                    {
                        "code": "1766",
                        "name": "同江市"
                    },
                    {
                        "code": "1767",
                        "name": "向阳区"
                    },
                    {
                        "code": "1768",
                        "name": "富锦市"
                    },
                    {
                        "code": "1769",
                        "name": "抚远县"
                    },
                    {
                        "code": "1770",
                        "name": "桦南县"
                    },
                    {
                        "code": "1771",
                        "name": "桦川县"
                    },
                    {
                        "code": "1772",
                        "name": "汤原县"
                    },
                    {
                        "code": "1773",
                        "name": "郊区"
                    }
                ]
            },
            {
                "code": "138",
                "name": "七台河市",
                "sub": [
                    {
                        "code": "1774",
                        "name": "勃利县"
                    },
                    {
                        "code": "1775",
                        "name": "新兴区"
                    },
                    {
                        "code": "1776",
                        "name": "桃山区"
                    },
                    {
                        "code": "1777",
                        "name": "茄子河区"
                    }
                ]
            },
            {
                "code": "139",
                "name": "牡丹江市",
                "sub": [
                    {
                        "code": "1778",
                        "name": "东宁县"
                    },
                    {
                        "code": "1779",
                        "name": "东安区"
                    },
                    {
                        "code": "1780",
                        "name": "宁安市"
                    },
                    {
                        "code": "1781",
                        "name": "林口县"
                    },
                    {
                        "code": "1782",
                        "name": "海林市"
                    },
                    {
                        "code": "1783",
                        "name": "爱民区"
                    },
                    {
                        "code": "1784",
                        "name": "穆棱市"
                    },
                    {
                        "code": "1785",
                        "name": "绥芬河市"
                    },
                    {
                        "code": "1786",
                        "name": "西安区"
                    },
                    {
                        "code": "1787",
                        "name": "阳明区"
                    }
                ]
            },
            {
                "code": "140",
                "name": "黑河市",
                "sub": [
                    {
                        "code": "1788",
                        "name": "五大连池市"
                    },
                    {
                        "code": "1789",
                        "name": "北安市"
                    },
                    {
                        "code": "1790",
                        "name": "嫩江县"
                    },
                    {
                        "code": "1791",
                        "name": "孙吴县"
                    },
                    {
                        "code": "1792",
                        "name": "爱辉区"
                    },
                    {
                        "code": "1793",
                        "name": "车逊克县"
                    },
                    {
                        "code": "1794",
                        "name": "逊克县"
                    }
                ]
            },
            {
                "code": "141",
                "name": "绥化市",
                "sub": [
                    {
                        "code": "1795",
                        "name": "兰西县"
                    },
                    {
                        "code": "1796",
                        "name": "安达市"
                    },
                    {
                        "code": "1797",
                        "name": "庆安县"
                    },
                    {
                        "code": "1798",
                        "name": "明水县"
                    },
                    {
                        "code": "1799",
                        "name": "望奎县"
                    },
                    {
                        "code": "1800",
                        "name": "海伦市"
                    },
                    {
                        "code": "1801",
                        "name": "绥化市北林区"
                    },
                    {
                        "code": "1802",
                        "name": "绥棱县"
                    },
                    {
                        "code": "1803",
                        "name": "肇东市"
                    },
                    {
                        "code": "1804",
                        "name": "青冈县"
                    }
                ]
            },
            {
                "code": "142",
                "name": "大兴安岭地区",
                "sub": [
                    {
                        "code": "1805",
                        "name": "呼玛县"
                    },
                    {
                        "code": "1806",
                        "name": "塔河县"
                    },
                    {
                        "code": "1807",
                        "name": "大兴安岭地区加格达奇区"
                    },
                    {
                        "code": "1808",
                        "name": "大兴安岭地区呼中区"
                    },
                    {
                        "code": "1809",
                        "name": "大兴安岭地区新林区"
                    },
                    {
                        "code": "1810",
                        "name": "大兴安岭地区松岭区"
                    },
                    {
                        "code": "1811",
                        "name": "漠河县"
                    }
                ]
            }
        ]
    },
    {
        "code": "9",
        "name": "上海市",
        "sub": [
            {
                "code": "45054",
                "name": "上海市",
                "sub": [
                    {
                        "code": "143",
                        "name": "黄浦区"
                    },
                    {
                        "code": "144",
                        "name": "卢湾区"
                    },
                    {
                        "code": "145",
                        "name": "徐汇区"
                    },
                    {
                        "code": "146",
                        "name": "长宁区"
                    },
                    {
                        "code": "147",
                        "name": "静安区"
                    },
                    {
                        "code": "148",
                        "name": "普陀区"
                    },
                    {
                        "code": "149",
                        "name": "闸北区"
                    },
                    {
                        "code": "150",
                        "name": "虹口区"
                    },
                    {
                        "code": "151",
                        "name": "杨浦区"
                    },
                    {
                        "code": "152",
                        "name": "闵行区"
                    },
                    {
                        "code": "153",
                        "name": "宝山区"
                    },
                    {
                        "code": "154",
                        "name": "嘉定区"
                    },
                    {
                        "code": "155",
                        "name": "浦东新区"
                    },
                    {
                        "code": "156",
                        "name": "金山区"
                    },
                    {
                        "code": "157",
                        "name": "松江区"
                    },
                    {
                        "code": "158",
                        "name": "青浦区"
                    },
                    {
                        "code": "159",
                        "name": "南汇区"
                    },
                    {
                        "code": "160",
                        "name": "奉贤区"
                    },
                    {
                        "code": "161",
                        "name": "崇明县"
                    }
                ]
            }
        ]
    },
    {
        "code": "10",
        "name": "江苏省",
        "sub": [
            {
                "code": "162",
                "name": "南京市",
                "sub": [
                    {
                        "code": "2027",
                        "name": "下关区"
                    },
                    {
                        "code": "2028",
                        "name": "六合区"
                    },
                    {
                        "code": "2029",
                        "name": "建邺区"
                    },
                    {
                        "code": "2030",
                        "name": "栖霞区"
                    },
                    {
                        "code": "2031",
                        "name": "江宁区"
                    },
                    {
                        "code": "2032",
                        "name": "浦口区"
                    },
                    {
                        "code": "2033",
                        "name": "溧水县"
                    },
                    {
                        "code": "2034",
                        "name": "玄武区"
                    },
                    {
                        "code": "2035",
                        "name": "白下区"
                    },
                    {
                        "code": "2036",
                        "name": "秦淮区"
                    },
                    {
                        "code": "2037",
                        "name": "雨花台区"
                    },
                    {
                        "code": "2038",
                        "name": "高淳县"
                    },
                    {
                        "code": "2039",
                        "name": "鼓楼区"
                    }
                ]
            },
            {
                "code": "163",
                "name": "无锡市",
                "sub": [
                    {
                        "code": "2040",
                        "name": "北塘区"
                    },
                    {
                        "code": "2041",
                        "name": "南长区"
                    },
                    {
                        "code": "2042",
                        "name": "宜兴市"
                    },
                    {
                        "code": "2043",
                        "name": "崇安区"
                    },
                    {
                        "code": "2044",
                        "name": "惠山区"
                    },
                    {
                        "code": "2045",
                        "name": "江阴市"
                    },
                    {
                        "code": "2046",
                        "name": "滨湖区"
                    },
                    {
                        "code": "2047",
                        "name": "锡山区"
                    }
                ]
            },
            {
                "code": "164",
                "name": "徐州市",
                "sub": [
                    {
                        "code": "2048",
                        "name": "丰县"
                    },
                    {
                        "code": "2049",
                        "name": "九里区"
                    },
                    {
                        "code": "2050",
                        "name": "云龙区"
                    },
                    {
                        "code": "2051",
                        "name": "新沂市"
                    },
                    {
                        "code": "2052",
                        "name": "沛县"
                    },
                    {
                        "code": "2053",
                        "name": "泉山区"
                    },
                    {
                        "code": "2054",
                        "name": "睢宁县"
                    },
                    {
                        "code": "2055",
                        "name": "贾汪区"
                    },
                    {
                        "code": "2056",
                        "name": "邳州市"
                    },
                    {
                        "code": "2057",
                        "name": "铜山县"
                    },
                    {
                        "code": "2058",
                        "name": "鼓楼区"
                    }
                ]
            },
            {
                "code": "165",
                "name": "常州市",
                "sub": [
                    {
                        "code": "2059",
                        "name": "天宁区"
                    },
                    {
                        "code": "2060",
                        "name": "戚墅堰区"
                    },
                    {
                        "code": "2061",
                        "name": "新北区"
                    },
                    {
                        "code": "2062",
                        "name": "武进区"
                    },
                    {
                        "code": "2063",
                        "name": "溧阳市"
                    },
                    {
                        "code": "2064",
                        "name": "金坛市"
                    },
                    {
                        "code": "2065",
                        "name": "钟楼区"
                    }
                ]
            },
            {
                "code": "166",
                "name": "苏州市",
                "sub": [
                    {
                        "code": "2066",
                        "name": "吴中区"
                    },
                    {
                        "code": "2067",
                        "name": "吴江市"
                    },
                    {
                        "code": "2068",
                        "name": "太仓市"
                    },
                    {
                        "code": "2069",
                        "name": "常熟市"
                    },
                    {
                        "code": "2070",
                        "name": "平江区"
                    },
                    {
                        "code": "2071",
                        "name": "张家港市"
                    },
                    {
                        "code": "2072",
                        "name": "昆山市"
                    },
                    {
                        "code": "2073",
                        "name": "沧浪区"
                    },
                    {
                        "code": "2074",
                        "name": "相城区"
                    },
                    {
                        "code": "2075",
                        "name": "苏州工业园区"
                    },
                    {
                        "code": "2076",
                        "name": "虎丘区"
                    },
                    {
                        "code": "2077",
                        "name": "金阊区"
                    }
                ]
            },
            {
                "code": "167",
                "name": "南通市",
                "sub": [
                    {
                        "code": "2078",
                        "name": "启东市"
                    },
                    {
                        "code": "2079",
                        "name": "如东县"
                    },
                    {
                        "code": "2080",
                        "name": "如皋市"
                    },
                    {
                        "code": "2081",
                        "name": "崇川区"
                    },
                    {
                        "code": "2082",
                        "name": "海安县"
                    },
                    {
                        "code": "2083",
                        "name": "海门市"
                    },
                    {
                        "code": "2084",
                        "name": "港闸区"
                    },
                    {
                        "code": "2085",
                        "name": "通州市"
                    }
                ]
            },
            {
                "code": "168",
                "name": "连云港市",
                "sub": [
                    {
                        "code": "2086",
                        "name": "东海县"
                    },
                    {
                        "code": "2087",
                        "name": "新浦区"
                    },
                    {
                        "code": "2088",
                        "name": "海州区"
                    },
                    {
                        "code": "2089",
                        "name": "灌云县"
                    },
                    {
                        "code": "2090",
                        "name": "灌南县"
                    },
                    {
                        "code": "2091",
                        "name": "赣榆县"
                    },
                    {
                        "code": "2092",
                        "name": "连云区"
                    }
                ]
            },
            {
                "code": "169",
                "name": "淮安市",
                "sub": [
                    {
                        "code": "2093",
                        "name": "楚州区"
                    },
                    {
                        "code": "2094",
                        "name": "洪泽县"
                    },
                    {
                        "code": "2095",
                        "name": "涟水县"
                    },
                    {
                        "code": "2096",
                        "name": "淮阴区"
                    },
                    {
                        "code": "2097",
                        "name": "清河区"
                    },
                    {
                        "code": "2098",
                        "name": "清浦区"
                    },
                    {
                        "code": "2099",
                        "name": "盱眙县"
                    },
                    {
                        "code": "2100",
                        "name": "金湖县"
                    }
                ]
            },
            {
                "code": "170",
                "name": "盐城市",
                "sub": [
                    {
                        "code": "2101",
                        "name": "东台市"
                    },
                    {
                        "code": "2102",
                        "name": "亭湖区"
                    },
                    {
                        "code": "2103",
                        "name": "响水县"
                    },
                    {
                        "code": "2104",
                        "name": "大丰市"
                    },
                    {
                        "code": "2105",
                        "name": "射阳县"
                    },
                    {
                        "code": "2106",
                        "name": "建湖县"
                    },
                    {
                        "code": "2107",
                        "name": "滨海县"
                    },
                    {
                        "code": "2108",
                        "name": "盐都区"
                    },
                    {
                        "code": "2109",
                        "name": "阜宁县"
                    }
                ]
            },
            {
                "code": "171",
                "name": "扬州市",
                "sub": [
                    {
                        "code": "2110",
                        "name": "仪征市"
                    },
                    {
                        "code": "2111",
                        "name": "宝应县"
                    },
                    {
                        "code": "2112",
                        "name": "广陵区"
                    },
                    {
                        "code": "2113",
                        "name": "江都市"
                    },
                    {
                        "code": "2114",
                        "name": "维扬区"
                    },
                    {
                        "code": "2115",
                        "name": "邗江区"
                    },
                    {
                        "code": "2116",
                        "name": "高邮市"
                    }
                ]
            },
            {
                "code": "172",
                "name": "镇江市",
                "sub": [
                    {
                        "code": "2117",
                        "name": "丹徒区"
                    },
                    {
                        "code": "2118",
                        "name": "丹阳市"
                    },
                    {
                        "code": "2119",
                        "name": "京口区"
                    },
                    {
                        "code": "2120",
                        "name": "句容市"
                    },
                    {
                        "code": "2121",
                        "name": "扬中市"
                    },
                    {
                        "code": "2122",
                        "name": "润州区"
                    }
                ]
            },
            {
                "code": "173",
                "name": "泰州市",
                "sub": [
                    {
                        "code": "2123",
                        "name": "兴化市"
                    },
                    {
                        "code": "2124",
                        "name": "姜堰市"
                    },
                    {
                        "code": "2125",
                        "name": "泰兴市"
                    },
                    {
                        "code": "2126",
                        "name": "海陵区"
                    },
                    {
                        "code": "2127",
                        "name": "靖江市"
                    },
                    {
                        "code": "2128",
                        "name": "高港区"
                    }
                ]
            },
            {
                "code": "174",
                "name": "宿迁市",
                "sub": [
                    {
                        "code": "2129",
                        "name": "宿城区"
                    },
                    {
                        "code": "2130",
                        "name": "宿豫区"
                    },
                    {
                        "code": "2131",
                        "name": "沭阳县"
                    },
                    {
                        "code": "2132",
                        "name": "泗洪县"
                    },
                    {
                        "code": "2133",
                        "name": "泗阳县"
                    }
                ]
            }
        ]
    },
    {
        "code": "11",
        "name": "浙江省",
        "sub": [
            {
                "code": "175",
                "name": "杭州市",
                "sub": [
                    {
                        "code": "2134",
                        "name": "上城区"
                    },
                    {
                        "code": "2135",
                        "name": "下城区"
                    },
                    {
                        "code": "2136",
                        "name": "临安市"
                    },
                    {
                        "code": "2137",
                        "name": "余杭区"
                    },
                    {
                        "code": "2138",
                        "name": "富阳市"
                    },
                    {
                        "code": "2139",
                        "name": "建德市"
                    },
                    {
                        "code": "2140",
                        "name": "拱墅区"
                    },
                    {
                        "code": "2141",
                        "name": "桐庐县"
                    },
                    {
                        "code": "2142",
                        "name": "江干区"
                    },
                    {
                        "code": "2143",
                        "name": "淳安县"
                    },
                    {
                        "code": "2144",
                        "name": "滨江区"
                    },
                    {
                        "code": "2145",
                        "name": "萧山区"
                    },
                    {
                        "code": "2146",
                        "name": "西湖区"
                    }
                ]
            },
            {
                "code": "176",
                "name": "宁波市",
                "sub": [
                    {
                        "code": "2147",
                        "name": "余姚市"
                    },
                    {
                        "code": "2148",
                        "name": "北仑区"
                    },
                    {
                        "code": "2149",
                        "name": "奉化市"
                    },
                    {
                        "code": "2150",
                        "name": "宁海县"
                    },
                    {
                        "code": "2151",
                        "name": "慈溪市"
                    },
                    {
                        "code": "2152",
                        "name": "江东区"
                    },
                    {
                        "code": "2153",
                        "name": "江北区"
                    },
                    {
                        "code": "2154",
                        "name": "海曙区"
                    },
                    {
                        "code": "2155",
                        "name": "象山县"
                    },
                    {
                        "code": "2156",
                        "name": "鄞州区"
                    },
                    {
                        "code": "2157",
                        "name": "镇海区"
                    }
                ]
            },
            {
                "code": "177",
                "name": "温州市",
                "sub": [
                    {
                        "code": "2158",
                        "name": "乐清市"
                    },
                    {
                        "code": "2159",
                        "name": "平阳县"
                    },
                    {
                        "code": "2160",
                        "name": "文成县"
                    },
                    {
                        "code": "2161",
                        "name": "永嘉县"
                    },
                    {
                        "code": "2162",
                        "name": "泰顺县"
                    },
                    {
                        "code": "2163",
                        "name": "洞头县"
                    },
                    {
                        "code": "2164",
                        "name": "瑞安市"
                    },
                    {
                        "code": "2165",
                        "name": "瓯海区"
                    },
                    {
                        "code": "2166",
                        "name": "苍南县"
                    },
                    {
                        "code": "2167",
                        "name": "鹿城区"
                    },
                    {
                        "code": "2168",
                        "name": "龙湾区"
                    }
                ]
            },
            {
                "code": "178",
                "name": "嘉兴市",
                "sub": [
                    {
                        "code": "2169",
                        "name": "南湖区"
                    },
                    {
                        "code": "2170",
                        "name": "嘉善县"
                    },
                    {
                        "code": "2171",
                        "name": "平湖市"
                    },
                    {
                        "code": "2172",
                        "name": "桐乡市"
                    },
                    {
                        "code": "2173",
                        "name": "海宁市"
                    },
                    {
                        "code": "2174",
                        "name": "海盐县"
                    },
                    {
                        "code": "2175",
                        "name": "秀洲区"
                    }
                ]
            },
            {
                "code": "179",
                "name": "湖州市",
                "sub": [
                    {
                        "code": "2176",
                        "name": "南浔区"
                    },
                    {
                        "code": "2177",
                        "name": "吴兴区"
                    },
                    {
                        "code": "2178",
                        "name": "安吉县"
                    },
                    {
                        "code": "2179",
                        "name": "德清县"
                    },
                    {
                        "code": "2180",
                        "name": "长兴县"
                    }
                ]
            },
            {
                "code": "180",
                "name": "绍兴市",
                "sub": [
                    {
                        "code": "2181",
                        "name": "上虞市"
                    },
                    {
                        "code": "2182",
                        "name": "嵊州市"
                    },
                    {
                        "code": "2183",
                        "name": "新昌县"
                    },
                    {
                        "code": "2184",
                        "name": "绍兴县"
                    },
                    {
                        "code": "2185",
                        "name": "诸暨市"
                    },
                    {
                        "code": "2186",
                        "name": "越城区"
                    }
                ]
            },
            {
                "code": "181",
                "name": "舟山市",
                "sub": [
                    {
                        "code": "2187",
                        "name": "定海区"
                    },
                    {
                        "code": "2188",
                        "name": "岱山县"
                    },
                    {
                        "code": "2189",
                        "name": "嵊泗县"
                    },
                    {
                        "code": "2190",
                        "name": "普陀区"
                    }
                ]
            },
            {
                "code": "182",
                "name": "衢州市",
                "sub": [
                    {
                        "code": "2191",
                        "name": "常山县"
                    },
                    {
                        "code": "2192",
                        "name": "开化县"
                    },
                    {
                        "code": "2193",
                        "name": "柯城区"
                    },
                    {
                        "code": "2194",
                        "name": "江山市"
                    },
                    {
                        "code": "2195",
                        "name": "衢江区"
                    },
                    {
                        "code": "2196",
                        "name": "龙游县"
                    }
                ]
            },
            {
                "code": "183",
                "name": "金华市",
                "sub": [
                    {
                        "code": "2197",
                        "name": "东阳市"
                    },
                    {
                        "code": "2198",
                        "name": "义乌市"
                    },
                    {
                        "code": "2199",
                        "name": "兰溪市"
                    },
                    {
                        "code": "2200",
                        "name": "婺城区"
                    },
                    {
                        "code": "2201",
                        "name": "武义县"
                    },
                    {
                        "code": "2202",
                        "name": "永康市"
                    },
                    {
                        "code": "2203",
                        "name": "浦江县"
                    },
                    {
                        "code": "2204",
                        "name": "磐安县"
                    },
                    {
                        "code": "2205",
                        "name": "金东区"
                    }
                ]
            },
            {
                "code": "184",
                "name": "台州市",
                "sub": [
                    {
                        "code": "2206",
                        "name": "三门县"
                    },
                    {
                        "code": "2207",
                        "name": "临海市"
                    },
                    {
                        "code": "2208",
                        "name": "仙居县"
                    },
                    {
                        "code": "2209",
                        "name": "天台县"
                    },
                    {
                        "code": "2210",
                        "name": "椒江区"
                    },
                    {
                        "code": "2211",
                        "name": "温岭市"
                    },
                    {
                        "code": "2212",
                        "name": "玉环县"
                    },
                    {
                        "code": "2213",
                        "name": "路桥区"
                    },
                    {
                        "code": "2214",
                        "name": "黄岩区"
                    }
                ]
            },
            {
                "code": "185",
                "name": "丽水市",
                "sub": [
                    {
                        "code": "2215",
                        "name": "云和县"
                    },
                    {
                        "code": "2216",
                        "name": "庆元县"
                    },
                    {
                        "code": "2217",
                        "name": "景宁畲族自治县"
                    },
                    {
                        "code": "2218",
                        "name": "松阳县"
                    },
                    {
                        "code": "2219",
                        "name": "缙云县"
                    },
                    {
                        "code": "2220",
                        "name": "莲都区"
                    },
                    {
                        "code": "2221",
                        "name": "遂昌县"
                    },
                    {
                        "code": "2222",
                        "name": "青田县"
                    },
                    {
                        "code": "2223",
                        "name": "龙泉市"
                    }
                ]
            }
        ]
    },
    {
        "code": "12",
        "name": "安徽省",
        "sub": [
            {
                "code": "186",
                "name": "合肥市",
                "sub": [
                    {
                        "code": "2224",
                        "name": "包河区"
                    },
                    {
                        "code": "2225",
                        "name": "庐阳区"
                    },
                    {
                        "code": "2226",
                        "name": "瑶海区"
                    },
                    {
                        "code": "2227",
                        "name": "肥东县"
                    },
                    {
                        "code": "2228",
                        "name": "肥西县"
                    },
                    {
                        "code": "2229",
                        "name": "蜀山区"
                    },
                    {
                        "code": "2230",
                        "name": "长丰县"
                    }
                ]
            },
            {
                "code": "187",
                "name": "芜湖市",
                "sub": [
                    {
                        "code": "2231",
                        "name": "三山区"
                    },
                    {
                        "code": "2232",
                        "name": "南陵县"
                    },
                    {
                        "code": "2233",
                        "name": "弋江区"
                    },
                    {
                        "code": "2234",
                        "name": "繁昌县"
                    },
                    {
                        "code": "2235",
                        "name": "芜湖县"
                    },
                    {
                        "code": "2236",
                        "name": "镜湖区"
                    },
                    {
                        "code": "2237",
                        "name": "鸠江区"
                    }
                ]
            },
            {
                "code": "188",
                "name": "蚌埠市",
                "sub": [
                    {
                        "code": "2238",
                        "name": "五河县"
                    },
                    {
                        "code": "2239",
                        "name": "固镇县"
                    },
                    {
                        "code": "2240",
                        "name": "怀远县"
                    },
                    {
                        "code": "2241",
                        "name": "淮上区"
                    },
                    {
                        "code": "2242",
                        "name": "禹会区"
                    },
                    {
                        "code": "2243",
                        "name": "蚌山区"
                    },
                    {
                        "code": "2244",
                        "name": "龙子湖区"
                    }
                ]
            },
            {
                "code": "189",
                "name": "淮南市",
                "sub": [
                    {
                        "code": "2245",
                        "name": "八公山区"
                    },
                    {
                        "code": "2246",
                        "name": "凤台县"
                    },
                    {
                        "code": "2247",
                        "name": "大通区"
                    },
                    {
                        "code": "2248",
                        "name": "潘集区"
                    },
                    {
                        "code": "2249",
                        "name": "田家庵区"
                    },
                    {
                        "code": "2250",
                        "name": "谢家集区"
                    }
                ]
            },
            {
                "code": "190",
                "name": "马鞍山市",
                "sub": [
                    {
                        "code": "2251",
                        "name": "当涂县"
                    },
                    {
                        "code": "2252",
                        "name": "花山区"
                    },
                    {
                        "code": "2253",
                        "name": "金家庄区"
                    },
                    {
                        "code": "2254",
                        "name": "雨山区"
                    }
                ]
            },
            {
                "code": "191",
                "name": "淮北市",
                "sub": [
                    {
                        "code": "2255",
                        "name": "杜集区"
                    },
                    {
                        "code": "2256",
                        "name": "濉溪县"
                    },
                    {
                        "code": "2257",
                        "name": "烈山区"
                    },
                    {
                        "code": "2258",
                        "name": "相山区"
                    }
                ]
            },
            {
                "code": "192",
                "name": "铜陵市",
                "sub": [
                    {
                        "code": "2259",
                        "name": "狮子山区"
                    },
                    {
                        "code": "2260",
                        "name": "郊区"
                    },
                    {
                        "code": "2261",
                        "name": "铜官山区"
                    },
                    {
                        "code": "2262",
                        "name": "铜陵县"
                    }
                ]
            },
            {
                "code": "193",
                "name": "安庆市",
                "sub": [
                    {
                        "code": "2263",
                        "name": "大观区"
                    },
                    {
                        "code": "2264",
                        "name": "太湖县"
                    },
                    {
                        "code": "2265",
                        "name": "宜秀区"
                    },
                    {
                        "code": "2266",
                        "name": "宿松县"
                    },
                    {
                        "code": "2267",
                        "name": "岳西县"
                    },
                    {
                        "code": "2268",
                        "name": "怀宁县"
                    },
                    {
                        "code": "2269",
                        "name": "望江县"
                    },
                    {
                        "code": "2270",
                        "name": "枞阳县"
                    },
                    {
                        "code": "2271",
                        "name": "桐城市"
                    },
                    {
                        "code": "2272",
                        "name": "潜山县"
                    },
                    {
                        "code": "2273",
                        "name": "迎江区"
                    }
                ]
            },
            {
                "code": "194",
                "name": "黄山市",
                "sub": [
                    {
                        "code": "2274",
                        "name": "休宁县"
                    },
                    {
                        "code": "2275",
                        "name": "屯溪区"
                    },
                    {
                        "code": "2276",
                        "name": "徽州区"
                    },
                    {
                        "code": "2277",
                        "name": "歙县"
                    },
                    {
                        "code": "2278",
                        "name": "祁门县"
                    },
                    {
                        "code": "2279",
                        "name": "黄山区"
                    },
                    {
                        "code": "2280",
                        "name": "黟县"
                    }
                ]
            },
            {
                "code": "195",
                "name": "滁州市",
                "sub": [
                    {
                        "code": "2281",
                        "name": "全椒县"
                    },
                    {
                        "code": "2282",
                        "name": "凤阳县"
                    },
                    {
                        "code": "2283",
                        "name": "南谯区"
                    },
                    {
                        "code": "2284",
                        "name": "天长市"
                    },
                    {
                        "code": "2285",
                        "name": "定远县"
                    },
                    {
                        "code": "2286",
                        "name": "明光市"
                    },
                    {
                        "code": "2287",
                        "name": "来安县"
                    },
                    {
                        "code": "2288",
                        "name": "琅玡区"
                    }
                ]
            },
            {
                "code": "196",
                "name": "阜阳市",
                "sub": [
                    {
                        "code": "2289",
                        "name": "临泉县"
                    },
                    {
                        "code": "2290",
                        "name": "太和县"
                    },
                    {
                        "code": "2291",
                        "name": "界首市"
                    },
                    {
                        "code": "2292",
                        "name": "阜南县"
                    },
                    {
                        "code": "2293",
                        "name": "颍东区"
                    },
                    {
                        "code": "2294",
                        "name": "颍州区"
                    },
                    {
                        "code": "2295",
                        "name": "颍泉区"
                    },
                    {
                        "code": "2296",
                        "name": "颖上县"
                    }
                ]
            },
            {
                "code": "197",
                "name": "宿州市",
                "sub": [
                    {
                        "code": "2297",
                        "name": "埇桥区"
                    },
                    {
                        "code": "2298",
                        "name": "泗县辖"
                    },
                    {
                        "code": "2299",
                        "name": "灵璧县"
                    },
                    {
                        "code": "2300",
                        "name": "砀山县"
                    },
                    {
                        "code": "2301",
                        "name": "萧县"
                    }
                ]
            },
            {
                "code": "198",
                "name": "巢湖市",
                "sub": [
                    {
                        "code": "2302",
                        "name": "含山县"
                    },
                    {
                        "code": "2303",
                        "name": "和县"
                    },
                    {
                        "code": "2304",
                        "name": "居巢区"
                    },
                    {
                        "code": "2305",
                        "name": "庐江县"
                    },
                    {
                        "code": "2306",
                        "name": "无为县"
                    }
                ]
            },
            {
                "code": "199",
                "name": "六安市",
                "sub": [
                    {
                        "code": "2307",
                        "name": "寿县"
                    },
                    {
                        "code": "2308",
                        "name": "舒城县"
                    },
                    {
                        "code": "2309",
                        "name": "裕安区"
                    },
                    {
                        "code": "2310",
                        "name": "金安区"
                    },
                    {
                        "code": "2311",
                        "name": "金寨县"
                    },
                    {
                        "code": "2312",
                        "name": "霍山县"
                    },
                    {
                        "code": "2313",
                        "name": "霍邱县"
                    }
                ]
            },
            {
                "code": "200",
                "name": "亳州市",
                "sub": [
                    {
                        "code": "2314",
                        "name": "利辛县"
                    },
                    {
                        "code": "2315",
                        "name": "涡阳县"
                    },
                    {
                        "code": "2316",
                        "name": "蒙城县"
                    },
                    {
                        "code": "2317",
                        "name": "谯城区"
                    }
                ]
            },
            {
                "code": "201",
                "name": "池州市",
                "sub": [
                    {
                        "code": "2318",
                        "name": "东至县"
                    },
                    {
                        "code": "2319",
                        "name": "石台县"
                    },
                    {
                        "code": "2320",
                        "name": "贵池区"
                    },
                    {
                        "code": "2321",
                        "name": "青阳县"
                    }
                ]
            },
            {
                "code": "202",
                "name": "宣城市",
                "sub": [
                    {
                        "code": "2322",
                        "name": "宁国市"
                    },
                    {
                        "code": "2323",
                        "name": "宣州区"
                    },
                    {
                        "code": "2324",
                        "name": "广德县"
                    },
                    {
                        "code": "2325",
                        "name": "旌德县"
                    },
                    {
                        "code": "2326",
                        "name": "泾县"
                    },
                    {
                        "code": "2327",
                        "name": "绩溪县"
                    },
                    {
                        "code": "2328",
                        "name": "郎溪县"
                    }
                ]
            }
        ]
    },
    {
        "code": "13",
        "name": "福建省",
        "sub": [
            {
                "code": "203",
                "name": "福州市",
                "sub": [
                    {
                        "code": "2329",
                        "name": "仓山区"
                    },
                    {
                        "code": "2330",
                        "name": "台江区"
                    },
                    {
                        "code": "2331",
                        "name": "平潭县"
                    },
                    {
                        "code": "2332",
                        "name": "晋安区"
                    },
                    {
                        "code": "2333",
                        "name": "永泰县"
                    },
                    {
                        "code": "2334",
                        "name": "福清市"
                    },
                    {
                        "code": "2335",
                        "name": "罗源县"
                    },
                    {
                        "code": "2336",
                        "name": "连江县"
                    },
                    {
                        "code": "2337",
                        "name": "长乐市"
                    },
                    {
                        "code": "2338",
                        "name": "闽侯县"
                    },
                    {
                        "code": "2339",
                        "name": "闽清县"
                    },
                    {
                        "code": "2340",
                        "name": "马尾区"
                    },
                    {
                        "code": "2341",
                        "name": "鼓楼区"
                    }
                ]
            },
            {
                "code": "204",
                "name": "厦门市",
                "sub": [
                    {
                        "code": "2342",
                        "name": "同安区"
                    },
                    {
                        "code": "2343",
                        "name": "思明区"
                    },
                    {
                        "code": "2344",
                        "name": "海沧区"
                    },
                    {
                        "code": "2345",
                        "name": "湖里区"
                    },
                    {
                        "code": "2346",
                        "name": "翔安区"
                    },
                    {
                        "code": "2347",
                        "name": "集美区"
                    }
                ]
            },
            {
                "code": "205",
                "name": "莆田市",
                "sub": [
                    {
                        "code": "2348",
                        "name": "仙游县"
                    },
                    {
                        "code": "2349",
                        "name": "城厢区"
                    },
                    {
                        "code": "2350",
                        "name": "涵江区"
                    },
                    {
                        "code": "2351",
                        "name": "秀屿区"
                    },
                    {
                        "code": "2352",
                        "name": "荔城区"
                    }
                ]
            },
            {
                "code": "206",
                "name": "三明市",
                "sub": [
                    {
                        "code": "2353",
                        "name": "三元区"
                    },
                    {
                        "code": "2354",
                        "name": "大田县"
                    },
                    {
                        "code": "2355",
                        "name": "宁化县"
                    },
                    {
                        "code": "2356",
                        "name": "将乐县"
                    },
                    {
                        "code": "2357",
                        "name": "尤溪县"
                    },
                    {
                        "code": "2358",
                        "name": "建宁县"
                    },
                    {
                        "code": "2359",
                        "name": "明溪县"
                    },
                    {
                        "code": "2360",
                        "name": "梅列区"
                    },
                    {
                        "code": "2361",
                        "name": "永安市"
                    },
                    {
                        "code": "2362",
                        "name": "沙县"
                    },
                    {
                        "code": "2363",
                        "name": "泰宁县"
                    },
                    {
                        "code": "2364",
                        "name": "清流县"
                    }
                ]
            },
            {
                "code": "207",
                "name": "泉州市",
                "sub": [
                    {
                        "code": "2365",
                        "name": "丰泽区"
                    },
                    {
                        "code": "2366",
                        "name": "南安市"
                    },
                    {
                        "code": "2367",
                        "name": "安溪县"
                    },
                    {
                        "code": "2368",
                        "name": "德化县"
                    },
                    {
                        "code": "2369",
                        "name": "惠安县"
                    },
                    {
                        "code": "2370",
                        "name": "晋江市"
                    },
                    {
                        "code": "2371",
                        "name": "永春县"
                    },
                    {
                        "code": "2372",
                        "name": "泉港区"
                    },
                    {
                        "code": "2373",
                        "name": "洛江区"
                    },
                    {
                        "code": "2374",
                        "name": "石狮市"
                    },
                    {
                        "code": "2375",
                        "name": "金门县"
                    },
                    {
                        "code": "2376",
                        "name": "鲤城区"
                    }
                ]
            },
            {
                "code": "208",
                "name": "漳州市",
                "sub": [
                    {
                        "code": "2377",
                        "name": "东山县"
                    },
                    {
                        "code": "2378",
                        "name": "云霄县"
                    },
                    {
                        "code": "2379",
                        "name": "华安县"
                    },
                    {
                        "code": "2380",
                        "name": "南靖县"
                    },
                    {
                        "code": "2381",
                        "name": "平和县"
                    },
                    {
                        "code": "2382",
                        "name": "漳浦县"
                    },
                    {
                        "code": "2383",
                        "name": "芗城区"
                    },
                    {
                        "code": "2384",
                        "name": "诏安县"
                    },
                    {
                        "code": "2385",
                        "name": "长泰县"
                    },
                    {
                        "code": "2386",
                        "name": "龙文区"
                    },
                    {
                        "code": "2387",
                        "name": "龙海市"
                    }
                ]
            },
            {
                "code": "209",
                "name": "南平市",
                "sub": [
                    {
                        "code": "2388",
                        "name": "光泽县"
                    },
                    {
                        "code": "2389",
                        "name": "延平区"
                    },
                    {
                        "code": "2390",
                        "name": "建瓯市"
                    },
                    {
                        "code": "2391",
                        "name": "建阳市"
                    },
                    {
                        "code": "2392",
                        "name": "政和县"
                    },
                    {
                        "code": "2393",
                        "name": "松溪县"
                    },
                    {
                        "code": "2394",
                        "name": "武夷山市"
                    },
                    {
                        "code": "2395",
                        "name": "浦城县"
                    },
                    {
                        "code": "2396",
                        "name": "邵武市"
                    },
                    {
                        "code": "2397",
                        "name": "顺昌县"
                    }
                ]
            },
            {
                "code": "210",
                "name": "龙岩市",
                "sub": [
                    {
                        "code": "2398",
                        "name": "上杭县"
                    },
                    {
                        "code": "2399",
                        "name": "新罗区"
                    },
                    {
                        "code": "2400",
                        "name": "武平县"
                    },
                    {
                        "code": "2401",
                        "name": "永定县"
                    },
                    {
                        "code": "2402",
                        "name": "漳平市"
                    },
                    {
                        "code": "2403",
                        "name": "连城县"
                    },
                    {
                        "code": "2404",
                        "name": "长汀县"
                    }
                ]
            },
            {
                "code": "211",
                "name": "宁德市",
                "sub": [
                    {
                        "code": "2405",
                        "name": "古田县"
                    },
                    {
                        "code": "2406",
                        "name": "周宁县"
                    },
                    {
                        "code": "2407",
                        "name": "寿宁县"
                    },
                    {
                        "code": "2408",
                        "name": "屏南县"
                    },
                    {
                        "code": "2409",
                        "name": "柘荣县"
                    },
                    {
                        "code": "2410",
                        "name": "福安市"
                    },
                    {
                        "code": "2411",
                        "name": "福鼎市"
                    },
                    {
                        "code": "2412",
                        "name": "蕉城区"
                    },
                    {
                        "code": "2413",
                        "name": "霞浦县"
                    }
                ]
            }
        ]
    },
    {
        "code": "14",
        "name": "江西省",
        "sub": [
            {
                "code": "212",
                "name": "南昌市",
                "sub": [
                    {
                        "code": "2414",
                        "name": "东湖区"
                    },
                    {
                        "code": "2415",
                        "name": "南昌县"
                    },
                    {
                        "code": "2416",
                        "name": "安义县"
                    },
                    {
                        "code": "2417",
                        "name": "新建县"
                    },
                    {
                        "code": "2418",
                        "name": "湾里区"
                    },
                    {
                        "code": "2419",
                        "name": "西湖区"
                    },
                    {
                        "code": "2420",
                        "name": "进贤县"
                    },
                    {
                        "code": "2421",
                        "name": "青云谱区"
                    },
                    {
                        "code": "2422",
                        "name": "青山湖区"
                    }
                ]
            },
            {
                "code": "213",
                "name": "景德镇市",
                "sub": [
                    {
                        "code": "2423",
                        "name": "乐平市"
                    },
                    {
                        "code": "2424",
                        "name": "昌江区"
                    },
                    {
                        "code": "2425",
                        "name": "浮梁县"
                    },
                    {
                        "code": "2426",
                        "name": "珠山区"
                    }
                ]
            },
            {
                "code": "214",
                "name": "萍乡市",
                "sub": [
                    {
                        "code": "2427",
                        "name": "上栗县"
                    },
                    {
                        "code": "2428",
                        "name": "安源区"
                    },
                    {
                        "code": "2429",
                        "name": "湘东区"
                    },
                    {
                        "code": "2430",
                        "name": "芦溪县"
                    },
                    {
                        "code": "2431",
                        "name": "莲花县"
                    }
                ]
            },
            {
                "code": "215",
                "name": "九江市",
                "sub": [
                    {
                        "code": "2432",
                        "name": "九江县"
                    },
                    {
                        "code": "2433",
                        "name": "修水县"
                    },
                    {
                        "code": "2434",
                        "name": "庐山区"
                    },
                    {
                        "code": "2435",
                        "name": "彭泽县"
                    },
                    {
                        "code": "2436",
                        "name": "德安县"
                    },
                    {
                        "code": "2437",
                        "name": "星子县"
                    },
                    {
                        "code": "2438",
                        "name": "武宁县"
                    },
                    {
                        "code": "2439",
                        "name": "永修县"
                    },
                    {
                        "code": "2440",
                        "name": "浔阳区"
                    },
                    {
                        "code": "2441",
                        "name": "湖口县"
                    },
                    {
                        "code": "2442",
                        "name": "瑞昌市"
                    },
                    {
                        "code": "2443",
                        "name": "都昌县"
                    }
                ]
            },
            {
                "code": "216",
                "name": "新余市",
                "sub": [
                    {
                        "code": "2444",
                        "name": "分宜县"
                    },
                    {
                        "code": "2445",
                        "name": "渝水区"
                    }
                ]
            },
            {
                "code": "217",
                "name": "鹰潭市",
                "sub": [
                    {
                        "code": "2446",
                        "name": "余江县"
                    },
                    {
                        "code": "2447",
                        "name": "月湖区"
                    },
                    {
                        "code": "2448",
                        "name": "贵溪市"
                    }
                ]
            },
            {
                "code": "218",
                "name": "赣州市",
                "sub": [
                    {
                        "code": "2449",
                        "name": "上犹县"
                    },
                    {
                        "code": "2450",
                        "name": "于都县"
                    },
                    {
                        "code": "2451",
                        "name": "会昌县"
                    },
                    {
                        "code": "2452",
                        "name": "信丰县"
                    },
                    {
                        "code": "2453",
                        "name": "全南县"
                    },
                    {
                        "code": "2454",
                        "name": "兴国县"
                    },
                    {
                        "code": "2455",
                        "name": "南康市"
                    },
                    {
                        "code": "2456",
                        "name": "大余县"
                    },
                    {
                        "code": "2457",
                        "name": "宁都县"
                    },
                    {
                        "code": "2458",
                        "name": "安远县"
                    },
                    {
                        "code": "2459",
                        "name": "定南县"
                    },
                    {
                        "code": "2460",
                        "name": "寻乌县"
                    },
                    {
                        "code": "2461",
                        "name": "崇义县"
                    },
                    {
                        "code": "2462",
                        "name": "瑞金市"
                    },
                    {
                        "code": "2463",
                        "name": "石城县"
                    },
                    {
                        "code": "2464",
                        "name": "章贡区"
                    },
                    {
                        "code": "2465",
                        "name": "赣县"
                    },
                    {
                        "code": "2466",
                        "name": "龙南县"
                    }
                ]
            },
            {
                "code": "219",
                "name": "吉安市",
                "sub": [
                    {
                        "code": "2467",
                        "name": "万安县"
                    },
                    {
                        "code": "2468",
                        "name": "井冈山市"
                    },
                    {
                        "code": "2469",
                        "name": "吉安县"
                    },
                    {
                        "code": "2470",
                        "name": "吉州区"
                    },
                    {
                        "code": "2471",
                        "name": "吉水县"
                    },
                    {
                        "code": "2472",
                        "name": "安福县"
                    },
                    {
                        "code": "2473",
                        "name": "峡江县"
                    },
                    {
                        "code": "2474",
                        "name": "新干县"
                    },
                    {
                        "code": "2475",
                        "name": "永丰县"
                    },
                    {
                        "code": "2476",
                        "name": "永新县"
                    },
                    {
                        "code": "2477",
                        "name": "泰和县"
                    },
                    {
                        "code": "2478",
                        "name": "遂川县"
                    },
                    {
                        "code": "2479",
                        "name": "青原区"
                    }
                ]
            },
            {
                "code": "220",
                "name": "宜春市",
                "sub": [
                    {
                        "code": "2480",
                        "name": "万载县"
                    },
                    {
                        "code": "2481",
                        "name": "上高县"
                    },
                    {
                        "code": "2482",
                        "name": "丰城市"
                    },
                    {
                        "code": "2483",
                        "name": "奉新县"
                    },
                    {
                        "code": "2484",
                        "name": "宜丰县"
                    },
                    {
                        "code": "2485",
                        "name": "樟树市"
                    },
                    {
                        "code": "2486",
                        "name": "袁州区"
                    },
                    {
                        "code": "2487",
                        "name": "铜鼓县"
                    },
                    {
                        "code": "2488",
                        "name": "靖安县"
                    },
                    {
                        "code": "2489",
                        "name": "高安市"
                    }
                ]
            },
            {
                "code": "221",
                "name": "抚州市",
                "sub": [
                    {
                        "code": "2490",
                        "name": "东乡县"
                    },
                    {
                        "code": "2491",
                        "name": "临川区"
                    },
                    {
                        "code": "2492",
                        "name": "乐安县"
                    },
                    {
                        "code": "2493",
                        "name": "南丰县"
                    },
                    {
                        "code": "2494",
                        "name": "南城县"
                    },
                    {
                        "code": "2495",
                        "name": "宜黄县"
                    },
                    {
                        "code": "2496",
                        "name": "崇仁县"
                    },
                    {
                        "code": "2497",
                        "name": "广昌县"
                    },
                    {
                        "code": "2498",
                        "name": "资溪县"
                    },
                    {
                        "code": "2499",
                        "name": "金溪县"
                    },
                    {
                        "code": "2500",
                        "name": "黎川县"
                    }
                ]
            },
            {
                "code": "222",
                "name": "上饶市",
                "sub": [
                    {
                        "code": "2501",
                        "name": "万年县"
                    },
                    {
                        "code": "2502",
                        "name": "上饶县"
                    },
                    {
                        "code": "2503",
                        "name": "余干县"
                    },
                    {
                        "code": "2504",
                        "name": "信州区"
                    },
                    {
                        "code": "2505",
                        "name": "婺源县"
                    },
                    {
                        "code": "2506",
                        "name": "广丰县"
                    },
                    {
                        "code": "2507",
                        "name": "弋阳县"
                    },
                    {
                        "code": "2508",
                        "name": "德兴市"
                    },
                    {
                        "code": "2509",
                        "name": "横峰县"
                    },
                    {
                        "code": "2510",
                        "name": "玉山县"
                    },
                    {
                        "code": "2511",
                        "name": "鄱阳县"
                    },
                    {
                        "code": "2512",
                        "name": "铅山县"
                    }
                ]
            }
        ]
    },
    {
        "code": "15",
        "name": "山东省",
        "sub": [
            {
                "code": "223",
                "name": "济南市",
                "sub": [
                    {
                        "code": "2513",
                        "name": "历下区"
                    },
                    {
                        "code": "2514",
                        "name": "历城区"
                    },
                    {
                        "code": "2515",
                        "name": "商河县"
                    },
                    {
                        "code": "2516",
                        "name": "天桥区"
                    },
                    {
                        "code": "2517",
                        "name": "市中区"
                    },
                    {
                        "code": "2518",
                        "name": "平阴县"
                    },
                    {
                        "code": "2519",
                        "name": "槐荫区"
                    },
                    {
                        "code": "2520",
                        "name": "济阳县"
                    },
                    {
                        "code": "2521",
                        "name": "章丘市"
                    },
                    {
                        "code": "2522",
                        "name": "长清区"
                    }
                ]
            },
            {
                "code": "224",
                "name": "青岛市",
                "sub": [
                    {
                        "code": "2523",
                        "name": "即墨市"
                    },
                    {
                        "code": "2524",
                        "name": "四方区"
                    },
                    {
                        "code": "2525",
                        "name": "城阳区"
                    },
                    {
                        "code": "2526",
                        "name": "崂山区"
                    },
                    {
                        "code": "2527",
                        "name": "市北区"
                    },
                    {
                        "code": "2528",
                        "name": "市南区"
                    },
                    {
                        "code": "2529",
                        "name": "平度市"
                    },
                    {
                        "code": "2530",
                        "name": "李沧区"
                    },
                    {
                        "code": "2531",
                        "name": "胶南市"
                    },
                    {
                        "code": "2532",
                        "name": "胶州市"
                    },
                    {
                        "code": "2533",
                        "name": "莱西市"
                    },
                    {
                        "code": "2534",
                        "name": "黄岛区"
                    }
                ]
            },
            {
                "code": "225",
                "name": "淄博市",
                "sub": [
                    {
                        "code": "2535",
                        "name": "临淄区"
                    },
                    {
                        "code": "2536",
                        "name": "博山区"
                    },
                    {
                        "code": "2537",
                        "name": "周村区"
                    },
                    {
                        "code": "2538",
                        "name": "张店区"
                    },
                    {
                        "code": "2539",
                        "name": "桓台县"
                    },
                    {
                        "code": "2540",
                        "name": "沂源县"
                    },
                    {
                        "code": "2541",
                        "name": "淄川区"
                    },
                    {
                        "code": "2542",
                        "name": "高青县"
                    }
                ]
            },
            {
                "code": "226",
                "name": "枣庄市",
                "sub": [
                    {
                        "code": "2543",
                        "name": "台儿庄区"
                    },
                    {
                        "code": "2544",
                        "name": "山亭区"
                    },
                    {
                        "code": "2545",
                        "name": "峄城区"
                    },
                    {
                        "code": "2546",
                        "name": "市中区"
                    },
                    {
                        "code": "2547",
                        "name": "滕州市"
                    },
                    {
                        "code": "2548",
                        "name": "薛城区"
                    }
                ]
            },
            {
                "code": "227",
                "name": "东营市",
                "sub": [
                    {
                        "code": "2549",
                        "name": "东营区"
                    },
                    {
                        "code": "2550",
                        "name": "利津县"
                    },
                    {
                        "code": "2551",
                        "name": "垦利县"
                    },
                    {
                        "code": "2552",
                        "name": "广饶县"
                    },
                    {
                        "code": "2553",
                        "name": "河口区"
                    }
                ]
            },
            {
                "code": "228",
                "name": "烟台市",
                "sub": [
                    {
                        "code": "2554",
                        "name": "招远市"
                    },
                    {
                        "code": "2555",
                        "name": "栖霞市"
                    },
                    {
                        "code": "2556",
                        "name": "海阳市"
                    },
                    {
                        "code": "2557",
                        "name": "牟平区"
                    },
                    {
                        "code": "2558",
                        "name": "福山区"
                    },
                    {
                        "code": "2559",
                        "name": "芝罘区"
                    },
                    {
                        "code": "2560",
                        "name": "莱山区"
                    },
                    {
                        "code": "2561",
                        "name": "莱州市"
                    },
                    {
                        "code": "2562",
                        "name": "莱阳市"
                    },
                    {
                        "code": "2563",
                        "name": "蓬莱市"
                    },
                    {
                        "code": "2564",
                        "name": "长岛县"
                    },
                    {
                        "code": "2565",
                        "name": "龙口市"
                    }
                ]
            },
            {
                "code": "229",
                "name": "潍坊市",
                "sub": [
                    {
                        "code": "2566",
                        "name": "临朐县"
                    },
                    {
                        "code": "2567",
                        "name": "坊子区"
                    },
                    {
                        "code": "2568",
                        "name": "奎文区"
                    },
                    {
                        "code": "2569",
                        "name": "安丘市"
                    },
                    {
                        "code": "2570",
                        "name": "寒亭区"
                    },
                    {
                        "code": "2571",
                        "name": "寿光市"
                    },
                    {
                        "code": "2572",
                        "name": "昌乐县"
                    },
                    {
                        "code": "2573",
                        "name": "昌邑市"
                    },
                    {
                        "code": "2574",
                        "name": "潍城区"
                    },
                    {
                        "code": "2575",
                        "name": "诸城市"
                    },
                    {
                        "code": "2576",
                        "name": "青州市"
                    },
                    {
                        "code": "2577",
                        "name": "高密市"
                    }
                ]
            },
            {
                "code": "230",
                "name": "济宁市",
                "sub": [
                    {
                        "code": "2578",
                        "name": "任城区"
                    },
                    {
                        "code": "2579",
                        "name": "兖州市"
                    },
                    {
                        "code": "2580",
                        "name": "嘉祥县"
                    },
                    {
                        "code": "2581",
                        "name": "市中区"
                    },
                    {
                        "code": "2582",
                        "name": "微山县"
                    },
                    {
                        "code": "2583",
                        "name": "曲阜市"
                    },
                    {
                        "code": "2584",
                        "name": "梁山县"
                    },
                    {
                        "code": "2585",
                        "name": "汶上县"
                    },
                    {
                        "code": "2586",
                        "name": "泗水县"
                    },
                    {
                        "code": "2587",
                        "name": "邹城市"
                    },
                    {
                        "code": "2588",
                        "name": "金乡县"
                    },
                    {
                        "code": "2589",
                        "name": "鱼台县"
                    }
                ]
            },
            {
                "code": "231",
                "name": "泰安市",
                "sub": [
                    {
                        "code": "2590",
                        "name": "东平县"
                    },
                    {
                        "code": "2591",
                        "name": "宁阳县"
                    },
                    {
                        "code": "2592",
                        "name": "岱岳区"
                    },
                    {
                        "code": "2593",
                        "name": "新泰市"
                    },
                    {
                        "code": "2594",
                        "name": "泰山区"
                    },
                    {
                        "code": "2595",
                        "name": "肥城市"
                    }
                ]
            },
            {
                "code": "232",
                "name": "威海市",
                "sub": [
                    {
                        "code": "2596",
                        "name": "乳山市"
                    },
                    {
                        "code": "2597",
                        "name": "文登市"
                    },
                    {
                        "code": "2598",
                        "name": "环翠区"
                    },
                    {
                        "code": "2599",
                        "name": "荣成市"
                    }
                ]
            },
            {
                "code": "233",
                "name": "日照市",
                "sub": [
                    {
                        "code": "2600",
                        "name": "东港区"
                    },
                    {
                        "code": "2601",
                        "name": "五莲县"
                    },
                    {
                        "code": "2602",
                        "name": "岚山区"
                    },
                    {
                        "code": "2603",
                        "name": "莒县"
                    }
                ]
            },
            {
                "code": "234",
                "name": "莱芜市",
                "sub": [
                    {
                        "code": "2604",
                        "name": "莱城区"
                    },
                    {
                        "code": "2605",
                        "name": "钢城区"
                    }
                ]
            },
            {
                "code": "235",
                "name": "临沂市",
                "sub": [
                    {
                        "code": "2606",
                        "name": "临沭县"
                    },
                    {
                        "code": "2607",
                        "name": "兰山区"
                    },
                    {
                        "code": "2608",
                        "name": "平邑县"
                    },
                    {
                        "code": "2609",
                        "name": "沂南县"
                    },
                    {
                        "code": "2610",
                        "name": "沂水县"
                    },
                    {
                        "code": "2611",
                        "name": "河东区"
                    },
                    {
                        "code": "2612",
                        "name": "罗庄区"
                    },
                    {
                        "code": "2613",
                        "name": "苍山县"
                    },
                    {
                        "code": "2614",
                        "name": "莒南县"
                    },
                    {
                        "code": "2615",
                        "name": "蒙阴县"
                    },
                    {
                        "code": "2616",
                        "name": "费县"
                    },
                    {
                        "code": "2617",
                        "name": "郯城县"
                    }
                ]
            },
            {
                "code": "236",
                "name": "德州市",
                "sub": [
                    {
                        "code": "2618",
                        "name": "临邑县"
                    },
                    {
                        "code": "2619",
                        "name": "乐陵市"
                    },
                    {
                        "code": "2620",
                        "name": "夏津县"
                    },
                    {
                        "code": "2621",
                        "name": "宁津县"
                    },
                    {
                        "code": "2622",
                        "name": "平原县"
                    },
                    {
                        "code": "2623",
                        "name": "庆云县"
                    },
                    {
                        "code": "2624",
                        "name": "德城区"
                    },
                    {
                        "code": "2625",
                        "name": "武城县"
                    },
                    {
                        "code": "2626",
                        "name": "禹城市"
                    },
                    {
                        "code": "2627",
                        "name": "陵县"
                    },
                    {
                        "code": "2628",
                        "name": "齐河县"
                    }
                ]
            },
            {
                "code": "237",
                "name": "聊城市",
                "sub": [
                    {
                        "code": "2629",
                        "name": "东昌府区"
                    },
                    {
                        "code": "2630",
                        "name": "东阿县"
                    },
                    {
                        "code": "2631",
                        "name": "临清市"
                    },
                    {
                        "code": "2632",
                        "name": "冠县"
                    },
                    {
                        "code": "2633",
                        "name": "茌平县"
                    },
                    {
                        "code": "2634",
                        "name": "莘县"
                    },
                    {
                        "code": "2635",
                        "name": "阳谷县"
                    },
                    {
                        "code": "2636",
                        "name": "高唐县"
                    }
                ]
            },
            {
                "code": "238",
                "name": "滨州市",
                "sub": [
                    {
                        "code": "2637",
                        "name": "博兴县"
                    },
                    {
                        "code": "2638",
                        "name": "惠民县"
                    },
                    {
                        "code": "2639",
                        "name": "无棣县"
                    },
                    {
                        "code": "2640",
                        "name": "沾化县"
                    },
                    {
                        "code": "2641",
                        "name": "滨城区"
                    },
                    {
                        "code": "2642",
                        "name": "邹平县"
                    },
                    {
                        "code": "2643",
                        "name": "阳信县"
                    }
                ]
            },
            {
                "code": "239",
                "name": "菏泽市",
                "sub": [
                    {
                        "code": "2644",
                        "name": "东明县"
                    },
                    {
                        "code": "2645",
                        "name": "单县"
                    },
                    {
                        "code": "2646",
                        "name": "定陶县"
                    },
                    {
                        "code": "2647",
                        "name": "巨野县"
                    },
                    {
                        "code": "2648",
                        "name": "成武县"
                    },
                    {
                        "code": "2649",
                        "name": "曹县"
                    },
                    {
                        "code": "2650",
                        "name": "牡丹区"
                    },
                    {
                        "code": "2651",
                        "name": "郓城县"
                    },
                    {
                        "code": "2652",
                        "name": "鄄城县"
                    }
                ]
            }
        ]
    },
    {
        "code": "16",
        "name": "河南省",
        "sub": [
            {
                "code": "240",
                "name": "郑州市",
                "sub": [
                    {
                        "code": "2653",
                        "name": "上街区"
                    },
                    {
                        "code": "2654",
                        "name": "中原区"
                    },
                    {
                        "code": "2655",
                        "name": "中牟县"
                    },
                    {
                        "code": "2656",
                        "name": "二七区"
                    },
                    {
                        "code": "2657",
                        "name": "巩义市"
                    },
                    {
                        "code": "2658",
                        "name": "惠济区"
                    },
                    {
                        "code": "2659",
                        "name": "新密市"
                    },
                    {
                        "code": "2660",
                        "name": "新郑市"
                    },
                    {
                        "code": "2661",
                        "name": "登封市"
                    },
                    {
                        "code": "2662",
                        "name": "管城回族区"
                    },
                    {
                        "code": "2663",
                        "name": "荥阳市"
                    },
                    {
                        "code": "2664",
                        "name": "金水区"
                    }
                ]
            },
            {
                "code": "241",
                "name": "开封市",
                "sub": [
                    {
                        "code": "2665",
                        "name": "兰考县"
                    },
                    {
                        "code": "2666",
                        "name": "尉氏县"
                    },
                    {
                        "code": "2667",
                        "name": "开封县"
                    },
                    {
                        "code": "2668",
                        "name": "杞县"
                    },
                    {
                        "code": "2669",
                        "name": "禹王台区"
                    },
                    {
                        "code": "2670",
                        "name": "通许县"
                    },
                    {
                        "code": "2671",
                        "name": "金明区"
                    },
                    {
                        "code": "2672",
                        "name": "顺河回族区"
                    },
                    {
                        "code": "2673",
                        "name": "鼓楼区"
                    },
                    {
                        "code": "2674",
                        "name": "龙亭区"
                    }
                ]
            },
            {
                "code": "242",
                "name": "洛阳市",
                "sub": [
                    {
                        "code": "2675",
                        "name": "伊川县"
                    },
                    {
                        "code": "2676",
                        "name": "偃师市"
                    },
                    {
                        "code": "2677",
                        "name": "吉利区"
                    },
                    {
                        "code": "2678",
                        "name": "孟津县"
                    },
                    {
                        "code": "2679",
                        "name": "宜阳县"
                    },
                    {
                        "code": "2680",
                        "name": "嵩县"
                    },
                    {
                        "code": "2681",
                        "name": "新安县"
                    },
                    {
                        "code": "2682",
                        "name": "栾川县"
                    },
                    {
                        "code": "2683",
                        "name": "汝阳县"
                    },
                    {
                        "code": "2684",
                        "name": "洛宁县"
                    },
                    {
                        "code": "2685",
                        "name": "洛龙区"
                    },
                    {
                        "code": "2686",
                        "name": "涧西区"
                    },
                    {
                        "code": "2687",
                        "name": "瀍河回族区"
                    },
                    {
                        "code": "2688",
                        "name": "老城区"
                    },
                    {
                        "code": "2689",
                        "name": "西工区"
                    }
                ]
            },
            {
                "code": "243",
                "name": "平顶山市",
                "sub": [
                    {
                        "code": "2690",
                        "name": "卫东区"
                    },
                    {
                        "code": "2691",
                        "name": "叶县"
                    },
                    {
                        "code": "2692",
                        "name": "宝丰县"
                    },
                    {
                        "code": "2693",
                        "name": "新华区"
                    },
                    {
                        "code": "2694",
                        "name": "汝州市"
                    },
                    {
                        "code": "2695",
                        "name": "湛河区"
                    },
                    {
                        "code": "2696",
                        "name": "石龙区"
                    },
                    {
                        "code": "2697",
                        "name": "舞钢市"
                    },
                    {
                        "code": "2698",
                        "name": "郏县"
                    },
                    {
                        "code": "2699",
                        "name": "鲁山县"
                    }
                ]
            },
            {
                "code": "244",
                "name": "安阳市",
                "sub": [
                    {
                        "code": "2700",
                        "name": "内黄县"
                    },
                    {
                        "code": "2701",
                        "name": "北关区"
                    },
                    {
                        "code": "2702",
                        "name": "安阳县"
                    },
                    {
                        "code": "2703",
                        "name": "文峰区"
                    },
                    {
                        "code": "2704",
                        "name": "林州市"
                    },
                    {
                        "code": "2705",
                        "name": "殷都区"
                    },
                    {
                        "code": "2706",
                        "name": "汤阴县"
                    },
                    {
                        "code": "2707",
                        "name": "滑县"
                    },
                    {
                        "code": "2708",
                        "name": "龙安区"
                    }
                ]
            },
            {
                "code": "245",
                "name": "鹤壁市",
                "sub": [
                    {
                        "code": "2709",
                        "name": "山城区"
                    },
                    {
                        "code": "2710",
                        "name": "浚县"
                    },
                    {
                        "code": "2711",
                        "name": "淇县"
                    },
                    {
                        "code": "2712",
                        "name": "淇滨区"
                    },
                    {
                        "code": "2713",
                        "name": "鹤山区"
                    }
                ]
            },
            {
                "code": "246",
                "name": "新乡市",
                "sub": [
                    {
                        "code": "2714",
                        "name": "凤泉区"
                    },
                    {
                        "code": "2715",
                        "name": "卫滨区"
                    },
                    {
                        "code": "2716",
                        "name": "卫辉市"
                    },
                    {
                        "code": "2717",
                        "name": "原阳县"
                    },
                    {
                        "code": "2718",
                        "name": "封丘县"
                    },
                    {
                        "code": "2719",
                        "name": "延津县"
                    },
                    {
                        "code": "2720",
                        "name": "新乡县"
                    },
                    {
                        "code": "2721",
                        "name": "牧野区"
                    },
                    {
                        "code": "2722",
                        "name": "红旗区"
                    },
                    {
                        "code": "2723",
                        "name": "获嘉县"
                    },
                    {
                        "code": "2724",
                        "name": "辉县市"
                    },
                    {
                        "code": "2725",
                        "name": "长垣县"
                    }
                ]
            },
            {
                "code": "247",
                "name": "焦作市",
                "sub": [
                    {
                        "code": "2726",
                        "name": "中站区"
                    },
                    {
                        "code": "2727",
                        "name": "修武县"
                    },
                    {
                        "code": "2728",
                        "name": "博爱县"
                    },
                    {
                        "code": "2729",
                        "name": "孟州市"
                    },
                    {
                        "code": "2730",
                        "name": "山阳区"
                    },
                    {
                        "code": "2731",
                        "name": "武陟县"
                    },
                    {
                        "code": "2732",
                        "name": "沁阳市"
                    },
                    {
                        "code": "2733",
                        "name": "温县"
                    },
                    {
                        "code": "2734",
                        "name": "解放区"
                    },
                    {
                        "code": "2735",
                        "name": "马村区"
                    }
                ]
            },
            {
                "code": "248",
                "name": "濮阳市",
                "sub": [
                    {
                        "code": "2736",
                        "name": "华龙区"
                    },
                    {
                        "code": "2737",
                        "name": "南乐县"
                    },
                    {
                        "code": "2738",
                        "name": "台前县"
                    },
                    {
                        "code": "2739",
                        "name": "清丰县"
                    },
                    {
                        "code": "2740",
                        "name": "濮阳县"
                    },
                    {
                        "code": "2741",
                        "name": "范县"
                    }
                ]
            },
            {
                "code": "249",
                "name": "许昌市",
                "sub": [
                    {
                        "code": "2742",
                        "name": "禹州市"
                    },
                    {
                        "code": "2743",
                        "name": "襄城县"
                    },
                    {
                        "code": "2744",
                        "name": "许昌县"
                    },
                    {
                        "code": "2745",
                        "name": "鄢陵县"
                    },
                    {
                        "code": "2746",
                        "name": "长葛市"
                    },
                    {
                        "code": "2747",
                        "name": "魏都区"
                    }
                ]
            },
            {
                "code": "250",
                "name": "漯河市",
                "sub": [
                    {
                        "code": "2748",
                        "name": "临颍县"
                    },
                    {
                        "code": "2749",
                        "name": "召陵区"
                    },
                    {
                        "code": "2750",
                        "name": "源汇区"
                    },
                    {
                        "code": "2751",
                        "name": "舞阳县"
                    },
                    {
                        "code": "2752",
                        "name": "郾城区"
                    }
                ]
            },
            {
                "code": "251",
                "name": "三门峡市",
                "sub": [
                    {
                        "code": "2753",
                        "name": "义马市"
                    },
                    {
                        "code": "2754",
                        "name": "卢氏县"
                    },
                    {
                        "code": "2755",
                        "name": "渑池县"
                    },
                    {
                        "code": "2756",
                        "name": "湖滨区"
                    },
                    {
                        "code": "2757",
                        "name": "灵宝市"
                    },
                    {
                        "code": "2758",
                        "name": "陕县"
                    }
                ]
            },
            {
                "code": "252",
                "name": "南阳市",
                "sub": [
                    {
                        "code": "2759",
                        "name": "内乡县"
                    },
                    {
                        "code": "2760",
                        "name": "南召县"
                    },
                    {
                        "code": "2761",
                        "name": "卧龙区"
                    },
                    {
                        "code": "2762",
                        "name": "唐河县"
                    },
                    {
                        "code": "2763",
                        "name": "宛城区"
                    },
                    {
                        "code": "2764",
                        "name": "新野县"
                    },
                    {
                        "code": "2765",
                        "name": "方城县"
                    },
                    {
                        "code": "2766",
                        "name": "桐柏县"
                    },
                    {
                        "code": "2767",
                        "name": "淅川县"
                    },
                    {
                        "code": "2768",
                        "name": "社旗县"
                    },
                    {
                        "code": "2769",
                        "name": "西峡县"
                    },
                    {
                        "code": "2770",
                        "name": "邓州市"
                    },
                    {
                        "code": "2771",
                        "name": "镇平县"
                    }
                ]
            },
            {
                "code": "253",
                "name": "商丘市",
                "sub": [
                    {
                        "code": "2772",
                        "name": "夏邑县"
                    },
                    {
                        "code": "2773",
                        "name": "宁陵县"
                    },
                    {
                        "code": "2774",
                        "name": "柘城县"
                    },
                    {
                        "code": "2775",
                        "name": "民权县"
                    },
                    {
                        "code": "2776",
                        "name": "永城市"
                    },
                    {
                        "code": "2777",
                        "name": "睢县"
                    },
                    {
                        "code": "2778",
                        "name": "睢阳区"
                    },
                    {
                        "code": "2779",
                        "name": "粱园区"
                    },
                    {
                        "code": "2780",
                        "name": "虞城县"
                    }
                ]
            },
            {
                "code": "254",
                "name": "信阳市",
                "sub": [
                    {
                        "code": "2781",
                        "name": "光山县"
                    },
                    {
                        "code": "2782",
                        "name": "商城县"
                    },
                    {
                        "code": "2783",
                        "name": "固始县"
                    },
                    {
                        "code": "2784",
                        "name": "平桥区"
                    },
                    {
                        "code": "2785",
                        "name": "息县"
                    },
                    {
                        "code": "2786",
                        "name": "新县"
                    },
                    {
                        "code": "2787",
                        "name": "浉河区"
                    },
                    {
                        "code": "2788",
                        "name": "淮滨县"
                    },
                    {
                        "code": "2789",
                        "name": "潢川县"
                    },
                    {
                        "code": "2790",
                        "name": "罗山县"
                    }
                ]
            },
            {
                "code": "255",
                "name": "周口市",
                "sub": [
                    {
                        "code": "2791",
                        "name": "商水县"
                    },
                    {
                        "code": "2792",
                        "name": "太康县"
                    },
                    {
                        "code": "2793",
                        "name": "川汇区"
                    },
                    {
                        "code": "2794",
                        "name": "扶沟县"
                    },
                    {
                        "code": "2795",
                        "name": "沈丘县"
                    },
                    {
                        "code": "2796",
                        "name": "淮阳县"
                    },
                    {
                        "code": "2797",
                        "name": "西华县"
                    },
                    {
                        "code": "2798",
                        "name": "郸城县"
                    },
                    {
                        "code": "2799",
                        "name": "项城市"
                    },
                    {
                        "code": "2800",
                        "name": "鹿邑县"
                    }
                ]
            },
            {
                "code": "256",
                "name": "驻马店市",
                "sub": [
                    {
                        "code": "2801",
                        "name": "上蔡县"
                    },
                    {
                        "code": "2802",
                        "name": "平舆县"
                    },
                    {
                        "code": "2803",
                        "name": "新蔡县"
                    },
                    {
                        "code": "2804",
                        "name": "正阳县"
                    },
                    {
                        "code": "2805",
                        "name": "汝南县"
                    },
                    {
                        "code": "2806",
                        "name": "泌阳县"
                    },
                    {
                        "code": "2807",
                        "name": "确山县"
                    },
                    {
                        "code": "2808",
                        "name": "西平县"
                    },
                    {
                        "code": "2809",
                        "name": "遂平县"
                    },
                    {
                        "code": "2810",
                        "name": "驿城区"
                    }
                ]
            },
            {
                "code": "257",
                "name": "济源市",
                "sub": [
                    {
                        "code": "2811",
                        "name": "济源市"
                    }
                ]
            }
        ]
    },
    {
        "code": "17",
        "name": "湖北省",
        "sub": [
            {
                "code": "258",
                "name": "武汉市",
                "sub": [
                    {
                        "code": "2812",
                        "name": "东西湖区"
                    },
                    {
                        "code": "2813",
                        "name": "新洲区"
                    },
                    {
                        "code": "2814",
                        "name": "武昌区"
                    },
                    {
                        "code": "2815",
                        "name": "汉南区"
                    },
                    {
                        "code": "2816",
                        "name": "汉阳区"
                    },
                    {
                        "code": "2817",
                        "name": "江夏区"
                    },
                    {
                        "code": "2818",
                        "name": "江岸区"
                    },
                    {
                        "code": "2819",
                        "name": "江汉区"
                    },
                    {
                        "code": "2820",
                        "name": "洪山区"
                    },
                    {
                        "code": "2821",
                        "name": "硚口区"
                    },
                    {
                        "code": "2822",
                        "name": "蔡甸区"
                    },
                    {
                        "code": "2823",
                        "name": "青山区"
                    },
                    {
                        "code": "2824",
                        "name": "黄陂区"
                    }
                ]
            },
            {
                "code": "259",
                "name": "黄石市",
                "sub": [
                    {
                        "code": "2825",
                        "name": "下陆区"
                    },
                    {
                        "code": "2826",
                        "name": "大冶市"
                    },
                    {
                        "code": "2827",
                        "name": "西塞山区"
                    },
                    {
                        "code": "2828",
                        "name": "铁山区"
                    },
                    {
                        "code": "2829",
                        "name": "阳新县"
                    },
                    {
                        "code": "2830",
                        "name": "黄石港区"
                    }
                ]
            },
            {
                "code": "260",
                "name": "十堰市",
                "sub": [
                    {
                        "code": "2831",
                        "name": "丹江口市"
                    },
                    {
                        "code": "2832",
                        "name": "张湾区"
                    },
                    {
                        "code": "2833",
                        "name": "房县"
                    },
                    {
                        "code": "2834",
                        "name": "竹山县"
                    },
                    {
                        "code": "2835",
                        "name": "竹溪县"
                    },
                    {
                        "code": "2836",
                        "name": "茅箭区"
                    },
                    {
                        "code": "2837",
                        "name": "郧县"
                    },
                    {
                        "code": "2838",
                        "name": "郧西县"
                    }
                ]
            },
            {
                "code": "261",
                "name": "宜昌市",
                "sub": [
                    {
                        "code": "2839",
                        "name": "五峰土家族自治县"
                    },
                    {
                        "code": "2840",
                        "name": "伍家岗区"
                    },
                    {
                        "code": "2841",
                        "name": "兴山县"
                    },
                    {
                        "code": "2842",
                        "name": "夷陵区"
                    },
                    {
                        "code": "2843",
                        "name": "宜都市"
                    },
                    {
                        "code": "2844",
                        "name": "当阳市"
                    },
                    {
                        "code": "2845",
                        "name": "枝江市"
                    },
                    {
                        "code": "2846",
                        "name": "点军区"
                    },
                    {
                        "code": "2847",
                        "name": "秭归县"
                    },
                    {
                        "code": "2848",
                        "name": "虢亭区"
                    },
                    {
                        "code": "2849",
                        "name": "西陵区"
                    },
                    {
                        "code": "2850",
                        "name": "远安县"
                    },
                    {
                        "code": "2851",
                        "name": "长阳土家族自治县"
                    }
                ]
            },
            {
                "code": "262",
                "name": "襄樊市",
                "sub": [
                    {
                        "code": "2852",
                        "name": "保康县"
                    },
                    {
                        "code": "2853",
                        "name": "南漳县"
                    },
                    {
                        "code": "2854",
                        "name": "宜城市"
                    },
                    {
                        "code": "2855",
                        "name": "枣阳市"
                    },
                    {
                        "code": "2856",
                        "name": "樊城区"
                    },
                    {
                        "code": "2857",
                        "name": "老河口市"
                    },
                    {
                        "code": "2858",
                        "name": "襄城区"
                    },
                    {
                        "code": "2859",
                        "name": "襄阳区"
                    },
                    {
                        "code": "2860",
                        "name": "谷城县"
                    }
                ]
            },
            {
                "code": "263",
                "name": "鄂州市",
                "sub": [
                    {
                        "code": "2861",
                        "name": "华容区"
                    },
                    {
                        "code": "2862",
                        "name": "粱子湖"
                    },
                    {
                        "code": "2863",
                        "name": "鄂城区"
                    }
                ]
            },
            {
                "code": "264",
                "name": "荆门市",
                "sub": [
                    {
                        "code": "2864",
                        "name": "东宝区"
                    },
                    {
                        "code": "2865",
                        "name": "京山县"
                    },
                    {
                        "code": "2866",
                        "name": "掇刀区"
                    },
                    {
                        "code": "2867",
                        "name": "沙洋县"
                    },
                    {
                        "code": "2868",
                        "name": "钟祥市"
                    }
                ]
            },
            {
                "code": "265",
                "name": "孝感市",
                "sub": [
                    {
                        "code": "2869",
                        "name": "云梦县"
                    },
                    {
                        "code": "2870",
                        "name": "大悟县"
                    },
                    {
                        "code": "2871",
                        "name": "孝南区"
                    },
                    {
                        "code": "2872",
                        "name": "孝昌县"
                    },
                    {
                        "code": "2873",
                        "name": "安陆市"
                    },
                    {
                        "code": "2874",
                        "name": "应城市"
                    },
                    {
                        "code": "2875",
                        "name": "汉川市"
                    }
                ]
            },
            {
                "code": "266",
                "name": "荆州市",
                "sub": [
                    {
                        "code": "2876",
                        "name": "公安县"
                    },
                    {
                        "code": "2877",
                        "name": "松滋市"
                    },
                    {
                        "code": "2878",
                        "name": "江陵县"
                    },
                    {
                        "code": "2879",
                        "name": "沙市区"
                    },
                    {
                        "code": "2880",
                        "name": "洪湖市"
                    },
                    {
                        "code": "2881",
                        "name": "监利县"
                    },
                    {
                        "code": "2882",
                        "name": "石首市"
                    },
                    {
                        "code": "2883",
                        "name": "荆州区"
                    }
                ]
            },
            {
                "code": "267",
                "name": "黄冈市",
                "sub": [
                    {
                        "code": "2884",
                        "name": "团风县"
                    },
                    {
                        "code": "2885",
                        "name": "武穴市"
                    },
                    {
                        "code": "2886",
                        "name": "浠水县"
                    },
                    {
                        "code": "2887",
                        "name": "红安县"
                    },
                    {
                        "code": "2888",
                        "name": "罗田县"
                    },
                    {
                        "code": "2889",
                        "name": "英山县"
                    },
                    {
                        "code": "2890",
                        "name": "蕲春县"
                    },
                    {
                        "code": "2891",
                        "name": "麻城市"
                    },
                    {
                        "code": "2892",
                        "name": "黄州区"
                    },
                    {
                        "code": "2893",
                        "name": "黄梅县"
                    }
                ]
            },
            {
                "code": "268",
                "name": "咸宁市",
                "sub": [
                    {
                        "code": "2894",
                        "name": "咸安区"
                    },
                    {
                        "code": "2895",
                        "name": "嘉鱼县"
                    },
                    {
                        "code": "2896",
                        "name": "崇阳县"
                    },
                    {
                        "code": "2897",
                        "name": "赤壁市"
                    },
                    {
                        "code": "2898",
                        "name": "通城县"
                    },
                    {
                        "code": "2899",
                        "name": "通山县"
                    }
                ]
            },
            {
                "code": "269",
                "name": "随州市",
                "sub": [
                    {
                        "code": "2900",
                        "name": "广水市"
                    },
                    {
                        "code": "2901",
                        "name": "曾都区"
                    }
                ]
            },
            {
                "code": "270",
                "name": "恩施土家族苗族自治州",
                "sub": [
                    {
                        "code": "2902",
                        "name": "利川市"
                    },
                    {
                        "code": "2903",
                        "name": "咸丰县"
                    },
                    {
                        "code": "2904",
                        "name": "宣恩县"
                    },
                    {
                        "code": "2905",
                        "name": "巴东县"
                    },
                    {
                        "code": "2906",
                        "name": "建始县"
                    },
                    {
                        "code": "2907",
                        "name": "恩施市"
                    },
                    {
                        "code": "2908",
                        "name": "来凤县"
                    },
                    {
                        "code": "2909",
                        "name": "鹤峰县"
                    }
                ]
            },
            {
                "code": "271",
                "name": "仙桃市",
                "sub": [
                    {
                        "code": "2910",
                        "name": "仙桃市"
                    }
                ]
            },
            {
                "code": "272",
                "name": "潜江市",
                "sub": [
                    {
                        "code": "2911",
                        "name": "潜江市"
                    }
                ]
            },
            {
                "code": "273",
                "name": "天门市",
                "sub": [
                    {
                        "code": "2912",
                        "name": "天门市"
                    }
                ]
            },
            {
                "code": "274",
                "name": "神农架林区",
                "sub": [
                    {
                        "code": "2913",
                        "name": "神农架林区"
                    }
                ]
            }
        ]
    },
    {
        "code": "18",
        "name": "湖南省",
        "sub": [
            {
                "code": "275",
                "name": "长沙市",
                "sub": [
                    {
                        "code": "2914",
                        "name": "天心区"
                    },
                    {
                        "code": "2915",
                        "name": "宁乡县"
                    },
                    {
                        "code": "2916",
                        "name": "岳麓区"
                    },
                    {
                        "code": "2917",
                        "name": "开福区"
                    },
                    {
                        "code": "2918",
                        "name": "望城县"
                    },
                    {
                        "code": "2919",
                        "name": "浏阳市"
                    },
                    {
                        "code": "2920",
                        "name": "芙蓉区"
                    },
                    {
                        "code": "2921",
                        "name": "长沙县"
                    },
                    {
                        "code": "2922",
                        "name": "雨花区"
                    }
                ]
            },
            {
                "code": "276",
                "name": "株洲市",
                "sub": [
                    {
                        "code": "2923",
                        "name": "天元区"
                    },
                    {
                        "code": "2924",
                        "name": "攸县"
                    },
                    {
                        "code": "2925",
                        "name": "株洲县"
                    },
                    {
                        "code": "2926",
                        "name": "炎陵县"
                    },
                    {
                        "code": "2927",
                        "name": "石峰区"
                    },
                    {
                        "code": "2928",
                        "name": "芦淞区"
                    },
                    {
                        "code": "2929",
                        "name": "茶陵县"
                    },
                    {
                        "code": "2930",
                        "name": "荷塘区"
                    },
                    {
                        "code": "2931",
                        "name": "醴陵市"
                    }
                ]
            },
            {
                "code": "277",
                "name": "湘潭市",
                "sub": [
                    {
                        "code": "2932",
                        "name": "岳塘区"
                    },
                    {
                        "code": "2933",
                        "name": "湘乡市"
                    },
                    {
                        "code": "2934",
                        "name": "湘潭县"
                    },
                    {
                        "code": "2935",
                        "name": "雨湖区"
                    },
                    {
                        "code": "2936",
                        "name": "韶山市"
                    }
                ]
            },
            {
                "code": "278",
                "name": "衡阳市",
                "sub": [
                    {
                        "code": "2937",
                        "name": "南岳区"
                    },
                    {
                        "code": "2938",
                        "name": "常宁市"
                    },
                    {
                        "code": "2939",
                        "name": "珠晖区"
                    },
                    {
                        "code": "2940",
                        "name": "石鼓区"
                    },
                    {
                        "code": "2941",
                        "name": "祁东县"
                    },
                    {
                        "code": "2942",
                        "name": "耒阳市"
                    },
                    {
                        "code": "2943",
                        "name": "蒸湘区"
                    },
                    {
                        "code": "2944",
                        "name": "衡东县"
                    },
                    {
                        "code": "2945",
                        "name": "衡南县"
                    },
                    {
                        "code": "2946",
                        "name": "衡山县"
                    },
                    {
                        "code": "2947",
                        "name": "衡阳县"
                    },
                    {
                        "code": "2948",
                        "name": "雁峰区"
                    }
                ]
            },
            {
                "code": "279",
                "name": "邵阳市",
                "sub": [
                    {
                        "code": "2949",
                        "name": "北塔区"
                    },
                    {
                        "code": "2950",
                        "name": "双清区"
                    },
                    {
                        "code": "2951",
                        "name": "城步苗族自治县"
                    },
                    {
                        "code": "2952",
                        "name": "大祥区"
                    },
                    {
                        "code": "2953",
                        "name": "新宁县"
                    },
                    {
                        "code": "2954",
                        "name": "新邵县"
                    },
                    {
                        "code": "2955",
                        "name": "武冈市"
                    },
                    {
                        "code": "2956",
                        "name": "洞口县"
                    },
                    {
                        "code": "2957",
                        "name": "绥宁县"
                    },
                    {
                        "code": "2958",
                        "name": "邵东县"
                    },
                    {
                        "code": "2959",
                        "name": "邵阳县"
                    },
                    {
                        "code": "2960",
                        "name": "隆回县"
                    }
                ]
            },
            {
                "code": "280",
                "name": "岳阳市",
                "sub": [
                    {
                        "code": "2961",
                        "name": "临湘市"
                    },
                    {
                        "code": "2962",
                        "name": "云溪区"
                    },
                    {
                        "code": "2963",
                        "name": "华容县"
                    },
                    {
                        "code": "2964",
                        "name": "君山区"
                    },
                    {
                        "code": "2965",
                        "name": "岳阳县"
                    },
                    {
                        "code": "2966",
                        "name": "岳阳楼区"
                    },
                    {
                        "code": "2967",
                        "name": "平江县"
                    },
                    {
                        "code": "2968",
                        "name": "汨罗市"
                    },
                    {
                        "code": "2969",
                        "name": "湘阴县"
                    }
                ]
            },
            {
                "code": "281",
                "name": "常德市",
                "sub": [
                    {
                        "code": "2970",
                        "name": "临澧县"
                    },
                    {
                        "code": "2971",
                        "name": "安乡县"
                    },
                    {
                        "code": "2972",
                        "name": "桃源县"
                    },
                    {
                        "code": "2973",
                        "name": "武陵区"
                    },
                    {
                        "code": "2974",
                        "name": "汉寿县"
                    },
                    {
                        "code": "2975",
                        "name": "津市市"
                    },
                    {
                        "code": "2976",
                        "name": "澧县"
                    },
                    {
                        "code": "2977",
                        "name": "石门县"
                    },
                    {
                        "code": "2978",
                        "name": "鼎城区"
                    }
                ]
            },
            {
                "code": "282",
                "name": "张家界市",
                "sub": [
                    {
                        "code": "2979",
                        "name": "慈利县"
                    },
                    {
                        "code": "2980",
                        "name": "桑植县"
                    },
                    {
                        "code": "2981",
                        "name": "武陵源区"
                    },
                    {
                        "code": "2982",
                        "name": "永定区"
                    }
                ]
            },
            {
                "code": "283",
                "name": "益阳市",
                "sub": [
                    {
                        "code": "2983",
                        "name": "南县"
                    },
                    {
                        "code": "2984",
                        "name": "安化县"
                    },
                    {
                        "code": "2985",
                        "name": "桃江县"
                    },
                    {
                        "code": "2986",
                        "name": "沅江市"
                    },
                    {
                        "code": "2987",
                        "name": "资阳区"
                    },
                    {
                        "code": "2988",
                        "name": "赫山区"
                    }
                ]
            },
            {
                "code": "284",
                "name": "郴州市",
                "sub": [
                    {
                        "code": "2989",
                        "name": "临武县"
                    },
                    {
                        "code": "2990",
                        "name": "北湖区"
                    },
                    {
                        "code": "2991",
                        "name": "嘉禾县"
                    },
                    {
                        "code": "2992",
                        "name": "安仁县"
                    },
                    {
                        "code": "2993",
                        "name": "宜章县"
                    },
                    {
                        "code": "2994",
                        "name": "桂东县"
                    },
                    {
                        "code": "2995",
                        "name": "桂阳县"
                    },
                    {
                        "code": "2996",
                        "name": "永兴县"
                    },
                    {
                        "code": "2997",
                        "name": "汝城县"
                    },
                    {
                        "code": "2998",
                        "name": "苏仙区"
                    },
                    {
                        "code": "2999",
                        "name": "资兴市"
                    }
                ]
            },
            {
                "code": "285",
                "name": "永州市",
                "sub": [
                    {
                        "code": "3000",
                        "name": "东安县"
                    },
                    {
                        "code": "3001",
                        "name": "冷水滩区"
                    },
                    {
                        "code": "3002",
                        "name": "双牌县"
                    },
                    {
                        "code": "3003",
                        "name": "宁远县"
                    },
                    {
                        "code": "3004",
                        "name": "新田县"
                    },
                    {
                        "code": "3005",
                        "name": "江华瑶族自治县"
                    },
                    {
                        "code": "3006",
                        "name": "江永县"
                    },
                    {
                        "code": "3007",
                        "name": "祁阳县"
                    },
                    {
                        "code": "3008",
                        "name": "蓝山县"
                    },
                    {
                        "code": "3009",
                        "name": "道县"
                    },
                    {
                        "code": "3010",
                        "name": "零陵区"
                    }
                ]
            },
            {
                "code": "286",
                "name": "怀化市",
                "sub": [
                    {
                        "code": "3011",
                        "name": "中方县"
                    },
                    {
                        "code": "3012",
                        "name": "会同县"
                    },
                    {
                        "code": "3013",
                        "name": "新晃侗族自治县"
                    },
                    {
                        "code": "3014",
                        "name": "沅陵县"
                    },
                    {
                        "code": "3015",
                        "name": "洪江市/洪江区"
                    },
                    {
                        "code": "3016",
                        "name": "溆浦县"
                    },
                    {
                        "code": "3017",
                        "name": "芷江侗族自治县"
                    },
                    {
                        "code": "3018",
                        "name": "辰溪县"
                    },
                    {
                        "code": "3019",
                        "name": "通道侗族自治县"
                    },
                    {
                        "code": "3020",
                        "name": "靖州苗族侗族自治县"
                    },
                    {
                        "code": "3021",
                        "name": "鹤城区"
                    },
                    {
                        "code": "3022",
                        "name": "麻阳苗族自治县"
                    }
                ]
            },
            {
                "code": "287",
                "name": "娄底市",
                "sub": [
                    {
                        "code": "3023",
                        "name": "冷水江市"
                    },
                    {
                        "code": "3024",
                        "name": "双峰县"
                    },
                    {
                        "code": "3025",
                        "name": "娄星区"
                    },
                    {
                        "code": "3026",
                        "name": "新化县"
                    },
                    {
                        "code": "3027",
                        "name": "涟源市"
                    }
                ]
            },
            {
                "code": "288",
                "name": "湘西土家族苗族自治州",
                "sub": [
                    {
                        "code": "3028",
                        "name": "保靖县"
                    },
                    {
                        "code": "3029",
                        "name": "凤凰县"
                    },
                    {
                        "code": "3030",
                        "name": "古丈县"
                    },
                    {
                        "code": "3031",
                        "name": "吉首市"
                    },
                    {
                        "code": "3032",
                        "name": "永顺县"
                    },
                    {
                        "code": "3033",
                        "name": "泸溪县"
                    },
                    {
                        "code": "3034",
                        "name": "花垣县"
                    },
                    {
                        "code": "3035",
                        "name": "龙山县"
                    }
                ]
            }
        ]
    },
    {
        "code": "19",
        "name": "广东省",
        "sub": [
            {
                "code": "289",
                "name": "广州市",
                "sub": [
                    {
                        "code": "3036",
                        "name": "萝岗区"
                    },
                    {
                        "code": "3037",
                        "name": "南沙区"
                    },
                    {
                        "code": "3038",
                        "name": "从化市"
                    },
                    {
                        "code": "3039",
                        "name": "增城市"
                    },
                    {
                        "code": "3040",
                        "name": "天河区"
                    },
                    {
                        "code": "3041",
                        "name": "海珠区"
                    },
                    {
                        "code": "3042",
                        "name": "番禺区"
                    },
                    {
                        "code": "3043",
                        "name": "白云区"
                    },
                    {
                        "code": "3044",
                        "name": "花都区"
                    },
                    {
                        "code": "3045",
                        "name": "荔湾区"
                    },
                    {
                        "code": "3046",
                        "name": "越秀区"
                    },
                    {
                        "code": "3047",
                        "name": "黄埔区"
                    }
                ]
            },
            {
                "code": "290",
                "name": "韶关市",
                "sub": [
                    {
                        "code": "3048",
                        "name": "乐昌市"
                    },
                    {
                        "code": "3049",
                        "name": "乳源瑶族自治县"
                    },
                    {
                        "code": "3050",
                        "name": "仁化县"
                    },
                    {
                        "code": "3051",
                        "name": "南雄市"
                    },
                    {
                        "code": "3052",
                        "name": "始兴县"
                    },
                    {
                        "code": "3053",
                        "name": "新丰县"
                    },
                    {
                        "code": "3054",
                        "name": "曲江区"
                    },
                    {
                        "code": "3055",
                        "name": "武江区"
                    },
                    {
                        "code": "3056",
                        "name": "浈江区"
                    },
                    {
                        "code": "3057",
                        "name": "翁源县"
                    }
                ]
            },
            {
                "code": "291",
                "name": "深圳市",
                "sub": [
                    {
                        "code": "3058",
                        "name": "南山区"
                    },
                    {
                        "code": "3059",
                        "name": "宝安区"
                    },
                    {
                        "code": "3060",
                        "name": "盐田区"
                    },
                    {
                        "code": "3061",
                        "name": "福田区"
                    },
                    {
                        "code": "3062",
                        "name": "罗湖区"
                    },
                    {
                        "code": "3063",
                        "name": "龙岗区"
                    }
                ]
            },
            {
                "code": "292",
                "name": "珠海市",
                "sub": [
                    {
                        "code": "3064",
                        "name": "斗门区"
                    },
                    {
                        "code": "3065",
                        "name": "金湾区"
                    },
                    {
                        "code": "3066",
                        "name": "香洲区"
                    }
                ]
            },
            {
                "code": "293",
                "name": "汕头市",
                "sub": [
                    {
                        "code": "3067",
                        "name": "南澳县"
                    },
                    {
                        "code": "3068",
                        "name": "潮南区"
                    },
                    {
                        "code": "3069",
                        "name": "潮阳区"
                    },
                    {
                        "code": "3070",
                        "name": "澄海区"
                    },
                    {
                        "code": "3071",
                        "name": "濠江区"
                    },
                    {
                        "code": "3072",
                        "name": "金平区"
                    },
                    {
                        "code": "3073",
                        "name": "龙湖区"
                    }
                ]
            },
            {
                "code": "294",
                "name": "佛山市",
                "sub": [
                    {
                        "code": "3074",
                        "name": "三水区"
                    },
                    {
                        "code": "3075",
                        "name": "南海区"
                    },
                    {
                        "code": "3076",
                        "name": "禅城区"
                    },
                    {
                        "code": "3077",
                        "name": "顺德区"
                    },
                    {
                        "code": "3078",
                        "name": "高明区"
                    }
                ]
            },
            {
                "code": "295",
                "name": "江门市",
                "sub": [
                    {
                        "code": "3079",
                        "name": "台山市"
                    },
                    {
                        "code": "3080",
                        "name": "开平市"
                    },
                    {
                        "code": "3081",
                        "name": "恩平市"
                    },
                    {
                        "code": "3082",
                        "name": "新会区"
                    },
                    {
                        "code": "3083",
                        "name": "江海区"
                    },
                    {
                        "code": "3084",
                        "name": "蓬江区"
                    },
                    {
                        "code": "3085",
                        "name": "鹤山市"
                    }
                ]
            },
            {
                "code": "296",
                "name": "湛江市",
                "sub": [
                    {
                        "code": "3086",
                        "name": "吴川市"
                    },
                    {
                        "code": "3087",
                        "name": "坡头区"
                    },
                    {
                        "code": "3088",
                        "name": "廉江市"
                    },
                    {
                        "code": "3089",
                        "name": "徐闻县"
                    },
                    {
                        "code": "3090",
                        "name": "赤坎区"
                    },
                    {
                        "code": "3091",
                        "name": "遂溪县"
                    },
                    {
                        "code": "3092",
                        "name": "雷州市"
                    },
                    {
                        "code": "3093",
                        "name": "霞山区"
                    },
                    {
                        "code": "3094",
                        "name": "麻章区"
                    }
                ]
            },
            {
                "code": "297",
                "name": "茂名市",
                "sub": [
                    {
                        "code": "3095",
                        "name": "信宜市"
                    },
                    {
                        "code": "3096",
                        "name": "化州市"
                    },
                    {
                        "code": "3097",
                        "name": "电白县"
                    },
                    {
                        "code": "3098",
                        "name": "茂南区"
                    },
                    {
                        "code": "3099",
                        "name": "茂港区"
                    },
                    {
                        "code": "3100",
                        "name": "高州市"
                    }
                ]
            },
            {
                "code": "298",
                "name": "肇庆市",
                "sub": [
                    {
                        "code": "3101",
                        "name": "四会市"
                    },
                    {
                        "code": "3102",
                        "name": "封开县"
                    },
                    {
                        "code": "3103",
                        "name": "广宁县"
                    },
                    {
                        "code": "3104",
                        "name": "德庆县"
                    },
                    {
                        "code": "3105",
                        "name": "怀集县"
                    },
                    {
                        "code": "3106",
                        "name": "端州区"
                    },
                    {
                        "code": "3107",
                        "name": "高要市"
                    },
                    {
                        "code": "3108",
                        "name": "鼎湖区"
                    }
                ]
            },
            {
                "code": "299",
                "name": "惠州市",
                "sub": [
                    {
                        "code": "3109",
                        "name": "博罗县"
                    },
                    {
                        "code": "3110",
                        "name": "惠东县"
                    },
                    {
                        "code": "3111",
                        "name": "惠城区"
                    },
                    {
                        "code": "3112",
                        "name": "惠阳区"
                    },
                    {
                        "code": "3113",
                        "name": "龙门县"
                    }
                ]
            },
            {
                "code": "300",
                "name": "梅州市",
                "sub": [
                    {
                        "code": "3114",
                        "name": "丰顺县"
                    },
                    {
                        "code": "3115",
                        "name": "五华县"
                    },
                    {
                        "code": "3116",
                        "name": "兴宁市"
                    },
                    {
                        "code": "3117",
                        "name": "大埔县"
                    },
                    {
                        "code": "3118",
                        "name": "平远县"
                    },
                    {
                        "code": "3119",
                        "name": "梅县"
                    },
                    {
                        "code": "3120",
                        "name": "梅江区"
                    },
                    {
                        "code": "3121",
                        "name": "蕉岭县"
                    }
                ]
            },
            {
                "code": "301",
                "name": "汕尾市",
                "sub": [
                    {
                        "code": "3122",
                        "name": "城区"
                    },
                    {
                        "code": "3123",
                        "name": "海丰县"
                    },
                    {
                        "code": "3124",
                        "name": "陆丰市"
                    },
                    {
                        "code": "3125",
                        "name": "陆河县"
                    }
                ]
            },
            {
                "code": "302",
                "name": "河源市",
                "sub": [
                    {
                        "code": "3126",
                        "name": "东源县"
                    },
                    {
                        "code": "3127",
                        "name": "和平县"
                    },
                    {
                        "code": "3128",
                        "name": "源城区"
                    },
                    {
                        "code": "3129",
                        "name": "紫金县"
                    },
                    {
                        "code": "3130",
                        "name": "连平县"
                    },
                    {
                        "code": "3131",
                        "name": "龙川县"
                    }
                ]
            },
            {
                "code": "303",
                "name": "阳江市",
                "sub": [
                    {
                        "code": "3132",
                        "name": "江城区"
                    },
                    {
                        "code": "3133",
                        "name": "阳东县"
                    },
                    {
                        "code": "3134",
                        "name": "阳春市"
                    },
                    {
                        "code": "3135",
                        "name": "阳西县"
                    }
                ]
            },
            {
                "code": "304",
                "name": "清远市",
                "sub": [
                    {
                        "code": "3136",
                        "name": "佛冈县"
                    },
                    {
                        "code": "3137",
                        "name": "清城区"
                    },
                    {
                        "code": "3138",
                        "name": "清新县"
                    },
                    {
                        "code": "3139",
                        "name": "英德市"
                    },
                    {
                        "code": "3140",
                        "name": "连南瑶族自治县"
                    },
                    {
                        "code": "3141",
                        "name": "连山壮族瑶族自治县"
                    },
                    {
                        "code": "3142",
                        "name": "连州市"
                    },
                    {
                        "code": "3143",
                        "name": "阳山县"
                    }
                ]
            },
            {
                "code": "305",
                "name": "东莞市",
                "sub": [
                    {
                        "code": "3144",
                        "name": "东莞市"
                    }
                ]
            },
            {
                "code": "306",
                "name": "中山市",
                "sub": [
                    {
                        "code": "3145",
                        "name": "中山市"
                    }
                ]
            },
            {
                "code": "307",
                "name": "潮州市",
                "sub": [
                    {
                        "code": "3146",
                        "name": "湘桥区"
                    },
                    {
                        "code": "3147",
                        "name": "潮安县"
                    },
                    {
                        "code": "3148",
                        "name": "饶平县"
                    }
                ]
            },
            {
                "code": "308",
                "name": "揭阳市",
                "sub": [
                    {
                        "code": "3149",
                        "name": "惠来县"
                    },
                    {
                        "code": "3150",
                        "name": "揭东县"
                    },
                    {
                        "code": "3151",
                        "name": "揭西县"
                    },
                    {
                        "code": "3152",
                        "name": "普宁市"
                    },
                    {
                        "code": "3153",
                        "name": "榕城区"
                    }
                ]
            },
            {
                "code": "309",
                "name": "云浮市",
                "sub": [
                    {
                        "code": "3154",
                        "name": "云城区"
                    },
                    {
                        "code": "3155",
                        "name": "云安县"
                    },
                    {
                        "code": "3156",
                        "name": "新兴县"
                    },
                    {
                        "code": "3157",
                        "name": "罗定市"
                    },
                    {
                        "code": "3158",
                        "name": "郁南县"
                    }
                ]
            }
        ]
    },
    {
        "code": "20",
        "name": "广西壮族自治区",
        "sub": [
            {
                "code": "310",
                "name": "南宁市",
                "sub": [
                    {
                        "code": "3159",
                        "name": "上林县"
                    },
                    {
                        "code": "3160",
                        "name": "兴宁区"
                    },
                    {
                        "code": "3161",
                        "name": "宾阳县"
                    },
                    {
                        "code": "3162",
                        "name": "横县"
                    },
                    {
                        "code": "3163",
                        "name": "武鸣县"
                    },
                    {
                        "code": "3164",
                        "name": "江南区"
                    },
                    {
                        "code": "3165",
                        "name": "良庆区"
                    },
                    {
                        "code": "3166",
                        "name": "西乡塘区"
                    },
                    {
                        "code": "3167",
                        "name": "邕宁区"
                    },
                    {
                        "code": "3168",
                        "name": "隆安县"
                    },
                    {
                        "code": "3169",
                        "name": "青秀区"
                    },
                    {
                        "code": "3170",
                        "name": "马山县"
                    }
                ]
            },
            {
                "code": "311",
                "name": "柳州市",
                "sub": [
                    {
                        "code": "3171",
                        "name": "三江侗族自治县"
                    },
                    {
                        "code": "3172",
                        "name": "城中区"
                    },
                    {
                        "code": "3173",
                        "name": "柳北区"
                    },
                    {
                        "code": "3174",
                        "name": "柳南区"
                    },
                    {
                        "code": "3175",
                        "name": "柳城县"
                    },
                    {
                        "code": "3176",
                        "name": "柳江县"
                    },
                    {
                        "code": "3177",
                        "name": "融安县"
                    },
                    {
                        "code": "3178",
                        "name": "融水苗族自治县"
                    },
                    {
                        "code": "3179",
                        "name": "鱼峰区"
                    },
                    {
                        "code": "3180",
                        "name": "鹿寨县"
                    }
                ]
            },
            {
                "code": "312",
                "name": "桂林市",
                "sub": [
                    {
                        "code": "3181",
                        "name": "七星区"
                    },
                    {
                        "code": "3182",
                        "name": "临桂县"
                    },
                    {
                        "code": "3183",
                        "name": "全州县"
                    },
                    {
                        "code": "3184",
                        "name": "兴安县"
                    },
                    {
                        "code": "3185",
                        "name": "叠彩区"
                    },
                    {
                        "code": "3186",
                        "name": "平乐县"
                    },
                    {
                        "code": "3187",
                        "name": "恭城瑶族自治县"
                    },
                    {
                        "code": "3188",
                        "name": "永福县"
                    },
                    {
                        "code": "3189",
                        "name": "灌阳县"
                    },
                    {
                        "code": "3190",
                        "name": "灵川县"
                    },
                    {
                        "code": "3191",
                        "name": "秀峰区"
                    },
                    {
                        "code": "3192",
                        "name": "荔浦县"
                    },
                    {
                        "code": "3193",
                        "name": "象山区"
                    },
                    {
                        "code": "3194",
                        "name": "资源县"
                    },
                    {
                        "code": "3195",
                        "name": "阳朔县"
                    },
                    {
                        "code": "3196",
                        "name": "雁山区"
                    },
                    {
                        "code": "3197",
                        "name": "龙胜各族自治县"
                    }
                ]
            },
            {
                "code": "313",
                "name": "梧州市",
                "sub": [
                    {
                        "code": "3198",
                        "name": "万秀区"
                    },
                    {
                        "code": "3199",
                        "name": "岑溪市"
                    },
                    {
                        "code": "3200",
                        "name": "苍梧县"
                    },
                    {
                        "code": "3201",
                        "name": "蒙山县"
                    },
                    {
                        "code": "3202",
                        "name": "藤县"
                    },
                    {
                        "code": "3203",
                        "name": "蝶山区"
                    },
                    {
                        "code": "3204",
                        "name": "长洲区"
                    }
                ]
            },
            {
                "code": "314",
                "name": "北海市",
                "sub": [
                    {
                        "code": "3205",
                        "name": "合浦县"
                    },
                    {
                        "code": "3206",
                        "name": "海城区"
                    },
                    {
                        "code": "3207",
                        "name": "铁山港区"
                    },
                    {
                        "code": "3208",
                        "name": "银海区"
                    }
                ]
            },
            {
                "code": "315",
                "name": "防城港市",
                "sub": [
                    {
                        "code": "3209",
                        "name": "上思县"
                    },
                    {
                        "code": "3210",
                        "name": "东兴市"
                    },
                    {
                        "code": "3211",
                        "name": "港口区"
                    },
                    {
                        "code": "3212",
                        "name": "防城区"
                    }
                ]
            },
            {
                "code": "316",
                "name": "钦州市",
                "sub": [
                    {
                        "code": "3213",
                        "name": "浦北县"
                    },
                    {
                        "code": "3214",
                        "name": "灵山县"
                    },
                    {
                        "code": "3215",
                        "name": "钦北区"
                    },
                    {
                        "code": "3216",
                        "name": "钦南区"
                    }
                ]
            },
            {
                "code": "317",
                "name": "贵港市",
                "sub": [
                    {
                        "code": "3217",
                        "name": "平南县"
                    },
                    {
                        "code": "3218",
                        "name": "桂平市"
                    },
                    {
                        "code": "3219",
                        "name": "港北区"
                    },
                    {
                        "code": "3220",
                        "name": "港南区"
                    },
                    {
                        "code": "3221",
                        "name": "覃塘区"
                    }
                ]
            },
            {
                "code": "318",
                "name": "玉林市",
                "sub": [
                    {
                        "code": "3222",
                        "name": "兴业县"
                    },
                    {
                        "code": "3223",
                        "name": "北流市"
                    },
                    {
                        "code": "3224",
                        "name": "博白县"
                    },
                    {
                        "code": "3225",
                        "name": "容县"
                    },
                    {
                        "code": "3226",
                        "name": "玉州区"
                    },
                    {
                        "code": "3227",
                        "name": "陆川县"
                    }
                ]
            },
            {
                "code": "319",
                "name": "百色市",
                "sub": [
                    {
                        "code": "3228",
                        "name": "乐业县"
                    },
                    {
                        "code": "3229",
                        "name": "凌云县"
                    },
                    {
                        "code": "3230",
                        "name": "右江区"
                    },
                    {
                        "code": "3231",
                        "name": "平果县"
                    },
                    {
                        "code": "3232",
                        "name": "德保县"
                    },
                    {
                        "code": "3233",
                        "name": "田东县"
                    },
                    {
                        "code": "3234",
                        "name": "田林县"
                    },
                    {
                        "code": "3235",
                        "name": "田阳县"
                    },
                    {
                        "code": "3236",
                        "name": "西林县"
                    },
                    {
                        "code": "3237",
                        "name": "那坡县"
                    },
                    {
                        "code": "3238",
                        "name": "隆林各族自治县"
                    },
                    {
                        "code": "3239",
                        "name": "靖西县"
                    }
                ]
            },
            {
                "code": "320",
                "name": "贺州市",
                "sub": [
                    {
                        "code": "3240",
                        "name": "八步区"
                    },
                    {
                        "code": "3241",
                        "name": "富川瑶族自治县"
                    },
                    {
                        "code": "3242",
                        "name": "昭平县"
                    },
                    {
                        "code": "3243",
                        "name": "钟山县"
                    }
                ]
            },
            {
                "code": "321",
                "name": "河池市",
                "sub": [
                    {
                        "code": "3244",
                        "name": "东兰县"
                    },
                    {
                        "code": "3245",
                        "name": "凤山县"
                    },
                    {
                        "code": "3246",
                        "name": "南丹县"
                    },
                    {
                        "code": "3247",
                        "name": "大化瑶族自治县"
                    },
                    {
                        "code": "3248",
                        "name": "天峨县"
                    },
                    {
                        "code": "3249",
                        "name": "宜州市"
                    },
                    {
                        "code": "3250",
                        "name": "巴马瑶族自治县"
                    },
                    {
                        "code": "3251",
                        "name": "环江毛南族自治县"
                    },
                    {
                        "code": "3252",
                        "name": "罗城仫佬族自治县"
                    },
                    {
                        "code": "3253",
                        "name": "都安瑶族自治县"
                    },
                    {
                        "code": "3254",
                        "name": "金城江区"
                    }
                ]
            },
            {
                "code": "322",
                "name": "来宾市",
                "sub": [
                    {
                        "code": "3255",
                        "name": "兴宾区"
                    },
                    {
                        "code": "3256",
                        "name": "合山市"
                    },
                    {
                        "code": "3257",
                        "name": "忻城县"
                    },
                    {
                        "code": "3258",
                        "name": "武宣县"
                    },
                    {
                        "code": "3259",
                        "name": "象州县"
                    },
                    {
                        "code": "3260",
                        "name": "金秀瑶族自治县"
                    }
                ]
            },
            {
                "code": "323",
                "name": "崇左市",
                "sub": [
                    {
                        "code": "3261",
                        "name": "凭祥市"
                    },
                    {
                        "code": "3262",
                        "name": "大新县"
                    },
                    {
                        "code": "3263",
                        "name": "天等县"
                    },
                    {
                        "code": "3264",
                        "name": "宁明县"
                    },
                    {
                        "code": "3265",
                        "name": "扶绥县"
                    },
                    {
                        "code": "3266",
                        "name": "江州区"
                    },
                    {
                        "code": "3267",
                        "name": "龙州县"
                    }
                ]
            }
        ]
    },
    {
        "code": "21",
        "name": "海南省",
        "sub": [
            {
                "code": "324",
                "name": "海口市",
                "sub": [
                    {
                        "code": "3268",
                        "name": "琼山区"
                    },
                    {
                        "code": "3269",
                        "name": "秀英区"
                    },
                    {
                        "code": "3270",
                        "name": "美兰区"
                    },
                    {
                        "code": "3271",
                        "name": "龙华区"
                    }
                ]
            },
            {
                "code": "325",
                "name": "三亚市",
                "sub": [
                    {
                        "code": "3272",
                        "name": "三亚市"
                    }
                ]
            },
            {
                "code": "326",
                "name": "五指山市",
                "sub": [
                    {
                        "code": "3273",
                        "name": "五指山市"
                    }
                ]
            },
            {
                "code": "327",
                "name": "琼海市",
                "sub": [
                    {
                        "code": "3274",
                        "name": "琼海市"
                    }
                ]
            },
            {
                "code": "328",
                "name": "儋州市",
                "sub": [
                    {
                        "code": "3275",
                        "name": "儋州市"
                    }
                ]
            },
            {
                "code": "329",
                "name": "文昌市",
                "sub": [
                    {
                        "code": "3276",
                        "name": "文昌市"
                    }
                ]
            },
            {
                "code": "330",
                "name": "万宁市",
                "sub": [
                    {
                        "code": "3277",
                        "name": "万宁市"
                    }
                ]
            },
            {
                "code": "331",
                "name": "东方市",
                "sub": [
                    {
                        "code": "3278",
                        "name": "东方市"
                    }
                ]
            },
            {
                "code": "332",
                "name": "定安县",
                "sub": [
                    {
                        "code": "3279",
                        "name": "定安县"
                    }
                ]
            },
            {
                "code": "333",
                "name": "屯昌县",
                "sub": [
                    {
                        "code": "3280",
                        "name": "屯昌县"
                    }
                ]
            },
            {
                "code": "334",
                "name": "澄迈县",
                "sub": [
                    {
                        "code": "3281",
                        "name": "澄迈县"
                    }
                ]
            },
            {
                "code": "335",
                "name": "临高县",
                "sub": [
                    {
                        "code": "3282",
                        "name": "临高县"
                    }
                ]
            },
            {
                "code": "336",
                "name": "白沙黎族自治县",
                "sub": [
                    {
                        "code": "3283",
                        "name": "白沙黎族自治县"
                    }
                ]
            },
            {
                "code": "337",
                "name": "昌江黎族自治县",
                "sub": [
                    {
                        "code": "3284",
                        "name": "昌江黎族自治县"
                    }
                ]
            },
            {
                "code": "338",
                "name": "乐东黎族自治县",
                "sub": [
                    {
                        "code": "3285",
                        "name": "乐东黎族自治县"
                    }
                ]
            },
            {
                "code": "339",
                "name": "陵水黎族自治县",
                "sub": [
                    {
                        "code": "3286",
                        "name": "陵水黎族自治县"
                    }
                ]
            },
            {
                "code": "340",
                "name": "保亭黎族苗族自治县",
                "sub": [
                    {
                        "code": "3287",
                        "name": "保亭黎族苗族自治县"
                    }
                ]
            },
            {
                "code": "341",
                "name": "琼中黎族苗族自治县",
                "sub": [
                    {
                        "code": "3288",
                        "name": "琼中黎族苗族自治县"
                    }
                ]
            },
            {
                "code": "342",
                "name": "西沙群岛",
                "sub": []
            },
            {
                "code": "343",
                "name": "南沙群岛",
                "sub": []
            },
            {
                "code": "344",
                "name": "中沙群岛的岛礁及其海域",
                "sub": []
            }
        ]
    },
    {
        "code": "22",
        "name": "重庆市",
        "sub": [
            {
                "code": "45055",
                "name": "重庆市",
                "sub": [
                    {
                        "code": "345",
                        "name": "万州区"
                    },
                    {
                        "code": "346",
                        "name": "涪陵区"
                    },
                    {
                        "code": "347",
                        "name": "渝中区"
                    },
                    {
                        "code": "348",
                        "name": "大渡口区"
                    },
                    {
                        "code": "349",
                        "name": "江北区"
                    },
                    {
                        "code": "350",
                        "name": "沙坪坝区"
                    },
                    {
                        "code": "351",
                        "name": "九龙坡区"
                    },
                    {
                        "code": "352",
                        "name": "南岸区"
                    },
                    {
                        "code": "353",
                        "name": "北碚区"
                    },
                    {
                        "code": "354",
                        "name": "双桥区"
                    },
                    {
                        "code": "355",
                        "name": "万盛区"
                    },
                    {
                        "code": "356",
                        "name": "渝北区"
                    },
                    {
                        "code": "357",
                        "name": "巴南区"
                    },
                    {
                        "code": "358",
                        "name": "黔江区"
                    },
                    {
                        "code": "359",
                        "name": "长寿区"
                    },
                    {
                        "code": "360",
                        "name": "綦江县"
                    },
                    {
                        "code": "361",
                        "name": "潼南县"
                    },
                    {
                        "code": "362",
                        "name": "铜梁县"
                    },
                    {
                        "code": "363",
                        "name": "大足县"
                    },
                    {
                        "code": "364",
                        "name": "荣昌县"
                    },
                    {
                        "code": "365",
                        "name": "璧山县"
                    },
                    {
                        "code": "366",
                        "name": "梁平县"
                    },
                    {
                        "code": "367",
                        "name": "城口县"
                    },
                    {
                        "code": "368",
                        "name": "丰都县"
                    },
                    {
                        "code": "369",
                        "name": "垫江县"
                    },
                    {
                        "code": "370",
                        "name": "武隆县"
                    },
                    {
                        "code": "371",
                        "name": "忠县"
                    },
                    {
                        "code": "372",
                        "name": "开县"
                    },
                    {
                        "code": "373",
                        "name": "云阳县"
                    },
                    {
                        "code": "374",
                        "name": "奉节县"
                    },
                    {
                        "code": "375",
                        "name": "巫山县"
                    },
                    {
                        "code": "376",
                        "name": "巫溪县"
                    },
                    {
                        "code": "377",
                        "name": "石柱土家族自治县"
                    },
                    {
                        "code": "378",
                        "name": "秀山土家族苗族自治县"
                    },
                    {
                        "code": "379",
                        "name": "酉阳土家族苗族自治县"
                    },
                    {
                        "code": "380",
                        "name": "彭水苗族土家族自治县"
                    },
                    {
                        "code": "381",
                        "name": "江津区"
                    },
                    {
                        "code": "382",
                        "name": "合川区"
                    },
                    {
                        "code": "383",
                        "name": "永川区"
                    },
                    {
                        "code": "384",
                        "name": "南川区"
                    }
                ]
            }
        ]
    },
    {
        "code": "23",
        "name": "四川省",
        "sub": [
            {
                "code": "385",
                "name": "成都市",
                "sub": [
                    {
                        "code": "4209",
                        "name": "双流县"
                    },
                    {
                        "code": "4210",
                        "name": "大邑县"
                    },
                    {
                        "code": "4211",
                        "name": "崇州市"
                    },
                    {
                        "code": "4212",
                        "name": "彭州市"
                    },
                    {
                        "code": "4213",
                        "name": "成华区"
                    },
                    {
                        "code": "4214",
                        "name": "新津县"
                    },
                    {
                        "code": "4215",
                        "name": "新都区"
                    },
                    {
                        "code": "4216",
                        "name": "武侯区"
                    },
                    {
                        "code": "4217",
                        "name": "温江区"
                    },
                    {
                        "code": "4218",
                        "name": "蒲江县"
                    },
                    {
                        "code": "4219",
                        "name": "邛崃市"
                    },
                    {
                        "code": "4220",
                        "name": "郫县"
                    },
                    {
                        "code": "4221",
                        "name": "都江堰市"
                    },
                    {
                        "code": "4222",
                        "name": "金堂县"
                    },
                    {
                        "code": "4223",
                        "name": "金牛区"
                    },
                    {
                        "code": "4224",
                        "name": "锦江区"
                    },
                    {
                        "code": "4225",
                        "name": "青白江区"
                    },
                    {
                        "code": "4226",
                        "name": "青羊区"
                    },
                    {
                        "code": "4227",
                        "name": "龙泉驿区"
                    }
                ]
            },
            {
                "code": "386",
                "name": "自贡市",
                "sub": [
                    {
                        "code": "4228",
                        "name": "大安区"
                    },
                    {
                        "code": "4229",
                        "name": "富顺县"
                    },
                    {
                        "code": "4230",
                        "name": "沿滩区"
                    },
                    {
                        "code": "4231",
                        "name": "自流井区"
                    },
                    {
                        "code": "4232",
                        "name": "荣县"
                    },
                    {
                        "code": "4233",
                        "name": "贡井区"
                    }
                ]
            },
            {
                "code": "387",
                "name": "攀枝花市",
                "sub": [
                    {
                        "code": "4234",
                        "name": "东区"
                    },
                    {
                        "code": "4235",
                        "name": "仁和区"
                    },
                    {
                        "code": "4236",
                        "name": "盐边县"
                    },
                    {
                        "code": "4237",
                        "name": "米易县"
                    },
                    {
                        "code": "4238",
                        "name": "西区"
                    }
                ]
            },
            {
                "code": "388",
                "name": "泸州市",
                "sub": [
                    {
                        "code": "4239",
                        "name": "叙永县"
                    },
                    {
                        "code": "4240",
                        "name": "古蔺县"
                    },
                    {
                        "code": "4241",
                        "name": "合江县"
                    },
                    {
                        "code": "4242",
                        "name": "江阳区"
                    },
                    {
                        "code": "4243",
                        "name": "泸县"
                    },
                    {
                        "code": "4244",
                        "name": "纳溪区"
                    },
                    {
                        "code": "4245",
                        "name": "龙马潭区"
                    }
                ]
            },
            {
                "code": "389",
                "name": "德阳市",
                "sub": [
                    {
                        "code": "4246",
                        "name": "中江县"
                    },
                    {
                        "code": "4247",
                        "name": "什邡市"
                    },
                    {
                        "code": "4248",
                        "name": "广汉市"
                    },
                    {
                        "code": "4249",
                        "name": "旌阳区"
                    },
                    {
                        "code": "4250",
                        "name": "绵竹市"
                    },
                    {
                        "code": "4251",
                        "name": "罗江县"
                    }
                ]
            },
            {
                "code": "390",
                "name": "绵阳市",
                "sub": [
                    {
                        "code": "4252",
                        "name": "三台县"
                    },
                    {
                        "code": "4253",
                        "name": "北川羌族自治县"
                    },
                    {
                        "code": "4254",
                        "name": "安县"
                    },
                    {
                        "code": "4255",
                        "name": "平武县"
                    },
                    {
                        "code": "4256",
                        "name": "梓潼县"
                    },
                    {
                        "code": "4257",
                        "name": "江油市"
                    },
                    {
                        "code": "4258",
                        "name": "涪城区"
                    },
                    {
                        "code": "4259",
                        "name": "游仙区"
                    },
                    {
                        "code": "4260",
                        "name": "盐亭县"
                    }
                ]
            },
            {
                "code": "391",
                "name": "广元市",
                "sub": [
                    {
                        "code": "4261",
                        "name": "元坝区"
                    },
                    {
                        "code": "4262",
                        "name": "利州区"
                    },
                    {
                        "code": "4263",
                        "name": "剑阁县"
                    },
                    {
                        "code": "4264",
                        "name": "旺苍县"
                    },
                    {
                        "code": "4265",
                        "name": "朝天区"
                    },
                    {
                        "code": "4266",
                        "name": "苍溪县"
                    },
                    {
                        "code": "4267",
                        "name": "青川县"
                    }
                ]
            },
            {
                "code": "392",
                "name": "遂宁市",
                "sub": [
                    {
                        "code": "4268",
                        "name": "大英县"
                    },
                    {
                        "code": "4269",
                        "name": "安居区"
                    },
                    {
                        "code": "4270",
                        "name": "射洪县"
                    },
                    {
                        "code": "4271",
                        "name": "船山区"
                    },
                    {
                        "code": "4272",
                        "name": "蓬溪县"
                    }
                ]
            },
            {
                "code": "393",
                "name": "内江市",
                "sub": [
                    {
                        "code": "4273",
                        "name": "东兴区"
                    },
                    {
                        "code": "4274",
                        "name": "威远县"
                    },
                    {
                        "code": "4275",
                        "name": "市中区"
                    },
                    {
                        "code": "4276",
                        "name": "资中县"
                    },
                    {
                        "code": "4277",
                        "name": "隆昌县"
                    }
                ]
            },
            {
                "code": "394",
                "name": "乐山市",
                "sub": [
                    {
                        "code": "4278",
                        "name": "五通桥区"
                    },
                    {
                        "code": "4279",
                        "name": "井研县"
                    },
                    {
                        "code": "4280",
                        "name": "夹江县"
                    },
                    {
                        "code": "4281",
                        "name": "峨眉山市"
                    },
                    {
                        "code": "4282",
                        "name": "峨边彝族自治县"
                    },
                    {
                        "code": "4283",
                        "name": "市中区"
                    },
                    {
                        "code": "4284",
                        "name": "沐川县"
                    },
                    {
                        "code": "4285",
                        "name": "沙湾区"
                    },
                    {
                        "code": "4286",
                        "name": "犍为县"
                    },
                    {
                        "code": "4287",
                        "name": "金口河区"
                    },
                    {
                        "code": "4288",
                        "name": "马边彝族自治县"
                    }
                ]
            },
            {
                "code": "395",
                "name": "南充市",
                "sub": [
                    {
                        "code": "4289",
                        "name": "仪陇县"
                    },
                    {
                        "code": "4290",
                        "name": "南充市嘉陵区"
                    },
                    {
                        "code": "4291",
                        "name": "南部县"
                    },
                    {
                        "code": "4292",
                        "name": "嘉陵区"
                    },
                    {
                        "code": "4293",
                        "name": "营山县"
                    },
                    {
                        "code": "4294",
                        "name": "蓬安县"
                    },
                    {
                        "code": "4295",
                        "name": "西充县"
                    },
                    {
                        "code": "4296",
                        "name": "阆中市"
                    },
                    {
                        "code": "4297",
                        "name": "顺庆区"
                    },
                    {
                        "code": "4298",
                        "name": "高坪区"
                    }
                ]
            },
            {
                "code": "396",
                "name": "眉山市",
                "sub": [
                    {
                        "code": "4299",
                        "name": "东坡区"
                    },
                    {
                        "code": "4300",
                        "name": "丹棱县"
                    },
                    {
                        "code": "4301",
                        "name": "仁寿县"
                    },
                    {
                        "code": "4302",
                        "name": "彭山县"
                    },
                    {
                        "code": "4303",
                        "name": "洪雅县"
                    },
                    {
                        "code": "4304",
                        "name": "青神县"
                    }
                ]
            },
            {
                "code": "397",
                "name": "宜宾市",
                "sub": [
                    {
                        "code": "4305",
                        "name": "兴文县"
                    },
                    {
                        "code": "4306",
                        "name": "南溪县"
                    },
                    {
                        "code": "4307",
                        "name": "宜宾县"
                    },
                    {
                        "code": "4308",
                        "name": "屏山县"
                    },
                    {
                        "code": "4309",
                        "name": "江安县"
                    },
                    {
                        "code": "4310",
                        "name": "珙县"
                    },
                    {
                        "code": "4311",
                        "name": "筠连县"
                    },
                    {
                        "code": "4312",
                        "name": "翠屏区"
                    },
                    {
                        "code": "4313",
                        "name": "长宁县"
                    },
                    {
                        "code": "4314",
                        "name": "高县"
                    }
                ]
            },
            {
                "code": "398",
                "name": "广安市",
                "sub": [
                    {
                        "code": "4315",
                        "name": "华蓥市"
                    },
                    {
                        "code": "4316",
                        "name": "岳池县"
                    },
                    {
                        "code": "4317",
                        "name": "广安区"
                    },
                    {
                        "code": "4318",
                        "name": "武胜县"
                    },
                    {
                        "code": "4319",
                        "name": "邻水县"
                    }
                ]
            },
            {
                "code": "399",
                "name": "达州市",
                "sub": [
                    {
                        "code": "4320",
                        "name": "万源市"
                    },
                    {
                        "code": "4321",
                        "name": "大竹县"
                    },
                    {
                        "code": "4322",
                        "name": "宣汉县"
                    },
                    {
                        "code": "4323",
                        "name": "开江县"
                    },
                    {
                        "code": "4324",
                        "name": "渠县"
                    },
                    {
                        "code": "4325",
                        "name": "达县"
                    },
                    {
                        "code": "4326",
                        "name": "通川区"
                    }
                ]
            },
            {
                "code": "400",
                "name": "雅安市",
                "sub": [
                    {
                        "code": "4327",
                        "name": "名山县"
                    },
                    {
                        "code": "4328",
                        "name": "天全县"
                    },
                    {
                        "code": "4329",
                        "name": "宝兴县"
                    },
                    {
                        "code": "4330",
                        "name": "汉源县"
                    },
                    {
                        "code": "4331",
                        "name": "石棉县"
                    },
                    {
                        "code": "4332",
                        "name": "芦山县"
                    },
                    {
                        "code": "4333",
                        "name": "荥经县"
                    },
                    {
                        "code": "4334",
                        "name": "雨城区"
                    }
                ]
            },
            {
                "code": "401",
                "name": "巴中市",
                "sub": [
                    {
                        "code": "4335",
                        "name": "南江县"
                    },
                    {
                        "code": "4336",
                        "name": "巴州区"
                    },
                    {
                        "code": "4337",
                        "name": "平昌县"
                    },
                    {
                        "code": "4338",
                        "name": "通江县"
                    }
                ]
            },
            {
                "code": "402",
                "name": "资阳市",
                "sub": [
                    {
                        "code": "4339",
                        "name": "乐至县"
                    },
                    {
                        "code": "4340",
                        "name": "安岳县"
                    },
                    {
                        "code": "4341",
                        "name": "简阳市"
                    },
                    {
                        "code": "4342",
                        "name": "雁江区"
                    }
                ]
            },
            {
                "code": "403",
                "name": "阿坝藏族羌族自治州",
                "sub": [
                    {
                        "code": "4343",
                        "name": "九寨沟县"
                    },
                    {
                        "code": "4344",
                        "name": "壤塘县"
                    },
                    {
                        "code": "4345",
                        "name": "小金县"
                    },
                    {
                        "code": "4346",
                        "name": "松潘县"
                    },
                    {
                        "code": "4347",
                        "name": "汶川县"
                    },
                    {
                        "code": "4348",
                        "name": "理县"
                    },
                    {
                        "code": "4349",
                        "name": "红原县"
                    },
                    {
                        "code": "4350",
                        "name": "若尔盖县"
                    },
                    {
                        "code": "4351",
                        "name": "茂县"
                    },
                    {
                        "code": "4352",
                        "name": "金川县"
                    },
                    {
                        "code": "4353",
                        "name": "阿坝县"
                    },
                    {
                        "code": "4354",
                        "name": "马尔康县"
                    },
                    {
                        "code": "4355",
                        "name": "黑水县"
                    }
                ]
            },
            {
                "code": "404",
                "name": "甘孜藏族自治州",
                "sub": [
                    {
                        "code": "4356",
                        "name": "丹巴县"
                    },
                    {
                        "code": "4357",
                        "name": "乡城县"
                    },
                    {
                        "code": "4358",
                        "name": "巴塘县"
                    },
                    {
                        "code": "4359",
                        "name": "康定县"
                    },
                    {
                        "code": "4360",
                        "name": "得荣县"
                    },
                    {
                        "code": "4361",
                        "name": "德格县"
                    },
                    {
                        "code": "4362",
                        "name": "新龙县"
                    },
                    {
                        "code": "4363",
                        "name": "泸定县"
                    },
                    {
                        "code": "4364",
                        "name": "炉霍县"
                    },
                    {
                        "code": "4365",
                        "name": "理塘县"
                    },
                    {
                        "code": "4366",
                        "name": "甘孜县"
                    },
                    {
                        "code": "4367",
                        "name": "白玉县"
                    },
                    {
                        "code": "4368",
                        "name": "石渠县"
                    },
                    {
                        "code": "4369",
                        "name": "稻城县"
                    },
                    {
                        "code": "4370",
                        "name": "色达县"
                    },
                    {
                        "code": "4371",
                        "name": "道孚县"
                    },
                    {
                        "code": "4372",
                        "name": "雅江县"
                    }
                ]
            },
            {
                "code": "405",
                "name": "凉山彝族自治州",
                "sub": [
                    {
                        "code": "4373",
                        "name": "会东县"
                    },
                    {
                        "code": "4374",
                        "name": "会理县"
                    },
                    {
                        "code": "4375",
                        "name": "冕宁县"
                    },
                    {
                        "code": "4376",
                        "name": "喜德县"
                    },
                    {
                        "code": "4377",
                        "name": "宁南县"
                    },
                    {
                        "code": "4378",
                        "name": "布拖县"
                    },
                    {
                        "code": "4379",
                        "name": "德昌县"
                    },
                    {
                        "code": "4380",
                        "name": "昭觉县"
                    },
                    {
                        "code": "4381",
                        "name": "普格县"
                    },
                    {
                        "code": "4382",
                        "name": "木里藏族自治县"
                    },
                    {
                        "code": "4383",
                        "name": "甘洛县"
                    },
                    {
                        "code": "4384",
                        "name": "盐源县"
                    },
                    {
                        "code": "4385",
                        "name": "美姑县"
                    },
                    {
                        "code": "4386",
                        "name": "西昌"
                    },
                    {
                        "code": "4387",
                        "name": "越西县"
                    },
                    {
                        "code": "4388",
                        "name": "金阳县"
                    },
                    {
                        "code": "4389",
                        "name": "雷波县"
                    }
                ]
            }
        ]
    },
    {
        "code": "24",
        "name": "贵州省",
        "sub": [
            {
                "code": "406",
                "name": "贵阳市",
                "sub": [
                    {
                        "code": "4390",
                        "name": "乌当区"
                    },
                    {
                        "code": "4391",
                        "name": "云岩区"
                    },
                    {
                        "code": "4392",
                        "name": "修文县"
                    },
                    {
                        "code": "4393",
                        "name": "南明区"
                    },
                    {
                        "code": "4394",
                        "name": "小河区"
                    },
                    {
                        "code": "4395",
                        "name": "开阳县"
                    },
                    {
                        "code": "4396",
                        "name": "息烽县"
                    },
                    {
                        "code": "4397",
                        "name": "清镇市"
                    },
                    {
                        "code": "4398",
                        "name": "白云区"
                    },
                    {
                        "code": "4399",
                        "name": "花溪区"
                    }
                ]
            },
            {
                "code": "407",
                "name": "六盘水市",
                "sub": [
                    {
                        "code": "4400",
                        "name": "六枝特区"
                    },
                    {
                        "code": "4401",
                        "name": "水城县"
                    },
                    {
                        "code": "4402",
                        "name": "盘县"
                    },
                    {
                        "code": "4403",
                        "name": "钟山区"
                    }
                ]
            },
            {
                "code": "408",
                "name": "遵义市",
                "sub": [
                    {
                        "code": "4404",
                        "name": "习水县"
                    },
                    {
                        "code": "4405",
                        "name": "仁怀市"
                    },
                    {
                        "code": "4406",
                        "name": "余庆县"
                    },
                    {
                        "code": "4407",
                        "name": "凤冈县"
                    },
                    {
                        "code": "4408",
                        "name": "务川仡佬族苗族自治县"
                    },
                    {
                        "code": "4409",
                        "name": "桐梓县"
                    },
                    {
                        "code": "4410",
                        "name": "正安县"
                    },
                    {
                        "code": "4411",
                        "name": "汇川区"
                    },
                    {
                        "code": "4412",
                        "name": "湄潭县"
                    },
                    {
                        "code": "4413",
                        "name": "红花岗区"
                    },
                    {
                        "code": "4414",
                        "name": "绥阳县"
                    },
                    {
                        "code": "4415",
                        "name": "赤水市"
                    },
                    {
                        "code": "4416",
                        "name": "道真仡佬族苗族自治县"
                    },
                    {
                        "code": "4417",
                        "name": "遵义县"
                    }
                ]
            },
            {
                "code": "409",
                "name": "安顺市",
                "sub": [
                    {
                        "code": "4418",
                        "name": "关岭布依族苗族自治县"
                    },
                    {
                        "code": "4419",
                        "name": "平坝县"
                    },
                    {
                        "code": "4420",
                        "name": "普定县"
                    },
                    {
                        "code": "4421",
                        "name": "紫云苗族布依族自治县"
                    },
                    {
                        "code": "4422",
                        "name": "西秀区"
                    },
                    {
                        "code": "4423",
                        "name": "镇宁布依族苗族自治县"
                    }
                ]
            },
            {
                "code": "410",
                "name": "铜仁地区",
                "sub": [
                    {
                        "code": "4424",
                        "name": "万山特区"
                    },
                    {
                        "code": "4425",
                        "name": "印江土家族苗族自治县"
                    },
                    {
                        "code": "4426",
                        "name": "德江县"
                    },
                    {
                        "code": "4427",
                        "name": "思南县"
                    },
                    {
                        "code": "4428",
                        "name": "松桃苗族自治县"
                    },
                    {
                        "code": "4429",
                        "name": "江口县"
                    },
                    {
                        "code": "4430",
                        "name": "沿河土家族自治县"
                    },
                    {
                        "code": "4431",
                        "name": "玉屏侗族自治县"
                    },
                    {
                        "code": "4432",
                        "name": "石阡县"
                    },
                    {
                        "code": "4433",
                        "name": "铜仁市"
                    }
                ]
            },
            {
                "code": "411",
                "name": "黔西南布依族苗族自治州",
                "sub": [
                    {
                        "code": "4434",
                        "name": "兴义市"
                    },
                    {
                        "code": "4435",
                        "name": "兴仁县"
                    },
                    {
                        "code": "4436",
                        "name": "册亨县"
                    },
                    {
                        "code": "4437",
                        "name": "安龙县"
                    },
                    {
                        "code": "4438",
                        "name": "普安县"
                    },
                    {
                        "code": "4439",
                        "name": "晴隆县"
                    },
                    {
                        "code": "4440",
                        "name": "望谟县"
                    },
                    {
                        "code": "4441",
                        "name": "贞丰县"
                    }
                ]
            },
            {
                "code": "412",
                "name": "毕节地区",
                "sub": [
                    {
                        "code": "4442",
                        "name": "大方县"
                    },
                    {
                        "code": "4443",
                        "name": "威宁彝族回族苗族自治县"
                    },
                    {
                        "code": "4444",
                        "name": "毕节市"
                    },
                    {
                        "code": "4445",
                        "name": "纳雍县"
                    },
                    {
                        "code": "4446",
                        "name": "织金县"
                    },
                    {
                        "code": "4447",
                        "name": "赫章县"
                    },
                    {
                        "code": "4448",
                        "name": "金沙县"
                    },
                    {
                        "code": "4449",
                        "name": "黔西县"
                    }
                ]
            },
            {
                "code": "413",
                "name": "黔东南苗族侗族自治州",
                "sub": [
                    {
                        "code": "4450",
                        "name": "三穗县"
                    },
                    {
                        "code": "4451",
                        "name": "丹寨县"
                    },
                    {
                        "code": "4452",
                        "name": "从江县"
                    },
                    {
                        "code": "4453",
                        "name": "凯里市"
                    },
                    {
                        "code": "4454",
                        "name": "剑河县"
                    },
                    {
                        "code": "4455",
                        "name": "台江县"
                    },
                    {
                        "code": "4456",
                        "name": "天柱县"
                    },
                    {
                        "code": "4457",
                        "name": "岑巩县"
                    },
                    {
                        "code": "4458",
                        "name": "施秉县"
                    },
                    {
                        "code": "4459",
                        "name": "榕江县"
                    },
                    {
                        "code": "4460",
                        "name": "锦屏县"
                    },
                    {
                        "code": "4461",
                        "name": "镇远县"
                    },
                    {
                        "code": "4462",
                        "name": "雷山县"
                    },
                    {
                        "code": "4463",
                        "name": "麻江县"
                    },
                    {
                        "code": "4464",
                        "name": "黄平县"
                    },
                    {
                        "code": "4465",
                        "name": "黎平县"
                    }
                ]
            },
            {
                "code": "414",
                "name": "黔南布依族苗族自治州",
                "sub": [
                    {
                        "code": "4466",
                        "name": "三都水族自治县"
                    },
                    {
                        "code": "4467",
                        "name": "平塘县"
                    },
                    {
                        "code": "4468",
                        "name": "惠水县"
                    },
                    {
                        "code": "4469",
                        "name": "独山县"
                    },
                    {
                        "code": "4470",
                        "name": "瓮安县"
                    },
                    {
                        "code": "4471",
                        "name": "福泉市"
                    },
                    {
                        "code": "4472",
                        "name": "罗甸县"
                    },
                    {
                        "code": "4473",
                        "name": "荔波县"
                    },
                    {
                        "code": "4474",
                        "name": "贵定县"
                    },
                    {
                        "code": "4475",
                        "name": "都匀市"
                    },
                    {
                        "code": "4476",
                        "name": "长顺县"
                    },
                    {
                        "code": "4477",
                        "name": "龙里县"
                    }
                ]
            }
        ]
    },
    {
        "code": "25",
        "name": "云南省",
        "sub": [
            {
                "code": "415",
                "name": "昆明市",
                "sub": [
                    {
                        "code": "4478",
                        "name": "东川区"
                    },
                    {
                        "code": "4479",
                        "name": "五华区"
                    },
                    {
                        "code": "4480",
                        "name": "呈贡县"
                    },
                    {
                        "code": "4481",
                        "name": "安宁市"
                    },
                    {
                        "code": "4482",
                        "name": "官渡区"
                    },
                    {
                        "code": "4483",
                        "name": "宜良县"
                    },
                    {
                        "code": "4484",
                        "name": "富民县"
                    },
                    {
                        "code": "4485",
                        "name": "寻甸回族彝族自治县"
                    },
                    {
                        "code": "4486",
                        "name": "嵩明县"
                    },
                    {
                        "code": "4487",
                        "name": "晋宁县"
                    },
                    {
                        "code": "4488",
                        "name": "盘龙区"
                    },
                    {
                        "code": "4489",
                        "name": "石林彝族自治县"
                    },
                    {
                        "code": "4490",
                        "name": "禄劝彝族苗族自治县"
                    },
                    {
                        "code": "4491",
                        "name": "西山区"
                    }
                ]
            },
            {
                "code": "416",
                "name": "曲靖市",
                "sub": [
                    {
                        "code": "4492",
                        "name": "会泽县"
                    },
                    {
                        "code": "4493",
                        "name": "宣威市"
                    },
                    {
                        "code": "4494",
                        "name": "富源县"
                    },
                    {
                        "code": "4495",
                        "name": "师宗县"
                    },
                    {
                        "code": "4496",
                        "name": "沾益县"
                    },
                    {
                        "code": "4497",
                        "name": "罗平县"
                    },
                    {
                        "code": "4498",
                        "name": "陆良县"
                    },
                    {
                        "code": "4499",
                        "name": "马龙县"
                    },
                    {
                        "code": "4500",
                        "name": "麒麟区"
                    }
                ]
            },
            {
                "code": "417",
                "name": "玉溪市",
                "sub": [
                    {
                        "code": "4501",
                        "name": "元江哈尼族彝族傣族自治县"
                    },
                    {
                        "code": "4502",
                        "name": "华宁县"
                    },
                    {
                        "code": "4503",
                        "name": "峨山彝族自治县"
                    },
                    {
                        "code": "4504",
                        "name": "新平彝族傣族自治县"
                    },
                    {
                        "code": "4505",
                        "name": "易门县"
                    },
                    {
                        "code": "4506",
                        "name": "江川县"
                    },
                    {
                        "code": "4507",
                        "name": "澄江县"
                    },
                    {
                        "code": "4508",
                        "name": "红塔区"
                    },
                    {
                        "code": "4509",
                        "name": "通海县"
                    }
                ]
            },
            {
                "code": "418",
                "name": "保山市",
                "sub": [
                    {
                        "code": "4510",
                        "name": "施甸县"
                    },
                    {
                        "code": "4511",
                        "name": "昌宁县"
                    },
                    {
                        "code": "4512",
                        "name": "腾冲县"
                    },
                    {
                        "code": "4513",
                        "name": "隆阳区"
                    },
                    {
                        "code": "4514",
                        "name": "龙陵县"
                    }
                ]
            },
            {
                "code": "419",
                "name": "昭通市",
                "sub": [
                    {
                        "code": "4515",
                        "name": "大关县"
                    },
                    {
                        "code": "4516",
                        "name": "威信县"
                    },
                    {
                        "code": "4517",
                        "name": "巧家县"
                    },
                    {
                        "code": "4518",
                        "name": "彝良县"
                    },
                    {
                        "code": "4519",
                        "name": "昭阳区"
                    },
                    {
                        "code": "4520",
                        "name": "水富县"
                    },
                    {
                        "code": "4521",
                        "name": "永善县"
                    },
                    {
                        "code": "4522",
                        "name": "盐津县"
                    },
                    {
                        "code": "4523",
                        "name": "绥江县"
                    },
                    {
                        "code": "4524",
                        "name": "镇雄县"
                    },
                    {
                        "code": "4525",
                        "name": "鲁甸县"
                    }
                ]
            },
            {
                "code": "420",
                "name": "丽江市",
                "sub": [
                    {
                        "code": "4526",
                        "name": "华坪县"
                    },
                    {
                        "code": "4527",
                        "name": "古城区"
                    },
                    {
                        "code": "4528",
                        "name": "宁蒗彝族自治县"
                    },
                    {
                        "code": "4529",
                        "name": "永胜县"
                    },
                    {
                        "code": "4530",
                        "name": "玉龙纳西族自治县"
                    }
                ]
            },
            {
                "code": "421",
                "name": "思茅市",
                "sub": []
            },
            {
                "code": "422",
                "name": "临沧市",
                "sub": [
                    {
                        "code": "4531",
                        "name": "临翔区"
                    },
                    {
                        "code": "4532",
                        "name": "云县"
                    },
                    {
                        "code": "4533",
                        "name": "凤庆县"
                    },
                    {
                        "code": "4534",
                        "name": "双江拉祜族佤族布朗族傣族自治县"
                    },
                    {
                        "code": "4535",
                        "name": "永德县"
                    },
                    {
                        "code": "4536",
                        "name": "沧源佤族自治县"
                    },
                    {
                        "code": "4537",
                        "name": "耿马傣族佤族自治县"
                    },
                    {
                        "code": "4538",
                        "name": "镇康县"
                    }
                ]
            },
            {
                "code": "423",
                "name": "楚雄彝族自治州",
                "sub": [
                    {
                        "code": "4539",
                        "name": "元谋县"
                    },
                    {
                        "code": "4540",
                        "name": "南华县"
                    },
                    {
                        "code": "4541",
                        "name": "双柏县"
                    },
                    {
                        "code": "4542",
                        "name": "大姚县"
                    },
                    {
                        "code": "4543",
                        "name": "姚安县"
                    },
                    {
                        "code": "4544",
                        "name": "楚雄市"
                    },
                    {
                        "code": "4545",
                        "name": "武定县"
                    },
                    {
                        "code": "4546",
                        "name": "永仁县"
                    },
                    {
                        "code": "4547",
                        "name": "牟定县"
                    },
                    {
                        "code": "4548",
                        "name": "禄丰县"
                    }
                ]
            },
            {
                "code": "424",
                "name": "红河哈尼族彝族自治州",
                "sub": [
                    {
                        "code": "4549",
                        "name": "个旧市"
                    },
                    {
                        "code": "4550",
                        "name": "元阳县"
                    },
                    {
                        "code": "4551",
                        "name": "屏边苗族自治县"
                    },
                    {
                        "code": "4552",
                        "name": "建水县"
                    },
                    {
                        "code": "4553",
                        "name": "开远市"
                    },
                    {
                        "code": "4554",
                        "name": "弥勒县"
                    },
                    {
                        "code": "4555",
                        "name": "河口瑶族自治县"
                    },
                    {
                        "code": "4556",
                        "name": "泸西县"
                    },
                    {
                        "code": "4557",
                        "name": "石屏县"
                    },
                    {
                        "code": "4558",
                        "name": "红河县"
                    },
                    {
                        "code": "4559",
                        "name": "绿春县"
                    },
                    {
                        "code": "4560",
                        "name": "蒙自县"
                    },
                    {
                        "code": "4561",
                        "name": "金平苗族瑶族傣族自治县"
                    }
                ]
            },
            {
                "code": "425",
                "name": "文山壮族苗族自治州",
                "sub": [
                    {
                        "code": "4562",
                        "name": "丘北县"
                    },
                    {
                        "code": "4563",
                        "name": "富宁县"
                    },
                    {
                        "code": "4564",
                        "name": "广南县"
                    },
                    {
                        "code": "4565",
                        "name": "文山县"
                    },
                    {
                        "code": "4566",
                        "name": "砚山县"
                    },
                    {
                        "code": "4567",
                        "name": "西畴县"
                    },
                    {
                        "code": "4568",
                        "name": "马关县"
                    },
                    {
                        "code": "4569",
                        "name": "麻栗坡县"
                    }
                ]
            },
            {
                "code": "426",
                "name": "西双版纳傣族自治州",
                "sub": [
                    {
                        "code": "4570",
                        "name": "勐海县"
                    },
                    {
                        "code": "4571",
                        "name": "勐腊县"
                    },
                    {
                        "code": "4572",
                        "name": "景洪市"
                    }
                ]
            },
            {
                "code": "427",
                "name": "大理白族自治州",
                "sub": [
                    {
                        "code": "4573",
                        "name": "云龙县"
                    },
                    {
                        "code": "4574",
                        "name": "剑川县"
                    },
                    {
                        "code": "4575",
                        "name": "南涧彝族自治县"
                    },
                    {
                        "code": "4576",
                        "name": "大理市"
                    },
                    {
                        "code": "4577",
                        "name": "宾川县"
                    },
                    {
                        "code": "4578",
                        "name": "巍山彝族回族自治县"
                    },
                    {
                        "code": "4579",
                        "name": "弥渡县"
                    },
                    {
                        "code": "4580",
                        "name": "永平县"
                    },
                    {
                        "code": "4581",
                        "name": "洱源县"
                    },
                    {
                        "code": "4582",
                        "name": "漾濞彝族自治县"
                    },
                    {
                        "code": "4583",
                        "name": "祥云县"
                    },
                    {
                        "code": "4584",
                        "name": "鹤庆县"
                    }
                ]
            },
            {
                "code": "428",
                "name": "德宏傣族景颇族自治州",
                "sub": [
                    {
                        "code": "4585",
                        "name": "梁河县"
                    },
                    {
                        "code": "4586",
                        "name": "潞西市"
                    },
                    {
                        "code": "4587",
                        "name": "瑞丽市"
                    },
                    {
                        "code": "4588",
                        "name": "盈江县"
                    },
                    {
                        "code": "4589",
                        "name": "陇川县"
                    }
                ]
            },
            {
                "code": "429",
                "name": "怒江傈僳族自治州",
                "sub": []
            },
            {
                "code": "430",
                "name": "迪庆藏族自治州",
                "sub": [
                    {
                        "code": "4590",
                        "name": "德钦县"
                    },
                    {
                        "code": "4591",
                        "name": "维西傈僳族自治县"
                    },
                    {
                        "code": "4592",
                        "name": "香格里拉县"
                    }
                ]
            }
        ]
    },
    {
        "code": "26",
        "name": "西藏自治区",
        "sub": [
            {
                "code": "431",
                "name": "拉萨市",
                "sub": [
                    {
                        "code": "4593",
                        "name": "城关区"
                    },
                    {
                        "code": "4594",
                        "name": "堆龙德庆县"
                    },
                    {
                        "code": "4595",
                        "name": "墨竹工卡县"
                    },
                    {
                        "code": "4596",
                        "name": "尼木县"
                    },
                    {
                        "code": "4597",
                        "name": "当雄县"
                    },
                    {
                        "code": "4598",
                        "name": "曲水县"
                    },
                    {
                        "code": "4599",
                        "name": "林周县"
                    },
                    {
                        "code": "4600",
                        "name": "达孜县"
                    }
                ]
            },
            {
                "code": "432",
                "name": "昌都地区",
                "sub": [
                    {
                        "code": "4601",
                        "name": "丁青县"
                    },
                    {
                        "code": "4602",
                        "name": "八宿县"
                    },
                    {
                        "code": "4603",
                        "name": "察雅县"
                    },
                    {
                        "code": "4604",
                        "name": "左贡县"
                    },
                    {
                        "code": "4605",
                        "name": "昌都县"
                    },
                    {
                        "code": "4606",
                        "name": "江达县"
                    },
                    {
                        "code": "4607",
                        "name": "洛隆县"
                    },
                    {
                        "code": "4608",
                        "name": "类乌齐县"
                    },
                    {
                        "code": "4609",
                        "name": "芒康县"
                    },
                    {
                        "code": "4610",
                        "name": "贡觉县"
                    },
                    {
                        "code": "4611",
                        "name": "边坝县"
                    }
                ]
            },
            {
                "code": "433",
                "name": "山南地区",
                "sub": [
                    {
                        "code": "4612",
                        "name": "乃东县"
                    },
                    {
                        "code": "4613",
                        "name": "加查县"
                    },
                    {
                        "code": "4614",
                        "name": "扎囊县"
                    },
                    {
                        "code": "4615",
                        "name": "措美县"
                    },
                    {
                        "code": "4616",
                        "name": "曲松县"
                    },
                    {
                        "code": "4617",
                        "name": "桑日县"
                    },
                    {
                        "code": "4618",
                        "name": "洛扎县"
                    },
                    {
                        "code": "4619",
                        "name": "浪卡子县"
                    },
                    {
                        "code": "4620",
                        "name": "琼结县"
                    },
                    {
                        "code": "4621",
                        "name": "贡嘎县"
                    },
                    {
                        "code": "4622",
                        "name": "错那县"
                    },
                    {
                        "code": "4623",
                        "name": "隆子县"
                    }
                ]
            },
            {
                "code": "434",
                "name": "日喀则地区",
                "sub": [
                    {
                        "code": "4624",
                        "name": "亚东县"
                    },
                    {
                        "code": "4625",
                        "name": "仁布县"
                    },
                    {
                        "code": "4626",
                        "name": "仲巴县"
                    },
                    {
                        "code": "4627",
                        "name": "南木林县"
                    },
                    {
                        "code": "4628",
                        "name": "吉隆县"
                    },
                    {
                        "code": "4629",
                        "name": "定日县"
                    },
                    {
                        "code": "4630",
                        "name": "定结县"
                    },
                    {
                        "code": "4631",
                        "name": "岗巴县"
                    },
                    {
                        "code": "4632",
                        "name": "康马县"
                    },
                    {
                        "code": "4633",
                        "name": "拉孜县"
                    },
                    {
                        "code": "4634",
                        "name": "日喀则市"
                    },
                    {
                        "code": "4635",
                        "name": "昂仁县"
                    },
                    {
                        "code": "4636",
                        "name": "江孜县"
                    },
                    {
                        "code": "4637",
                        "name": "白朗县"
                    },
                    {
                        "code": "4638",
                        "name": "聂拉木县"
                    },
                    {
                        "code": "4639",
                        "name": "萨嘎县"
                    },
                    {
                        "code": "4640",
                        "name": "萨迦县"
                    },
                    {
                        "code": "4641",
                        "name": "谢通门县"
                    }
                ]
            },
            {
                "code": "435",
                "name": "那曲地区",
                "sub": [
                    {
                        "code": "4642",
                        "name": "嘉黎县"
                    },
                    {
                        "code": "4643",
                        "name": "安多县"
                    },
                    {
                        "code": "4644",
                        "name": "尼玛县"
                    },
                    {
                        "code": "4645",
                        "name": "巴青县"
                    },
                    {
                        "code": "4646",
                        "name": "比如县"
                    },
                    {
                        "code": "4647",
                        "name": "班戈县"
                    },
                    {
                        "code": "4648",
                        "name": "申扎县"
                    },
                    {
                        "code": "4649",
                        "name": "索县"
                    },
                    {
                        "code": "4650",
                        "name": "聂荣县"
                    },
                    {
                        "code": "4651",
                        "name": "那曲县"
                    }
                ]
            },
            {
                "code": "436",
                "name": "阿里地区",
                "sub": [
                    {
                        "code": "4652",
                        "name": "噶尔县"
                    },
                    {
                        "code": "4653",
                        "name": "措勤县"
                    },
                    {
                        "code": "4654",
                        "name": "改则县"
                    },
                    {
                        "code": "4655",
                        "name": "日土县"
                    },
                    {
                        "code": "4656",
                        "name": "普兰县"
                    },
                    {
                        "code": "4657",
                        "name": "札达县"
                    },
                    {
                        "code": "4658",
                        "name": "革吉县"
                    }
                ]
            },
            {
                "code": "437",
                "name": "林芝地区",
                "sub": [
                    {
                        "code": "4659",
                        "name": "墨脱县"
                    },
                    {
                        "code": "4660",
                        "name": "察隅县"
                    },
                    {
                        "code": "4661",
                        "name": "工布江达县"
                    },
                    {
                        "code": "4662",
                        "name": "朗县"
                    },
                    {
                        "code": "4663",
                        "name": "林芝县"
                    },
                    {
                        "code": "4664",
                        "name": "波密县"
                    },
                    {
                        "code": "4665",
                        "name": "米林县"
                    }
                ]
            }
        ]
    },
    {
        "code": "27",
        "name": "陕西省",
        "sub": [
            {
                "code": "438",
                "name": "西安市",
                "sub": [
                    {
                        "code": "4666",
                        "name": "临潼区"
                    },
                    {
                        "code": "4667",
                        "name": "周至县"
                    },
                    {
                        "code": "4668",
                        "name": "户县"
                    },
                    {
                        "code": "4669",
                        "name": "新城区"
                    },
                    {
                        "code": "4670",
                        "name": "未央区"
                    },
                    {
                        "code": "4671",
                        "name": "灞桥区"
                    },
                    {
                        "code": "4672",
                        "name": "碑林区"
                    },
                    {
                        "code": "4673",
                        "name": "莲湖区"
                    },
                    {
                        "code": "4674",
                        "name": "蓝田县"
                    },
                    {
                        "code": "4675",
                        "name": "长安区"
                    },
                    {
                        "code": "4676",
                        "name": "阎良区"
                    },
                    {
                        "code": "4677",
                        "name": "雁塔区"
                    },
                    {
                        "code": "4678",
                        "name": "高陵县"
                    }
                ]
            },
            {
                "code": "439",
                "name": "铜川市",
                "sub": [
                    {
                        "code": "4679",
                        "name": "印台区"
                    },
                    {
                        "code": "4680",
                        "name": "宜君县"
                    },
                    {
                        "code": "4681",
                        "name": "王益区"
                    },
                    {
                        "code": "4682",
                        "name": "耀州区"
                    }
                ]
            },
            {
                "code": "440",
                "name": "宝鸡市",
                "sub": [
                    {
                        "code": "4683",
                        "name": "凤县"
                    },
                    {
                        "code": "4684",
                        "name": "凤翔县"
                    },
                    {
                        "code": "4685",
                        "name": "千阳县"
                    },
                    {
                        "code": "4686",
                        "name": "太白县"
                    },
                    {
                        "code": "4687",
                        "name": "岐山县"
                    },
                    {
                        "code": "4688",
                        "name": "扶风县"
                    },
                    {
                        "code": "4689",
                        "name": "渭滨区"
                    },
                    {
                        "code": "4690",
                        "name": "眉县"
                    },
                    {
                        "code": "4691",
                        "name": "金台区"
                    },
                    {
                        "code": "4692",
                        "name": "陇县"
                    },
                    {
                        "code": "4693",
                        "name": "陈仓区"
                    },
                    {
                        "code": "4694",
                        "name": "麟游县"
                    }
                ]
            },
            {
                "code": "441",
                "name": "咸阳市",
                "sub": [
                    {
                        "code": "4695",
                        "name": "三原县"
                    },
                    {
                        "code": "4696",
                        "name": "干县"
                    },
                    {
                        "code": "4697",
                        "name": "兴平市"
                    },
                    {
                        "code": "4698",
                        "name": "彬县"
                    },
                    {
                        "code": "4699",
                        "name": "旬邑县"
                    },
                    {
                        "code": "4700",
                        "name": "杨陵区"
                    },
                    {
                        "code": "4701",
                        "name": "武功县"
                    },
                    {
                        "code": "4702",
                        "name": "永寿县"
                    },
                    {
                        "code": "4703",
                        "name": "泾阳县"
                    },
                    {
                        "code": "4704",
                        "name": "淳化县"
                    },
                    {
                        "code": "4705",
                        "name": "渭城区"
                    },
                    {
                        "code": "4706",
                        "name": "礼泉县"
                    },
                    {
                        "code": "4707",
                        "name": "秦都区"
                    },
                    {
                        "code": "4708",
                        "name": "长武县"
                    }
                ]
            },
            {
                "code": "442",
                "name": "渭南市",
                "sub": [
                    {
                        "code": "4709",
                        "name": "临渭区"
                    },
                    {
                        "code": "4710",
                        "name": "华县"
                    },
                    {
                        "code": "4711",
                        "name": "华阴市"
                    },
                    {
                        "code": "4712",
                        "name": "合阳县"
                    },
                    {
                        "code": "4713",
                        "name": "大荔县"
                    },
                    {
                        "code": "4714",
                        "name": "富平县"
                    },
                    {
                        "code": "4715",
                        "name": "潼关县"
                    },
                    {
                        "code": "4716",
                        "name": "澄城县"
                    },
                    {
                        "code": "4717",
                        "name": "白水县"
                    },
                    {
                        "code": "4718",
                        "name": "蒲城县"
                    },
                    {
                        "code": "4719",
                        "name": "韩城市"
                    }
                ]
            },
            {
                "code": "443",
                "name": "延安市",
                "sub": [
                    {
                        "code": "4720",
                        "name": "吴起县"
                    },
                    {
                        "code": "4721",
                        "name": "子长县"
                    },
                    {
                        "code": "4722",
                        "name": "安塞县"
                    },
                    {
                        "code": "4723",
                        "name": "宜川县"
                    },
                    {
                        "code": "4724",
                        "name": "宝塔区"
                    },
                    {
                        "code": "4725",
                        "name": "富县"
                    },
                    {
                        "code": "4726",
                        "name": "延川县"
                    },
                    {
                        "code": "4727",
                        "name": "延长县"
                    },
                    {
                        "code": "4728",
                        "name": "志丹县"
                    },
                    {
                        "code": "4729",
                        "name": "洛川县"
                    },
                    {
                        "code": "4730",
                        "name": "甘泉县"
                    },
                    {
                        "code": "4731",
                        "name": "黄陵县"
                    },
                    {
                        "code": "4732",
                        "name": "黄龙县"
                    }
                ]
            },
            {
                "code": "444",
                "name": "汉中市",
                "sub": [
                    {
                        "code": "4733",
                        "name": "佛坪县"
                    },
                    {
                        "code": "4734",
                        "name": "勉县"
                    },
                    {
                        "code": "4735",
                        "name": "南郑县"
                    },
                    {
                        "code": "4736",
                        "name": "城固县"
                    },
                    {
                        "code": "4737",
                        "name": "宁强县"
                    },
                    {
                        "code": "4738",
                        "name": "汉台区"
                    },
                    {
                        "code": "4739",
                        "name": "洋县"
                    },
                    {
                        "code": "4740",
                        "name": "留坝县"
                    },
                    {
                        "code": "4741",
                        "name": "略阳县"
                    },
                    {
                        "code": "4742",
                        "name": "西乡县"
                    },
                    {
                        "code": "4743",
                        "name": "镇巴县"
                    }
                ]
            },
            {
                "code": "445",
                "name": "榆林市",
                "sub": [
                    {
                        "code": "4744",
                        "name": "佳县"
                    },
                    {
                        "code": "4745",
                        "name": "吴堡县"
                    },
                    {
                        "code": "4746",
                        "name": "子洲县"
                    },
                    {
                        "code": "4747",
                        "name": "定边县"
                    },
                    {
                        "code": "4748",
                        "name": "府谷县"
                    },
                    {
                        "code": "4749",
                        "name": "榆林市榆阳区"
                    },
                    {
                        "code": "4750",
                        "name": "横山县"
                    },
                    {
                        "code": "4751",
                        "name": "清涧县"
                    },
                    {
                        "code": "4752",
                        "name": "神木县"
                    },
                    {
                        "code": "4753",
                        "name": "米脂县"
                    },
                    {
                        "code": "4754",
                        "name": "绥德县"
                    },
                    {
                        "code": "4755",
                        "name": "靖边县"
                    }
                ]
            },
            {
                "code": "446",
                "name": "安康市",
                "sub": [
                    {
                        "code": "4756",
                        "name": "宁陕县"
                    },
                    {
                        "code": "4757",
                        "name": "岚皋县"
                    },
                    {
                        "code": "4758",
                        "name": "平利县"
                    },
                    {
                        "code": "4759",
                        "name": "旬阳县"
                    },
                    {
                        "code": "4760",
                        "name": "汉滨区"
                    },
                    {
                        "code": "4761",
                        "name": "汉阴县"
                    },
                    {
                        "code": "4762",
                        "name": "白河县"
                    },
                    {
                        "code": "4763",
                        "name": "石泉县"
                    },
                    {
                        "code": "4764",
                        "name": "紫阳县"
                    },
                    {
                        "code": "4765",
                        "name": "镇坪县"
                    }
                ]
            },
            {
                "code": "447",
                "name": "商洛市",
                "sub": [
                    {
                        "code": "4766",
                        "name": "丹凤县"
                    },
                    {
                        "code": "4767",
                        "name": "商南县"
                    },
                    {
                        "code": "4768",
                        "name": "商州区"
                    },
                    {
                        "code": "4769",
                        "name": "山阳县"
                    },
                    {
                        "code": "4770",
                        "name": "柞水县"
                    },
                    {
                        "code": "4771",
                        "name": "洛南县"
                    },
                    {
                        "code": "4772",
                        "name": "镇安县"
                    }
                ]
            }
        ]
    },
    {
        "code": "28",
        "name": "甘肃省",
        "sub": [
            {
                "code": "448",
                "name": "兰州市",
                "sub": [
                    {
                        "code": "4773",
                        "name": "七里河区"
                    },
                    {
                        "code": "4774",
                        "name": "城关区"
                    },
                    {
                        "code": "4775",
                        "name": "安宁区"
                    },
                    {
                        "code": "4776",
                        "name": "榆中县"
                    },
                    {
                        "code": "4777",
                        "name": "永登县"
                    },
                    {
                        "code": "4778",
                        "name": "皋兰县"
                    },
                    {
                        "code": "4779",
                        "name": "红古区"
                    },
                    {
                        "code": "4780",
                        "name": "西固区"
                    }
                ]
            },
            {
                "code": "449",
                "name": "嘉峪关市",
                "sub": [
                    {
                        "code": "4781",
                        "name": "嘉峪关市"
                    }
                ]
            },
            {
                "code": "450",
                "name": "金昌市",
                "sub": [
                    {
                        "code": "4782",
                        "name": "永昌县"
                    },
                    {
                        "code": "4783",
                        "name": "金川区"
                    }
                ]
            },
            {
                "code": "451",
                "name": "白银市",
                "sub": [
                    {
                        "code": "4784",
                        "name": "会宁县"
                    },
                    {
                        "code": "4785",
                        "name": "平川区"
                    },
                    {
                        "code": "4786",
                        "name": "景泰县"
                    },
                    {
                        "code": "4787",
                        "name": "白银区"
                    },
                    {
                        "code": "4788",
                        "name": "靖远县"
                    }
                ]
            },
            {
                "code": "452",
                "name": "天水市",
                "sub": [
                    {
                        "code": "4789",
                        "name": "张家川回族自治县"
                    },
                    {
                        "code": "4790",
                        "name": "武山县"
                    },
                    {
                        "code": "4791",
                        "name": "清水县"
                    },
                    {
                        "code": "4792",
                        "name": "甘谷县"
                    },
                    {
                        "code": "4793",
                        "name": "秦安县"
                    },
                    {
                        "code": "4794",
                        "name": "秦州区"
                    },
                    {
                        "code": "4795",
                        "name": "麦积区"
                    }
                ]
            },
            {
                "code": "453",
                "name": "武威市",
                "sub": [
                    {
                        "code": "4796",
                        "name": "凉州区"
                    },
                    {
                        "code": "4797",
                        "name": "古浪县"
                    },
                    {
                        "code": "4798",
                        "name": "天祝藏族自治县"
                    },
                    {
                        "code": "4799",
                        "name": "民勤县"
                    }
                ]
            },
            {
                "code": "454",
                "name": "张掖市",
                "sub": [
                    {
                        "code": "4800",
                        "name": "临泽县"
                    },
                    {
                        "code": "4801",
                        "name": "山丹县"
                    },
                    {
                        "code": "4802",
                        "name": "民乐县"
                    },
                    {
                        "code": "4803",
                        "name": "甘州区"
                    },
                    {
                        "code": "4804",
                        "name": "肃南裕固族自治县"
                    },
                    {
                        "code": "4805",
                        "name": "高台县"
                    }
                ]
            },
            {
                "code": "455",
                "name": "平凉市",
                "sub": [
                    {
                        "code": "4806",
                        "name": "华亭县"
                    },
                    {
                        "code": "4807",
                        "name": "崆峒区"
                    },
                    {
                        "code": "4808",
                        "name": "崇信县"
                    },
                    {
                        "code": "4809",
                        "name": "庄浪县"
                    },
                    {
                        "code": "4810",
                        "name": "泾川县"
                    },
                    {
                        "code": "4811",
                        "name": "灵台县"
                    },
                    {
                        "code": "4812",
                        "name": "静宁县"
                    }
                ]
            },
            {
                "code": "456",
                "name": "酒泉市",
                "sub": [
                    {
                        "code": "4813",
                        "name": "敦煌市"
                    },
                    {
                        "code": "4814",
                        "name": "玉门市"
                    },
                    {
                        "code": "4815",
                        "name": "瓜州县（原安西县）"
                    },
                    {
                        "code": "4816",
                        "name": "肃北蒙古族自治县"
                    },
                    {
                        "code": "4817",
                        "name": "肃州区"
                    },
                    {
                        "code": "4818",
                        "name": "金塔县"
                    },
                    {
                        "code": "4819",
                        "name": "阿克塞哈萨克族自治县"
                    }
                ]
            },
            {
                "code": "457",
                "name": "庆阳市",
                "sub": [
                    {
                        "code": "4820",
                        "name": "华池县"
                    },
                    {
                        "code": "4821",
                        "name": "合水县"
                    },
                    {
                        "code": "4822",
                        "name": "宁县"
                    },
                    {
                        "code": "4823",
                        "name": "庆城县"
                    },
                    {
                        "code": "4824",
                        "name": "正宁县"
                    },
                    {
                        "code": "4825",
                        "name": "环县"
                    },
                    {
                        "code": "4826",
                        "name": "西峰区"
                    },
                    {
                        "code": "4827",
                        "name": "镇原县"
                    }
                ]
            },
            {
                "code": "458",
                "name": "定西市",
                "sub": [
                    {
                        "code": "4828",
                        "name": "临洮县"
                    },
                    {
                        "code": "4829",
                        "name": "安定区"
                    },
                    {
                        "code": "4830",
                        "name": "岷县"
                    },
                    {
                        "code": "4831",
                        "name": "渭源县"
                    },
                    {
                        "code": "4832",
                        "name": "漳县"
                    },
                    {
                        "code": "4833",
                        "name": "通渭县"
                    },
                    {
                        "code": "4834",
                        "name": "陇西县"
                    }
                ]
            },
            {
                "code": "459",
                "name": "陇南市",
                "sub": [
                    {
                        "code": "4835",
                        "name": "两当县"
                    },
                    {
                        "code": "4836",
                        "name": "宕昌县"
                    },
                    {
                        "code": "4837",
                        "name": "康县"
                    },
                    {
                        "code": "4838",
                        "name": "徽县"
                    },
                    {
                        "code": "4839",
                        "name": "成县"
                    },
                    {
                        "code": "4840",
                        "name": "文县"
                    },
                    {
                        "code": "4841",
                        "name": "武都区"
                    },
                    {
                        "code": "4842",
                        "name": "礼县"
                    },
                    {
                        "code": "4843",
                        "name": "西和县"
                    }
                ]
            },
            {
                "code": "460",
                "name": "临夏回族自治州",
                "sub": [
                    {
                        "code": "4844",
                        "name": "东乡族自治县"
                    },
                    {
                        "code": "4845",
                        "name": "临夏县"
                    },
                    {
                        "code": "4846",
                        "name": "临夏市"
                    },
                    {
                        "code": "4847",
                        "name": "和政县"
                    },
                    {
                        "code": "4848",
                        "name": "广河县"
                    },
                    {
                        "code": "4849",
                        "name": "康乐县"
                    },
                    {
                        "code": "4850",
                        "name": "永靖县"
                    },
                    {
                        "code": "4851",
                        "name": "积石山保安族东乡族撒拉族自治县"
                    }
                ]
            },
            {
                "code": "461",
                "name": "甘南藏族自治州",
                "sub": [
                    {
                        "code": "4852",
                        "name": "临潭县"
                    },
                    {
                        "code": "4853",
                        "name": "卓尼县"
                    },
                    {
                        "code": "4854",
                        "name": "合作市"
                    },
                    {
                        "code": "4855",
                        "name": "夏河县"
                    },
                    {
                        "code": "4856",
                        "name": "玛曲县"
                    },
                    {
                        "code": "4857",
                        "name": "碌曲县"
                    },
                    {
                        "code": "4858",
                        "name": "舟曲县"
                    },
                    {
                        "code": "4859",
                        "name": "迭部县"
                    }
                ]
            }
        ]
    },
    {
        "code": "29",
        "name": "青海省",
        "sub": [
            {
                "code": "462",
                "name": "西宁市",
                "sub": [
                    {
                        "code": "4860",
                        "name": "城东区"
                    },
                    {
                        "code": "4861",
                        "name": "城中区"
                    },
                    {
                        "code": "4862",
                        "name": "城北区"
                    },
                    {
                        "code": "4863",
                        "name": "城西区"
                    },
                    {
                        "code": "4864",
                        "name": "大通回族土族自治县"
                    },
                    {
                        "code": "4865",
                        "name": "湟中县"
                    },
                    {
                        "code": "4866",
                        "name": "湟源县"
                    }
                ]
            },
            {
                "code": "463",
                "name": "海东地区",
                "sub": [
                    {
                        "code": "4867",
                        "name": "乐都县"
                    },
                    {
                        "code": "4868",
                        "name": "互助土族自治县"
                    },
                    {
                        "code": "4869",
                        "name": "化隆回族自治县"
                    },
                    {
                        "code": "4870",
                        "name": "平安县"
                    },
                    {
                        "code": "4871",
                        "name": "循化撒拉族自治县"
                    },
                    {
                        "code": "4872",
                        "name": "民和回族土族自治县"
                    }
                ]
            },
            {
                "code": "464",
                "name": "海北藏族自治州",
                "sub": [
                    {
                        "code": "4873",
                        "name": "刚察县"
                    },
                    {
                        "code": "4874",
                        "name": "海晏县"
                    },
                    {
                        "code": "4875",
                        "name": "祁连县"
                    },
                    {
                        "code": "4876",
                        "name": "门源回族自治县"
                    }
                ]
            },
            {
                "code": "465",
                "name": "黄南藏族自治州",
                "sub": [
                    {
                        "code": "4877",
                        "name": "同仁县"
                    },
                    {
                        "code": "4878",
                        "name": "尖扎县"
                    },
                    {
                        "code": "4879",
                        "name": "河南蒙古族自治县"
                    },
                    {
                        "code": "4880",
                        "name": "泽库县"
                    }
                ]
            },
            {
                "code": "466",
                "name": "海南藏族自治州",
                "sub": [
                    {
                        "code": "4881",
                        "name": "共和县"
                    },
                    {
                        "code": "4882",
                        "name": "兴海县"
                    },
                    {
                        "code": "4883",
                        "name": "同德县"
                    },
                    {
                        "code": "4884",
                        "name": "贵南县"
                    },
                    {
                        "code": "4885",
                        "name": "贵德县"
                    }
                ]
            },
            {
                "code": "467",
                "name": "果洛藏族自治州",
                "sub": [
                    {
                        "code": "4886",
                        "name": "久治县"
                    },
                    {
                        "code": "4887",
                        "name": "玛多县"
                    },
                    {
                        "code": "4888",
                        "name": "玛沁县"
                    },
                    {
                        "code": "4889",
                        "name": "班玛县"
                    },
                    {
                        "code": "4890",
                        "name": "甘德县"
                    },
                    {
                        "code": "4891",
                        "name": "达日县"
                    }
                ]
            },
            {
                "code": "468",
                "name": "玉树藏族自治州",
                "sub": [
                    {
                        "code": "4892",
                        "name": "囊谦县"
                    },
                    {
                        "code": "4893",
                        "name": "曲麻莱县"
                    },
                    {
                        "code": "4894",
                        "name": "杂多县"
                    },
                    {
                        "code": "4895",
                        "name": "治多县"
                    },
                    {
                        "code": "4896",
                        "name": "玉树县"
                    },
                    {
                        "code": "4897",
                        "name": "称多县"
                    }
                ]
            },
            {
                "code": "469",
                "name": "海西蒙古族藏族自治州",
                "sub": [
                    {
                        "code": "4898",
                        "name": "乌兰县"
                    },
                    {
                        "code": "4899",
                        "name": "冷湖行委"
                    },
                    {
                        "code": "4900",
                        "name": "大柴旦行委"
                    },
                    {
                        "code": "4901",
                        "name": "天峻县"
                    },
                    {
                        "code": "4902",
                        "name": "德令哈市"
                    },
                    {
                        "code": "4903",
                        "name": "格尔木市"
                    },
                    {
                        "code": "4904",
                        "name": "茫崖行委"
                    },
                    {
                        "code": "4905",
                        "name": "都兰县"
                    }
                ]
            }
        ]
    },
    {
        "code": "30",
        "name": "宁夏回族自治区",
        "sub": [
            {
                "code": "470",
                "name": "银川市",
                "sub": [
                    {
                        "code": "4906",
                        "name": "兴庆区"
                    },
                    {
                        "code": "4907",
                        "name": "永宁县"
                    },
                    {
                        "code": "4908",
                        "name": "灵武市"
                    },
                    {
                        "code": "4909",
                        "name": "西夏区"
                    },
                    {
                        "code": "4910",
                        "name": "贺兰县"
                    },
                    {
                        "code": "4911",
                        "name": "金凤区"
                    }
                ]
            },
            {
                "code": "471",
                "name": "石嘴山市",
                "sub": [
                    {
                        "code": "4912",
                        "name": "大武口区"
                    },
                    {
                        "code": "4913",
                        "name": "平罗县"
                    },
                    {
                        "code": "4914",
                        "name": "惠农区"
                    }
                ]
            },
            {
                "code": "472",
                "name": "吴忠市",
                "sub": [
                    {
                        "code": "4915",
                        "name": "利通区"
                    },
                    {
                        "code": "4916",
                        "name": "同心县"
                    },
                    {
                        "code": "4917",
                        "name": "盐池县"
                    },
                    {
                        "code": "4918",
                        "name": "青铜峡市"
                    }
                ]
            },
            {
                "code": "473",
                "name": "固原市",
                "sub": [
                    {
                        "code": "4919",
                        "name": "原州区"
                    },
                    {
                        "code": "4920",
                        "name": "彭阳县"
                    },
                    {
                        "code": "4921",
                        "name": "泾源县"
                    },
                    {
                        "code": "4922",
                        "name": "西吉县"
                    },
                    {
                        "code": "4923",
                        "name": "隆德县"
                    }
                ]
            },
            {
                "code": "474",
                "name": "中卫市",
                "sub": [
                    {
                        "code": "4924",
                        "name": "中宁县"
                    },
                    {
                        "code": "4925",
                        "name": "沙坡头区"
                    },
                    {
                        "code": "4926",
                        "name": "海原县"
                    }
                ]
            }
        ]
    },
    {
        "code": "31",
        "name": "新疆维吾尔自治区",
        "sub": [
            {
                "code": "475",
                "name": "乌鲁木齐市",
                "sub": [
                    {
                        "code": "4927",
                        "name": "东山区"
                    },
                    {
                        "code": "4928",
                        "name": "乌鲁木齐县"
                    },
                    {
                        "code": "4929",
                        "name": "天山区"
                    },
                    {
                        "code": "4930",
                        "name": "头屯河区"
                    },
                    {
                        "code": "4931",
                        "name": "新市区"
                    },
                    {
                        "code": "4932",
                        "name": "水磨沟区"
                    },
                    {
                        "code": "4933",
                        "name": "沙依巴克区"
                    },
                    {
                        "code": "4934",
                        "name": "达坂城区"
                    }
                ]
            },
            {
                "code": "476",
                "name": "克拉玛依市",
                "sub": [
                    {
                        "code": "4935",
                        "name": "乌尔禾区"
                    },
                    {
                        "code": "4936",
                        "name": "克拉玛依区"
                    },
                    {
                        "code": "4937",
                        "name": "独山子区"
                    },
                    {
                        "code": "4938",
                        "name": "白碱滩区"
                    }
                ]
            },
            {
                "code": "477",
                "name": "吐鲁番地区",
                "sub": [
                    {
                        "code": "4939",
                        "name": "吐鲁番市"
                    },
                    {
                        "code": "4940",
                        "name": "托克逊县"
                    },
                    {
                        "code": "4941",
                        "name": "鄯善县"
                    }
                ]
            },
            {
                "code": "478",
                "name": "哈密地区",
                "sub": [
                    {
                        "code": "4942",
                        "name": "伊吾县"
                    },
                    {
                        "code": "4943",
                        "name": "哈密市"
                    },
                    {
                        "code": "4944",
                        "name": "巴里坤哈萨克自治县"
                    }
                ]
            },
            {
                "code": "479",
                "name": "昌吉回族自治州",
                "sub": [
                    {
                        "code": "4945",
                        "name": "吉木萨尔县"
                    },
                    {
                        "code": "4946",
                        "name": "呼图壁县"
                    },
                    {
                        "code": "4947",
                        "name": "奇台县"
                    },
                    {
                        "code": "4948",
                        "name": "昌吉市"
                    },
                    {
                        "code": "4949",
                        "name": "木垒哈萨克自治县"
                    },
                    {
                        "code": "4950",
                        "name": "玛纳斯县"
                    },
                    {
                        "code": "4951",
                        "name": "米泉市"
                    },
                    {
                        "code": "4952",
                        "name": "阜康市"
                    }
                ]
            },
            {
                "code": "480",
                "name": "博尔塔拉蒙古自治州",
                "sub": [
                    {
                        "code": "4953",
                        "name": "博乐市"
                    },
                    {
                        "code": "4954",
                        "name": "温泉县"
                    },
                    {
                        "code": "4955",
                        "name": "精河县"
                    }
                ]
            },
            {
                "code": "481",
                "name": "巴音郭楞蒙古自治州",
                "sub": [
                    {
                        "code": "4956",
                        "name": "博湖县"
                    },
                    {
                        "code": "4957",
                        "name": "和硕县"
                    },
                    {
                        "code": "4958",
                        "name": "和静县"
                    },
                    {
                        "code": "4959",
                        "name": "尉犁县"
                    },
                    {
                        "code": "4960",
                        "name": "库尔勒市"
                    },
                    {
                        "code": "4961",
                        "name": "焉耆回族自治县"
                    },
                    {
                        "code": "4962",
                        "name": "若羌县"
                    },
                    {
                        "code": "4963",
                        "name": "轮台县"
                    }
                ]
            },
            {
                "code": "482",
                "name": "阿克苏地区",
                "sub": [
                    {
                        "code": "4964",
                        "name": "乌什县"
                    },
                    {
                        "code": "4965",
                        "name": "库车县"
                    },
                    {
                        "code": "4966",
                        "name": "拜城县"
                    },
                    {
                        "code": "4967",
                        "name": "新和县"
                    },
                    {
                        "code": "4968",
                        "name": "柯坪县"
                    },
                    {
                        "code": "4969",
                        "name": "沙雅县"
                    },
                    {
                        "code": "4970",
                        "name": "温宿县"
                    },
                    {
                        "code": "4971",
                        "name": "阿克苏市"
                    },
                    {
                        "code": "4972",
                        "name": "阿瓦提县"
                    }
                ]
            },
            {
                "code": "483",
                "name": "克孜勒苏柯尔克孜自治州",
                "sub": [
                    {
                        "code": "4973",
                        "name": "乌恰县"
                    },
                    {
                        "code": "4974",
                        "name": "阿克陶县"
                    },
                    {
                        "code": "4975",
                        "name": "阿合奇县"
                    },
                    {
                        "code": "4976",
                        "name": "阿图什市"
                    }
                ]
            },
            {
                "code": "484",
                "name": "喀什地区",
                "sub": [
                    {
                        "code": "4977",
                        "name": "伽师县"
                    },
                    {
                        "code": "4978",
                        "name": "叶城县"
                    },
                    {
                        "code": "4979",
                        "name": "喀什市"
                    },
                    {
                        "code": "4980",
                        "name": "塔什库尔干塔吉克自治县"
                    },
                    {
                        "code": "4981",
                        "name": "岳普湖县"
                    },
                    {
                        "code": "4982",
                        "name": "巴楚县"
                    },
                    {
                        "code": "4983",
                        "name": "泽普县"
                    },
                    {
                        "code": "4984",
                        "name": "疏勒县"
                    },
                    {
                        "code": "4985",
                        "name": "疏附县"
                    },
                    {
                        "code": "4986",
                        "name": "英吉沙县"
                    },
                    {
                        "code": "4987",
                        "name": "莎车县"
                    },
                    {
                        "code": "4988",
                        "name": "麦盖提县"
                    }
                ]
            },
            {
                "code": "485",
                "name": "和田地区",
                "sub": [
                    {
                        "code": "4989",
                        "name": "于田县"
                    },
                    {
                        "code": "4990",
                        "name": "和田县"
                    },
                    {
                        "code": "4991",
                        "name": "和田市"
                    },
                    {
                        "code": "4992",
                        "name": "墨玉县"
                    },
                    {
                        "code": "4993",
                        "name": "民丰县"
                    },
                    {
                        "code": "4994",
                        "name": "洛浦县"
                    },
                    {
                        "code": "4995",
                        "name": "皮山县"
                    },
                    {
                        "code": "4996",
                        "name": "策勒县"
                    }
                ]
            },
            {
                "code": "486",
                "name": "伊犁哈萨克自治州",
                "sub": [
                    {
                        "code": "4997",
                        "name": "伊宁县"
                    },
                    {
                        "code": "4998",
                        "name": "伊宁市"
                    },
                    {
                        "code": "4999",
                        "name": "奎屯市"
                    },
                    {
                        "code": "5000",
                        "name": "察布查尔锡伯自治县"
                    },
                    {
                        "code": "5001",
                        "name": "尼勒克县"
                    },
                    {
                        "code": "5002",
                        "name": "巩留县"
                    },
                    {
                        "code": "5003",
                        "name": "新源县"
                    },
                    {
                        "code": "5004",
                        "name": "昭苏县"
                    },
                    {
                        "code": "5005",
                        "name": "特克斯县"
                    },
                    {
                        "code": "5006",
                        "name": "霍城县"
                    }
                ]
            },
            {
                "code": "487",
                "name": "塔城地区",
                "sub": [
                    {
                        "code": "5007",
                        "name": "乌苏市"
                    },
                    {
                        "code": "5008",
                        "name": "和布克赛尔蒙古自治县"
                    },
                    {
                        "code": "5009",
                        "name": "塔城市"
                    },
                    {
                        "code": "5010",
                        "name": "托里县"
                    },
                    {
                        "code": "5011",
                        "name": "沙湾县"
                    },
                    {
                        "code": "5012",
                        "name": "裕民县"
                    },
                    {
                        "code": "5013",
                        "name": "额敏县"
                    }
                ]
            },
            {
                "code": "488",
                "name": "阿勒泰地区",
                "sub": [
                    {
                        "code": "5014",
                        "name": "吉木乃县"
                    },
                    {
                        "code": "5015",
                        "name": "哈巴河县"
                    },
                    {
                        "code": "5016",
                        "name": "富蕴县"
                    },
                    {
                        "code": "5017",
                        "name": "布尔津县"
                    },
                    {
                        "code": "5018",
                        "name": "福海县"
                    },
                    {
                        "code": "5019",
                        "name": "阿勒泰市"
                    },
                    {
                        "code": "5020",
                        "name": "青河县"
                    }
                ]
            },
            {
                "code": "489",
                "name": "石河子市",
                "sub": [
                    {
                        "code": "5021",
                        "name": "石河子市"
                    }
                ]
            },
            {
                "code": "490",
                "name": "阿拉尔市",
                "sub": [
                    {
                        "code": "5022",
                        "name": "阿拉尔市"
                    }
                ]
            },
            {
                "code": "491",
                "name": "图木舒克市",
                "sub": [
                    {
                        "code": "5023",
                        "name": "图木舒克市"
                    }
                ]
            },
            {
                "code": "492",
                "name": "五家渠市",
                "sub": [
                    {
                        "code": "5024",
                        "name": "五家渠市"
                    }
                ]
            }
        ]
    },
    {
        "code": "32",
        "name": "台湾省",
        "sub": [
            {
                "code": "493",
                "name": "台北市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "494",
                "name": "高雄市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "495",
                "name": "基隆市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "496",
                "name": "台中市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "497",
                "name": "台南市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "498",
                "name": "新竹市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "499",
                "name": "嘉义市",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "500",
                "name": "台北县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "501",
                "name": "宜兰县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "502",
                "name": "桃园县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "503",
                "name": "新竹县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "504",
                "name": "苗栗县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "505",
                "name": "台中县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "506",
                "name": "彰化县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "507",
                "name": "南投县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "508",
                "name": "云林县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "509",
                "name": "嘉义县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "510",
                "name": "台南县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "511",
                "name": "高雄县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "512",
                "name": "屏东县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "513",
                "name": "澎湖县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "514",
                "name": "台东县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "515",
                "name": "花莲县",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            }
        ]
    },
    {
        "code": "33",
        "name": "香港特别行政区",
        "sub": [
            {
                "code": "516",
                "name": "中西区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "517",
                "name": "东区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "518",
                "name": "九龙城区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "519",
                "name": "观塘区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "520",
                "name": "南区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "521",
                "name": "深水埗区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "522",
                "name": "黄大仙区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "523",
                "name": "湾仔区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "524",
                "name": "油尖旺区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "525",
                "name": "离岛区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "526",
                "name": "葵青区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "527",
                "name": "北区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "528",
                "name": "西贡区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "529",
                "name": "沙田区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "530",
                "name": "屯门区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "531",
                "name": "大埔区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "532",
                "name": "荃湾区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            },
            {
                "code": "533",
                "name": "元朗区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            }
        ]
    },
    {
        "code": "34",
        "name": "澳门特别行政区",
        "sub": [
            {
                "code": "534",
                "name": "澳门特别行政区",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            }
        ]
    },
    {
        "code": "36",
        "name": "其他",
        "sub": [
            {
                "code": "566",
                "name": "其他",
                "sub": [
                	{
			            "name":"",
			            "code":""
			         }
                ]
            }
        ]
    }
];
}($);
// jshint ignore: end

/* global $:true */
/* jshint unused:false*/

+ function($) {
  "use strict";

  var defaults;
  var raw = $.rawCitiesData;

  var format = function(data) {
    var result = [];
    for(var i=0;i<data.length;i++) {
      var d = data[i];
      if(/^请选择|市辖区/.test(d.name)) continue;
      result.push(d);
    }
    if(result.length) return result;
    return [];
  };

  var sub = function(data) {
    if(!data.sub) return [{ name: '', code: data.code }];  // 有可能某些县级市没有区
    return format(data.sub);
  };

  var getCities = function(d) {
    for(var i=0;i< raw.length;i++) {
      if(raw[i].code === d || raw[i].name === d) return sub(raw[i]);
    }
    return [];
  };

  var getDistricts = function(p, c) {
    for(var i=0;i< raw.length;i++) {
      if(raw[i].code === p || raw[i].name === p) {
        for(var j=0;j< raw[i].sub.length;j++) {
          if(raw[i].sub[j].code === c || raw[i].sub[j].name === c) {
            return sub(raw[i].sub[j]);
          }
        }
      }
    }
  };

  var parseInitValue = function (val) {
    var p = raw[0], c, d;
    var tokens = val.split(' ');
    raw.map(function (t) {
      if (t.name === tokens[0]) p = t;
    });

    p.sub.map(function (t) {
      if (t.name === tokens[1]) c = t;
    })

    if (tokens[2]) {
      c.sub.map(function (t) {
        if (t.name === tokens[2]) d = t;
      })
    }

    if (d) return [p.code, c.code, d.code];
    return [p.code, c.code];
  }

  $.fn.cityPicker = function(params) {
    params = $.extend({}, defaults, params);
    return this.each(function() {
      var self = this;
      
      var provincesName = raw.map(function(d) {
        return d.name;
      });
      var provincesCode = raw.map(function(d) {
        return d.code;
      });
      var initCities = sub(raw[0]);
      var initCitiesName = initCities.map(function (c) {
        return c.name;
      });
      var initCitiesCode = initCities.map(function (c) {
        return c.code;
      });
      var initDistricts = sub(raw[0].sub[0]);

      var initDistrictsName = initDistricts.map(function (c) {
        return c.name;
      });
      var initDistrictsCode = initDistricts.map(function (c) {
        return c.code;
      });

      var currentProvince = provincesName[0];
      var currentCity = initCitiesName[0];
      var currentDistrict = initDistrictsName[0];

      var cols = [
          {
            displayValues: provincesName,
            values: provincesCode,
            cssClass: "col-province"
          },
          {
            displayValues: initCitiesName,
            values: initCitiesCode,
            cssClass: "col-city"
          }
        ];

        if(params.showDistrict) cols.push({
          values: initDistrictsCode,
          displayValues: initDistrictsName,
          cssClass: "col-district"
        });

      var config = {

        cssClass: "city-picker",
        rotateEffect: false,  //为了性能
        formatValue: function (p, values, displayValues) {
          return displayValues.join(' ');
        },
        onChange: function (picker, values, displayValues) {
          var newProvince = picker.cols[0].displayValue;
          var newCity;
          if(newProvince !== currentProvince) {
            var newCities = getCities(newProvince);
            newCity = newCities[0].name;
            var newDistricts = getDistricts(newProvince, newCity);
            picker.cols[1].replaceValues(newCities.map(function (c) {
              return c.code;
            }), newCities.map(function (c) {
              return c.name;
            }));
            if(params.showDistrict) picker.cols[2].replaceValues(newDistricts.map(function (d) {
              return d.code;
            }), newDistricts.map(function (d) {
              return d.name;
            }));
            currentProvince = newProvince;
            currentCity = newCity;
            picker.updateValue();
            return false; // 因为数据未更新完，所以这里不进行后序的值的处理
          } else {
            if(params.showDistrict) {
              newCity = picker.cols[1].displayValue;
              if(newCity !== currentCity) {
                var districts = getDistricts(newProvince, newCity);
                picker.cols[2].replaceValues(districts.map(function (d) {
                  return d.code;
                }), districts.map(function (d) {
                  return d.name;
                }));
                currentCity = newCity;
                picker.updateValue();
                return false; // 因为数据未更新完，所以这里不进行后序的值的处理
              }
            }
          }
          $(self).attr('data-code', values[values.length-1]);
          $(self).attr('data-codes', values.join(','));
          if (params.onChange) {
            params.onChange.call(self, picker, values, displayValues);
          }
        },

        cols: cols
      };

      if(!this) return;
      var p = $.extend({}, params, config);
      //计算value
      var val = $(this).val();
      if (!val) val = '北京 北京市 东城区';
      currentProvince = val.split(" ")[0];
      currentCity = val.split(" ")[1];
      currentDistrict= val.split(" ")[2];
      if(val) {
        p.value = parseInitValue(val);
        if(p.value[0]) {
          var cities = getCities(p.value[0]);
          p.cols[1].values = cities.map(function (c) {
            return c.code;
          });
          p.cols[1].displayValues = cities.map(function (c) {
            return c.name;
          });
        }

        if(p.value[1]) {
          if (params.showDistrict) {
            var dis = getDistricts(p.value[0], p.value[1]);
            p.cols[2].values = dis.map(function (d) {
              return d.code;
            });
            p.cols[2].displayValues = dis.map(function (d) {
              return d.name;
            });
          }
        } else {
          if (params.showDistrict) {
            var dis = getDistricts(p.value[0], p.cols[1].values[0]);
            p.cols[2].values = dis.map(function (d) {
              return d.code;
            });
            p.cols[2].displayValues = dis.map(function (d) {
              return d.name;
            });
          }
        }
      }
      $(this).picker(p);
    });
  };

  defaults = $.fn.cityPicker.prototype.defaults = {
    showDistrict: true //是否显示地区选择
  };

}($);
